{
    "title": "Venison massaman curry",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "4",
    "images": [
        
    ],
    "description": "Massaman curries are a South-East Asian dish with all the fragrant spices you'd expect from the region, but richer and more hearty.",
    "author": {
        "lyndey_milan": "Lyndey Milan"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "This recipe makes 125g/4½oz of curry paste. You will not need all the paste, but any excess can be stored in a clean, airtight jar in the refrigerator for up to a week."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the curry paste": [
            "2 tsp ground coriander",
            "¼ tsp ground cloves",
            "1 tsp ground cinnamon",
            "2 tsp ground cumin",
            "1 tsp shrimp paste, roasted",
            "3 garlic cloves, finely chopped",
            "1 medium (about 150g/5½oz) brown onion, chopped",
            "8 long red chillies, deseeded and roughly chopped",
            "1 stem lemongrass, trimmed, white part chopped",
            "3cm/1¼in piece fresh galangal, peeled and chopped"
        ],
        "For the curry": [
            "400ml tin coconut milk",
            "2 tbsp extra-virgin olive oil (optional)",
            "400–450g/14oz–1lb venison shanks",
            "1 tsp palm sugar (also known as jaggery)",
            "40–60ml/1½–2¼fl oz fish sauce, to taste",
            "60–100ml/2¼–3½fl oz tamarind purée, to taste",
            "5 bay leaves",
            "5 cardamom pods, toasted",
            "1 large sweet potato, peeled and cut into 2cm/¾in cubes",
            "steamed rice, to serve",
            "80g/2¾oz unsalted roasted peanuts, chopped, to serve",
            "30g/1oz fresh coriander leaves, coarsely chopped, to serve"
        ]
    },
    "steps": [
        "To make the paste, place the coriander seeds, cloves, cinnamon and cumin seeds into a small frying pan and cook for 1-2 minutes or until the spices start to release their oils. In a spice grinder or pestle and mortar blend the toasted spices, shrimp paste and a tablespoon of cold water until smooth (you may need to add a little more water). Add the remaining ingredients, one at a time, blending well after each addition until the mixture forms a thick paste.",
        "Preheat the oven to 160C/140C Fan/Gas 3.",
        "Place a large, flameproof casserole over a medium-high heat. If the solid coconut cream has risen to the top of the tin, use this, or else pour in 125ml/4fl oz coconut milk and cook, stirring constantly for 3-5 minutes, until it separates. (If it does not separate, add the optional olive oil). Add 60g/2¼oz of the curry paste and fry, stirring constantly, until fragrant, about 1-2 minutes.",
        "Add the venison and fry for 2-3 minutes until browned all over. Add the remaining coconut milk, reserving 2 tablespoons for the garnish. Increase the heat and bring to the boil. Add the palm sugar, fish sauce, tamarind purée, bay leaves and cardamom and return to the boil. Add 100ml/3½fl oz water to almost cover the venison and keep it moist.",
        "Cook in the oven for an hour or until the venison is nearly tender. Add the sweet potato, cover and return to the oven for a further hour, or until the potato is tender.",
        "Serve the curry with steamed rice topped with the chopped roasted peanuts and the coriander."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}