{
    "title": "Almond rice pudding and cherry compôte",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/almond_rice_pudding_and_42007_16x9.jpg"
    ],
    "description": "This is a traditional Scandinavian recipe, often served as part of a Christmas feast – a whole almond is hidden in the pudding and whoever finds it, gets an extra present. Top with a cherry compôte to make it extra special.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b069hr3q": "The Hairy Bikers' Northern Exposure"
    },
    "tips": [
        "In Scandinavia this dish is traditionally served cold. Let it cool to room temperature before putting it in the fridge. When you are ready to serve, lightly whisk the cream until it is at the soft peak stage and stir it into the rice pudding."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1½ litres/2½ pints whole milk",
            "300g/10½oz short grain or pudding rice",
            "15g/½oz butter",
            "3 tbsp caster sugar",
            "1 vanilla pod, split",
            "100g/3½oz blanched almonds, finely chopped"
        ],
        "For the cherry compôte": [
            "500g/1lb 2oz cherries, pitted",
            "100g/3½oz caster sugar",
            "1 lemon, juice only",
            "2 tsp arrowroot",
            "kirsch, to taste (optional)"
        ],
        "To serve": [
            "100ml/3½fl oz double cream, whipped"
        ]
    },
    "steps": [
        "Put the milk, rice, butter, caster sugar and vanilla pod into a large saucepan. Heat it very slowly, until almost at boiling point, then turn it down. Cook for around 30 minutes on a very low heat, stirring frequently to make sure it does not stick to the bottom.",
        "Meanwhile, make the cherry compôte. Put the cherries in a saucepan with the caster sugar, lemon juice and 300ml/10 fl oz water. Heat slowly, stirring constantly, until the sugar has dissolved, then simmer for around 10 minutes until the cherries are slightly softened. Mix the arrowroot with a little water and stir until smooth. Add to the cherries as they are simmering and stir until the sauce has slightly thickened. Add the kirsch, if using.",
        "Stir the almonds into the pudding. Serve the pudding with a dollop of whipped cream and a large spoonful of the cherry compôte."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}