{
    "author": {
        "james_tanner": "James Tanner"
    },
    "cookTime": "less than 10 mins",
    "cusine": "American",
    "description": "",
    "dishes": [
        "jam",
        "pancake",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chocolate sauce": [
            "55g/2oz dark chocolate, melted",
            "100ml/3½fl oz double cream",
            "½ vanilla pod, seeds scraped out"
        ],
        "For the flambéed cherries": [
            "150g/5½oz fresh cherries, stems and stones removed",
            "1 orange, juice and zest only",
            "2 tbsp Kirsch liqueur"
        ],
        "For the pancakes": [
            "2 free-range eggs",
            "200g/7oz self-raising flour",
            "1 tsp baking powder",
            "300ml/½ pint whole milk",
            "pinch salt",
            "vegetable oil, for frying"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "For the pancakes, whisk the eggs with the flour and baking powder in a large bowl and then add enough milk to make a thick batter. Add a pinch of salt and leave to rest for five minutes.",
        "Heat a drizzle of vegetable oil in a frying pan and then wipe out the excess with kitchen paper. Add spoonfuls of the batter to make two pancakes. Fry for two minutes, flip and cook for another two minutes on the other side, or until just golden-brown. Pile onto a plate and repeat with the rest of the batter.",
        "For the flambéed cherries, place the cherries, orange juice and zest and Kirsch into a hot frying pan, carefully set alight and flambé for one minute. Remove from the heat and set aside to cool slightly.",
        "For the sauce, place the dark chocolate with the double cream and vanilla seeds into a mixing bowl set over a saucepan of just-simmering water (making sure the bottom of the bowl doesn't touch the surface of the water) and stir until melted and smooth.",
        "To serve, pile the pancakes onto a serving plate, top with the flambéed cherries and drizzle over the hot chocolate sauce."
    ],
    "tips": [
        
    ],
    "title": "American pancakes with flambéed cherries and warm chocolate sauce",
    "videos": "[]"
}