{
    "title": "Amy's spicy Nyonya chicken",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "8",
    "images": [
        
    ],
    "description": "This is a simple South-East Asian chicken curry, rich and fragrant with spices. The person who introduced me to this dish, Amy, says she often stirs in a little lime juice and coconut milk at the end to ‘wake up the curry’.",
    "author": {
        "rick_stein": "Rick Stein"
    },
    "show": {
        "b00ltm3b": "Rick Stein's Far Eastern Odyssey"
    },
    "tips": [
        "This curry is very hot, if you like your curries a bit miler reduce the amount of chilli."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the spice paste": [
            "6 dried red chillies, preferably Kashmiri, soaked in hot water for 30 minutes, then drained",
            "75g/2¾oz shallots, thinly sliced",
            "3 fat lemongrass stalks, hard outer leaves removed, soft inner core chopped",
            "40g/1½oz garlic, peeled, roughly chopped",
            "1 tsp shrimp paste (available from some supermarkets and Asian grocers)",
            "25g/1oz galangal or root ginger, peeled, roughly chopped",
            "2 tbsp vegetable oil"
        ],
        "For the chicken": [
            "2 tbsp vegetable oil",
            "1 x 1.5kg/3lb 5oz chicken, cut into 8 pieces",
            "2 lemongrass stalks, bruised with a rolling pin then cut in half lengthways",
            "4 lime leaves",
            "200ml/7fl oz water",
            "1 tsp palm sugar (available from some supermarkets and Asian grocers; substitute golden caster sugar if unavailable)",
            "1 lime, juice only",
            "salt, to taste"
        ]
    },
    "steps": [
        "For the spice paste, blend all of the spice paste ingredients together in a food processor until smooth.",
        "For the chicken, heat the vegetable oil in a frying pan over a medium heat, add the chicken pieces and fry until pale golden-brown all over.",
        "Add the spice paste to the pan and fry for 1-2 minutes, or until fragrant.",
        "Add the bruised lemongrass stalks, lime leaves and water and bring the mixture to a simmer. Simmer for 30-40 minutes, turning the chicken pieces over now and again, until the chicken pieces are completely cooked through and the volume of liquid has reduced by about a half. (NB: The chicken pieces are cooked through when the juices run clear when pierced in the thickest part with a skewer.)",
        "When the chicken is cooked through, stir in the palm sugar and lime juice and season, to taste, with salt.",
        "Serve immediately in serving bowls."
    ],
    "howTos": [
        "testing_cooked_poultry"
    ],
    "videos": "[]"
}