{
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "This quick and easy apple pie is a guaranteed hit - it’s got a hint of caramel and a bit of extra crunch.",
    "dishes": [
        "apple_crumble",
        "bread",
        "caramel",
        "casserole",
        "crumble",
        "custard",
        "oven-baked_dishes",
        "pie",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "70g/2½oz unsalted butter",
            "100g/3½oz brown sugar",
            "6-8 apples (a mixture of cooking and eating varieties), peeled, cored, cut into 2cm/¾in chunks"
        ],
        "For the topping": [
            "300g/10½oz plain flour",
            "200g/7oz cold butter, cubed",
            "pinch ground cinnamon",
            "150g/5oz demerara sugar",
            "100g/3½oz porridge oats"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "9",
    "serves": "Serves 6",
    "show": {
        "b05n2c6h": "The Hairy Bikers and Lorraine Pascale: Cooking the Nation's Favourite Food"
    },
    "steps": [
        "Preheat the oven to 180C/160 Fan/Gas 4.",
        "For the filling, place a casserole or flameproof baking dish over a medium heat. Add the butter and the sugar and stir until melted and well combined.",
        "Increase the heat and continue to cook until the mixture has darkened in colour and started to caramelise (take care you don’t burn the mixture or it will taste bitter).",
        "Add the chopped apples and stir to coat them in the mixture. Continue to cook for 6-8 minutes, or until softened, over a low heat then return the heat to medium and keep cooking until the apple chunks are completely tender. Set the caramelised apples aside to cool while you make the topping.",
        "For the topping, put the flour in a large mixing bowl. Using your fingertips, rub the cold butter into the flour until the mixture resembles breadcrumbs. Gently stir in the remaining topping ingredients until well combined.",
        "Sprinkle the crumble mixture evenly on top of the apple filling. Bake in the oven for 30-35 minutes, or until the filling is piping hot and the crumble is golden-brown all over. Serve with custard or cream."
    ],
    "tips": [
        "The apples are cooked in a casserole to reduce the amount of washing up, but can also be cooked in a pan and transferred to a baking dish before adding the crumble topping."
    ],
    "title": "Apple crumble",
    "videos": "[]"
}