{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Sweet and sour, that classic combination, works wonders in this delicious meringue pie recipe.",
    "dishes": [
        "meringue",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "cartouche"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "750g/1lb 10oz apples, peeled",
            "125g/4oz caster sugar",
            "4-6 passion fruit, pulp only"
        ],
        "For the meringue": [
            "2 free-range eggs, whites only",
            "100g/3½oz caster sugar"
        ],
        "For the pastry": [
            "225g/8oz plain flour",
            "100g/3½ oz unsalted butter",
            "25g/1oz caster sugar",
            "1 free-range egg whisked with 1 tbsp milk, plus 1 egg, beaten for the egg wash"
        ],
        "To serve": [
            "clotted cream"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 6",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "For the pastry, pulse all of the pastry ingredients in a food processor until the mixture just comes together as a dough. Tip the mixture out on a floured work surface and knead briefly until smooth. Roll the pastry out to as 3mm/⅛in thickness and use it to line a 20cm/8inch shallow tart tin. Chill in the fridge for two hours.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "Line the pastry case with greaseproof paper and fill with baking beans. Bake the pastry for 15-20 minutes, then remove the greaseproof paper and baking beans, brush all over with the egg wash and cook for a further five minutes.",
        "Meanwhile for the filling, cook the apples and sugar in a saucepan for 6-8 minutes, or until softened. Set aside to cool.",
        "Drain the apple mixture and place it into a bowl with the passion fruit. Spoon the filling into the cooked pastry case.",
        "For the meringue, whish the egg whites in a large bowl with an electric whisk until stiff peaks form. Slowly whisk in the sugar.",
        "Spoon the meringue on top of the pie and tease into spikes with a fork.",
        "Reduce the oven temperature to 180C/350F/Gas 4. Cook the pie for a further six minutes. (Alternatively you can brown the top of the meringue with a blow torch or by placing under a hot grill.)",
        "Serve the pie with clotted cream."
    ],
    "tips": [
        
    ],
    "title": "Apple and passion fruit meringue pie",
    "videos": "[]"
}