{
    "author": {
        "phil_vickery": "Phil Vickery"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bread",
        "icing",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the apple fritters": [
            "300ml/10½fl oz hot vegetable oil",
            "2 free-range eggs, beaten",
            "150g/5½oz self-raising flour",
            "water, to mix",
            "2 tbsp chopped fresh mint",
            "1 apple, cut into segments"
        ],
        "For the crème anglaise": [
            "3 free-range egg yolks",
            "4 tbsp caster sugar",
            "1 vanilla pod, split in half, seeds scraped out",
            "1 tbsp cornflour",
            "½ pint whole milk"
        ],
        "To serve": [
            "cinnamon, for dusting",
            "icing sugar, for dusting"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "For the apple fritters, heat the vegetable oil in a deep heavy-bottomed saucepan, until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended.)",
        "Place the eggs, flour and water into a bowl and mix together to create a smooth batter. Add the chopped mint and stir well.",
        "Dip the apple into the batter mixture and carefully add to the hot oil. Deep-fry the fritters until golden and crisp, then carefully remove with a slotted spoon and drain on kitchen paper.",
        "For the crème anglaise, place the egg yolks and sugar into a bowl and beat together until light. Add the cornflour and vanilla seeds and mix well.",
        "Place the milk into a saucepan and heat to scalding point - do not boil.",
        "Add the warmed milk to the egg mixture, then return the milk mixture to the saucepan and place back onto the heat. Simmer the mixture for three minutes, stirring constantly, until it coats the back of a spoon.",
        "To serve, place the crème anglaise into a bowl with the apple fritters placed on top. Dust with cinnamon and icing sugar."
    ],
    "tips": [
        
    ],
    "title": "Apple fritters with crème anglaise",
    "videos": "[]"
}