{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "These pretty apple tarts belie just how quick and easy they are to make. Perfect for dinner parties.",
    "dishes": [
        "caramel",
        "fruit_tart",
        "jam",
        "marzipan",
        "oven-baked_dishes",
        "pastry",
        "sauce",
        "tarts"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the spiced caramel sauce": [
            "150g/5½oz caster sugar",
            "2 star anise",
            "½ tsp cloves",
            "¼ tsp freshly grated nutmeg",
            "½ tsp juniper berries",
            "175ml/6fl oz double cream"
        ],
        "For the tart": [
            "450g/1lb all-butter puff pastry",
            "1 free-range egg yolk, beaten",
            "300g/10½oz marzipan",
            "4 dessert apples, peeled, cored and finely sliced",
            "50g/1¾oz butter",
            "4 tbsp clear honey",
            "vanilla ice cream, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4",
    "show": {
        "b03lsr84": "Christmas Kitchen with James Martin"
    },
    "steps": [
        "Preheat the oven to 210C/425F/Gas 7.",
        "On a lightly floured work surface, roll out the puff pastry to 3-4mm/⅛in thick. Cut out four 12cm/4½in circles using a pastry cutter and transfer to a baking tray.",
        "Score a circle in the centre of the pastry with a knife (leaving a 1cm/½in border) then brush with egg wash.",
        "Roll the marzipan out to 5mm/¼in thick and cut into four 11cm/4¼in circles and place in the centre of the pastry. Carefully place the apples in an overlapping ring over the marzipan to cover it all.",
        "Place the butter and honey in a small saucepan and bring to a simmer, stirring to combine. Brush most of it over the top of the apples.",
        "Place in the oven and bake for 15-18 minutes, or until the pastry is risen and golden-brown.",
        "Brush with any remaining melted butter and honey to glaze.",
        "For the spiced caramel sauce, place the sugar and spices in a frying pan and cook until the sugar is melted and golden-brown. Whisk in the double cream and bring to a simmer.",
        "Cook for 3-5 minutes, or until just thickened, then pass through a fine sieve into a clean pan.",
        "To serve, place the tarts in the centre of serving plates and spoon the sauce around the edge. Finish with a spoonful of ice cream on top."
    ],
    "tips": [
        
    ],
    "title": "Apple tart with spiced caramel sauce",
    "videos": "[]"
}