{
    "author": {
        "jasmine_and_melissa_hemsley": "Hemsley + Hemsley"
    },
    "cookTime": "10 to 30 mins",
    "description": "This nutty apple tart is as easy as pie - and the ginger and cinnamon spices give it a Christmassy aroma.",
    "dishes": [
        "oven-baked_dishes",
        "pastry",
        "pie",
        "tarts"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the almond shortcrust pastry": [
            "200g/7oz ground almonds",
            "¼ tsp salt",
            "¼ tsp bicarbonate of soda",
            "¾ tbsp maple syrup",
            "15g/½oz butter, softened",
            "1 free-range egg"
        ],
        "For the filling": [
            "2 eating apples, peeled",
            "1 tsp vanilla extract",
            "35g/1¼oz raisins",
            "1 tsp ground cinnamon",
            "2 tsp maple syrup",
            "10g/½oz cold butter, diced",
            "50g/1¾oz almond flakes"
        ],
        "For the ginger crème fraîche": [
            "400g/14oz full-fat crème fraîche",
            "2cm/5in piece fresh root ginger, peeled and finely grated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4-6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the almond shortcrust pastry, preheat the oven to 170C/150C Fan/Gas 3½.",
        "In a large bowl, mix together all of the pastry ingredients until they come together as a soft dough. Wrap in cling film and chill in the fridge for at least 30 minutes.",
        "For the filling, using a spiraliser set to the julienne setting, cut the apples into long spirals that resemble noodles (alternatively coarsely grate the apples). Place them in a bowl. Sprinkle over the vanilla extract, raisins, cinnamon, maple syrup and butter and mix to combine.",
        "Roll the chilled dough out onto a piece of baking parchment lightly dusted with flour to form a rectangle about 3-4mm thick. Transfer the paper and rolled pastry to a baking tray.",
        "Pile the apple ‘noodles’ onto one side of the pastry rectangle. Fold the other half ot the pastry over the top, using the baking paper to help you. Press down gently at the edges to seal.",
        "Bake the apple noodle tart in the oven on the middle shelf for 12-15 minutes, then remove the tart from the oven and sprinkle over the almonds. Return to the oven for 4-5 minutes, or until the pastry is crisp and golden-brown and the filling has softened. Remove from the oven and set aside to cool for 10-15 minutes.",
        "Meanwhile, for the ginger crème fraîche, mix the crème fraîche and ginger together in a bowl until well combined.",
        "To serve, slice the apple noodle tart into wedges and top each with a dollop of the ginger crème fraîche."
    ],
    "tips": [
        
    ],
    "title": "Apple noodle tart with toasted almonds and ginger crème fraîche",
    "videos": "[]"
}