{
    "author": {
        "nancy": "Nancy Birtwhistle"
    },
    "cookTime": "less than 10 mins",
    "cusine": "French",
    "description": "A pastry for those who like it a bit on the tart side, the intense lemon flavour will definitely perk you up!",
    "dishes": [
        "icing",
        "oven-baked_dishes",
        "pastry",
        "patisserie",
        "pie",
        "prepare-ahead_desserts"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "how_to_shape_danish_pastries"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the apple and lemon filling": [
            "30g/1oz caster sugar",
            "30g/1oz icing sugar",
            "30g/1oz ground almonds",
            "½ unwaxed lemon, zest only",
            "2 drops lemon extract",
            "1 large free-range egg yolk, beaten",
            "1 dessert apple (ideally Pink Lady or braeburn)",
            "1 tbsp lemon juice"
        ],
        "For the dough": [
            "160g/5¾oz unsalted butter, 120g/4¼oz chilled and 40g/1½oz at room temperature",
            "250g/9oz strong white flour",
            "10g/⅓oz powdered milk",
            "30g/1oz caster sugar",
            "7g salt",
            "8.5g fast-action dried yeast"
        ],
        "For the lemon glaze and icing": [
            "50ml/1¾fl oz lemon juice",
            "50g/1¾oz caster sugar",
            "3 tbsp icing sugar",
            "1 large free-range egg, beaten"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "",
    "serves": "Makes 6 pastries",
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "steps": [
        "Prepare the chilled butter by placing it between two sheets of greaseproof paper and banging with a rolling pin until you have a 8x15cm/3¼x6in rectangle about 1cm/½in thick. Put this back into the fridge.",
        "Place the room temperature butter, strong white flour, powdered milk, caster sugar, salt and 150ml/5fl oz water into the bowl of a freestanding mixer fitted with a dough hook. Mix on a low setting until combined. Pour in the yeast and continue to mix on low speed for five minutes, then turn up the speed to medium and continue mixing for another 5-7 minutes.",
        "Tip the dough out of the bowl and bring it together into a smooth ball, then place in a greased, non-metallic bowl and set aside, covered, for 15 minutes.",
        "Transfer the bowl to the microwave and heat at 100 watts for six minutes then leave to rest for another 10 minutes. Alternatively, prove the dough in a warm room for a further 45 minutes, or until doubled in size.",
        "Tip the risen dough out onto a worktop then roll out into a 18x25cm/7x10in rectangle about 1cm/½in thick.",
        "Transfer to a baking sheet lined with baking parchment, cover with cling film and place in the freezer for 10 minutes.",
        "Remove the dough from the freezer and place the rolled block of chilled butter in the centre of the rectangle. Fold the top third over the butter then the bottom third up over the top. Roll out until it is about 1cm/½in thick again, turn the dough 90 degrees and repeat the folding and rolling process again.",
        "Fold the dough back into thirds and place back into the freezer for 15 minutes. Roll out again and this time fold into quarters – folding each short edge into the centre, then closing it up like a book. Roll out again, then repeat this double-fold once more and freeze the dough for another 15 minutes.",
        "Wrap the dough in cling film and set aside in the fridge.",
        "For the apple and lemon filling, place the sugars, almonds, lemon zest and extract in a bowl and mix. Add a little egg yolk to bind the dry ingredients and mix to a smooth paste. Tip the paste onto the work surface, then roll into six equal balls and place in the fridge.",
        "Slice the dessert apple very thinly, keeping the skin on, allowing four slices for each kite, i.e. 24 pieces. Place into a bowl with the lemon juice to prevent them turning brown.",
        "Roll out the chilled dough into a rectangle 20x30cm/8x12in and cut into six equal squares (approximately 10cm/4in). Leaving a 1cm/½in border, cut a 4cm/1½in square from the middle of each square - cutting right through two opposite corners, but leaving the other two corners connected for about 1cm/½in either side of the corner points (see item four in the technique video below for further guidance). Brush a little beaten egg in the centre, add a squished ball of almond and lemon filling and then place four apple slices over the top. Fold the corner borders over to the opposing sides of the internal square. Sprinkle caster sugar over the apples and leave to prove for an hour.",
        "To make the lemon glaze, put 25ml/1fl oz water, half the lemon juice and the sugar in a pan set over a low heat. Cook until the sugar is dissolved then bring to a boil and continue to simmer for about 5-10 minutes, or until a thick syrup forms. Set aside to cool.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "When ready to bake, brush the top of the pastries (though not the apple slices) with beaten egg and bake for 8-10 minutes, or until golden-brown. Remove from the oven, brush with the lemon glaze and allow to cool for five minutes on the tray before transferring to a wire rack. Leave to cool completely.",
        "To make the lemon icing, mix the icing sugar with a teaspoon of lemon juice to form a thick icing. Place in a food bag with a small corner cut off .",
        "Once the kites are completely cool, drizzle with the lemon icing and serve."
    ],
    "tips": [
        "This recipe uses a microwave to speed-up the process of proving dough. For this to work you need a microwave which can operate on a very low power. To test yours, heat a large knob of chilled butter on the lowest setting for two minutes. If the butter is softened, your microwave can be used for proving, but if the butter is completely melted it's too powerful to use in this way."
    ],
    "title": "Apple and lemon kites",
    "videos": "[]"
}