{
    "title": "Apricot almond cake with rosewater and cardamom",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8-10",
    "recommendations": "12",
    "images": [
        
    ],
    "description": "This is my idea of a perfect cake: simple, beautiful, fragrant and beguiling. I’ve been making this sort of cake, in one form or another, since my clementine cake in How To Eat, and I can’t help but feel, with a certain calm excitement, that it has reached its apogee here. For this recipe you will need a 20cm/8in round springform cake tin and a food processor.",
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "tips": [
        "One of the things that makes this so easy, is that you can throw all the ingredients into a food processor. But if you don’t have one, simply chop the prepared dried apricots and cardamom seeds very finely and then beat together with the remaining cake ingredients."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "150g/5½oz ready-to-eat dried apricots",
            "2 cardamom pods, cracked",
            "200g/7oz ground almonds",
            "50g/1¾oz fine polenta (not instant)",
            "1 tsp baking powder (gluten-free if required)",
            "150g/5½oz caster sugar",
            "6 large free-range eggs",
            "2 tsp lemon juice",
            "1 tsp rosewater",
            "non-stick cooking spray or sunflower oil for greasing"
        ],
        "To decorate": [
            "2 tsp rose petal or apricot jam",
            "1 tsp lemon juice",
            "2½ tsp very finely chopped pistachios"
        ]
    },
    "steps": [
        "Put the dried apricots into a small saucepan, cover them with 250ml/9fl oz cold water, and drop in the cracked cardamom pods with their fragrant seeds. Put on the heat, then bring to the boil and let it bubble for 10 minutes – don’t stray too far away from the pan, as by the end of the 10 minutes the pan will be just about out of water and you want to make sure it doesn’t actually run dry as the apricots will absorb more water as they cool. Take the pan off the heat, place on a cold, heatproof surface and let the apricots cool.",
        "Preheat the oven to 180C/160C Fan/Gas 4. Grease the sides of the springform cake tin and line the bottom with baking parchment.",
        "Remove 5 of the dried apricots and tear each in half, then set aside. Discard the cardamom husks, leaving the seeds in the pan.",
        "Pour and scrape out the sticky contents of the pan into the bowl of a food processor. Add the ground almonds, polenta, baking powder, caster sugar and eggs, and give a good long blitz to combine.",
        "Open the top of the processor, scrape down the batter, add 2 teaspoons of lemon juice and the rosewater, and blitz again. Scrape into the prepared tin and smooth with a spatula. Arrange the apricot halves around the circumference of the tin.",
        "Bake for 40 minutes, though if the cake is browning up a lot before it’s actually ready, you may want to cover loosely with foil at the 30-minute mark. When it’s ready, the cake will be coming away from the edges of the tin, the top will feel firm, and a cake tester will come out with just one or two damp crumbs on it.",
        "Remove the cake to a wire rack. If you’re using apricot jam to decorate, you may want to warm it a little first so that it’s easier to spread; rose petal jam is so lusciously soft-set, it shouldn’t need any help. Stir a teaspoon of lemon juice into the jam and brush over the top of the cake, then sprinkle with the chopped pistachios and leave the cake to cool in its tin before removing to a plate."
    ],
    "howTos": [
        
    ],
    "videos": "[p036n1jy:p036n1k5]"
}