{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Italian",
    "description": "These delicate arancini are so moreish. Try serving them as canapés at your next party and watch them disappear.",
    "dishes": [
        "bread",
        "canape",
        "ham",
        "jam",
        "risotto",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "vegetable oil, for deep-frying",
            "50g/1¾oz serrano or Parma ham, chopped",
            "4 tbsp grated parmesan",
            "approximately 300g/10½oz leftover chilled cooked risotto",
            "90g/3¼oz plain flour",
            "2 free-range eggs, lightly beaten",
            "75g/2½oz fresh breadcrumbs",
            "50g/1¾oz cornflour",
            "125ml/4½fl oz sparkling water",
            "8 courgette flowers",
            "1 lemon, cut into wedges"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Heat the oil a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (Caution: Hot oil can be dangerous. Do not leave unattended.)",
        "Mix the chopped ham and parmesan into the cold risotto, then roll the risotto into small balls, each about the size of a golf ball.",
        "Sprinkle 40g/1½oz of the flour onto a plate. Beat the eggs in a bowl. Sprinkle the breadcrumbs onto a separate plate. Dust each risotto ball in the flour, then dip into the beaten egg, then roll in the breadcrumbs until completely coated.",
        "Carefully lower the arancini into the hot oil in batches and fry for 2-3 minutes, or until golden-brown and heated through. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Keep warm.",
        "Meanwhile, in a bowl, whisk together the cornflour, the remaining flour and the sparkling water until smooth and well combined. Dip the courgette flowers into this batter.",
        "Fry the courgette flowers in batches for 1-2 minutes, or until the batter is crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.",
        "Serve the arancini with the courgette flowers and lemon wedges alongside."
    ],
    "tips": [
        "If you want to make the arancini from freshly cooked risotto, spread the cooked risotto onto a large, high-sided baking tray lined with greaseproof paper and leave in a cool place. Once cool, chill for as long as possible before rolling the risotto into balls."
    ],
    "title": "Arancini with deep-fried courgette flowers",
    "videos": "[p02ffym2:p02ffymp]"
}