{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "White asparagus, or spargel, is the most popular variety in Germany and this soup is a must during the spargel season, which begins in mid-May. We visited an asparagus grower, picked some stems and cooked them right away in this lovely delicate soup. It can also be made with green asparagus if you can’t find the white kind.",
    "dishes": [
        "bread",
        "pie",
        "sauce",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2oz white asparagus",
            "50g/2oz unsalted butter",
            "1 shallot, finely chopped",
            "700ml/1¼ pints chicken stock",
            "70ml/4½ tbsp crème fraiche",
            "2 egg yolks",
            "1 tbsp dry fino sherry",
            "2 tbsp chopped parsley, to garnish",
            "sea salt flakes",
            "white pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4 - 6",
    "show": {
        "b01dl8gl": "Hairy Bikers' Bakeation"
    },
    "steps": [
        "First peel each asparagus stalk from the tip to the cut end. Chop off the tips and set them aside, then cut the stalks into 1cm pieces.",
        "Melt the butter in a saucepan and sweat the shallot for about 5 minutes until translucent – don’t let it brown. Add the chopped asparagus stalks, keeping the tips aside, and sweat them gently with the shallot for another 5 minutes.",
        "Pour in the stock and simmer until the stalks are very tender. This will take 20–30 minutes, depending on the thickness of the stalks. Tip everything into a food processor and blitz until very smooth, then pour the soup back into the saucepan.",
        "Bring the soup back to a simmer and add the reserved asparagus tips. Cook gently for about 5 minutes until the asparagus tips are just cooked through.",
        "Mix the crème fraiche, egg yolks and sherry in a small bowl. With the pan off the heat, stir this mixture into the soup and continue to stir gently for a couple of minutes until the egg yolks have thickened the soup. Warm through over a very gentle heat, stirring constantly and taking care not to break up the asparagus tips.",
        "Serve the soup garnished with a sprinkling of parsley and a generous slab of well-buttered German potato bread on the side. Phwoar!"
    ],
    "tips": [
        
    ],
    "title": "Asparagus soup (Spargel)",
    "videos": "[]"
}