{
    "author": {
        "lotte_duncan": "Lotte Duncan"
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "",
    "dishes": [
        "ham",
        "jelly",
        "oven-baked_dishes",
        "sauce",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        "skimming_stock"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Quince and Orange Sauce": [
            "3 tbsp (45g) quince jelly",
            "grated rind and juice of 3 oranges",
            "grated rind and juice of 1 lemon",
            "2tsp (10g) whole grain mustard",
            "1 tsp (5ml) red wine vinegar",
            "honey to taste",
            "a little reserved stock"
        ],
        "default": [
            "1 x 4lb (1.8kg) gammon ham",
            "cold water (enough to cover the ham in a pot)",
            "2pt (just over a litre) cider",
            "1 x litre (1¾pt) carton apple juice",
            "1 large onion",
            "1 bay leaf",
            "8 peppercorns",
            "2oz (50g) butter",
            "4oz (100g) light brown muscovado sugar",
            "1 tsp (5g) dry mustard",
            "½ tsp (2.5g) ground cloves",
            "½ tsp (2.5g) ground cinnamon",
            "a few cloves"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "8",
    "serves": "Serves 8",
    "show": {
        
    },
    "steps": [
        "Soak the ham overnight in cold water. Drain and put the ham into a large saucepan with the cider and apple juice and top up with cold water until you just cover it.",
        "Add the onion, bay leaf and peppercorns and then bring up to the boil. Now skim the surface and reduce the heat. Simmer gently for 1½ hours.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "Remove the joint from the pan, peel off the skin and mark the fat into diamond shapes with a sharp knife. Reserve the stock for the sauce and for later if you want to make soup!",
        "Stand the gammon in a roasting tin. Mix the butter with the sugar, mustard and ground spices to a paste. Spread this over the fat. Press a clove into the middle of each diamond.",
        "Roast in the oven for about 15 to 30 minutes, or until the fat is crisp and golden.",
        "In the meantime make the sauce by melting the quince jelly in a saucepan, adding the orange and lemon rind and juice and stirring well.",
        "Stir in the mustard and vinegar and add the honey to taste. Add a little of the stock if necessary.",
        "To serve, slice up the ham, pour over a little sauce."
    ],
    "tips": [
        
    ],
    "title": "Baked ham with cider and spices, quince and orange sauce",
    "videos": "[]"
}