{
    "title": "Baked raspberry cheesecake with chocolate and raspberry sauce",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "",
    "author": {
        "aldo_zilli": "Aldo Zilli"
    },
    "show": {
        "b00dznhb": "Put Your Money Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "175g/6¼oz digestive biscuits, crushed",
            "75g/2½oz butter, melted, plus 50g/1¾oz extra, for greasing",
            "700g/1lb 8¾oz ricotta",
            "140ml/5¼fl oz double cream",
            "3 free-range eggs",
            "75g/2½oz caster sugar",
            "3 tbsp plain flour",
            "250g/8¾oz frozen raspberries"
        ],
        "For the chocolate and raspberry sauce": [
            "100g/3½oz frozen raspberries",
            "250ml/8¾fl oz double cream",
            "150g/5½oz dark chocolate, minimum 70 per cent cocoa solids",
            "ready-made vanilla ice cream, to serve"
        ]
    },
    "steps": [
        "Preheat the oven to 150C/300F/Gas 2. Grease a 20cm/8in springform cake tin with butter and line the base of the tin with greaseproof paper.",
        "In a bowl, mix together the crushed biscuits and melted butter until well combined. Press the mixture into the prepared tin to form the cheesecake base. Chill in the fridge for 20 minutes.",
        "Meanwhile, in a separate bowl, whisk together the ricotta, double cream, eggs, sugar and flour until well combined. Carefully fold in the raspberries.",
        "When the cheesecake base has chilled, pour over the filling mixture and bake in the oven for 1 hour 25 minutes, or until set (the cheesecake is set when a skewer inserted into the centre of the cheesecake comes out clean). Set aside to cool, then remove the cheesecake from the springform tin.",
        "Meanwhile, for the chocolate and raspberry sauce, heat the raspberries in a pan over a low heat until they have broken down to a purée. Strain the raspberries through a sieve to remove any seeds. Reserve the strained liquid.",
        "Bring the cream to a simmer in a separate pan, then add the chocolate pieces and stir until melted.",
        "Add the reserved raspberry purée and stir to combine. Strain the mixture through a fine sieve and keep warm.",
        "To serve, place one slice of raspberry cheesecake into the centre of each of eight serving plates. Drizzle over the raspberry and chocolate sauce and place a scoop of ice cream alongside."
    ],
    "howTos": [
        "folding"
    ],
    "videos": "[]"
}