{
    "title": "Baked celeriac with smoked trout and caper salsa",
    "cookTime": "1 to 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Celeriac is not the prettiest vegetable but this simple recipe shows you how to make it the star of the show.",
    "author": {
        "yottam_ottolenghi": "Yotam Ottolenghi"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the baked celeriac with smoked trout": [
            "1 medium celeriac, skin scrubbed but left on, cut in half lengthways",
            "2 tbsp olive oil",
            "10g/¼oz thyme sprigs",
            "80g/2¾oz crème fraîche",
            "20g/¾oz fresh horseradish, peeled and finely grated (use horseradish cream as an alternative)",
            "150g/5½oz smoked trout or salmon, sliced into 3cm/1¼in strips",
            "2 tsp lemon juice",
            "flaky sea salt and black pepper"
        ],
        "For the salsa": [
            "20g/¾oz small capers (or regular capers, chopped)",
            "1 tbsp finely chopped parsley",
            "1 tsp finely chopped tarragon",
            "1½ tbsp olive oil"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "Place the celeriac halves on 2 separate pieces of foil, large enough to cover the celeriac. Drizzle 1 tablespoon of oil over each half, along with the thyme and ¾ teaspoon of salt (on each half) and rub everything evenly. Finish with a generous grind of pepper and then seal the celeriac in the foil. Bake for an hour, until soft. Remove from the oven, unwrap and foil and set aside for about half an hour, for the celeriac to come to room temperature.",
        "Meanwhile, mix together the crème fraiche and horseradish, with a pinch of salt and a grind of pepper. Keep in the fridge until ready to serve.",
        "For the salsa, mix together all the ingredients and set aside.",
        "When ready to serve, cut each celeriac half into 4 long wedges, each about 4-5cm/1½-2in wide. Place 2 wedges onto each plate and then spoon the horseradish cream on top. Layer the trout or salmon on top of this, followed by the salsa. Drizzle each portion with lemon juice and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}