{
    "title": "Baked Bramley apple with spiced custard and apple granita",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "over 2 hours",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "Comforting baked apples with homemade custard, topped with a refreshing granita. Equipment and preparation: for this recipe you will need a juicer and four ramekins or small ovenproof dishes.",
    "author": {
        "sat_bains": "Sat Bains"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "Using pasteurised egg yolks ensures that the custard is perfectly safe to eat, although fresh eggs will be fine for most people."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the apple granita": [
            "4 Bramley apples (or 125ml/4fl oz apple juice if you do not have a juicer)",
            "sugar, to taste"
        ],
        "For the baked apples": [
            "2 Bramley apples, peeled, cored and cut in half",
            "100g/3½oz butter",
            "50g/1¾oz demerara sugar",
            "110g/3¾oz raisins",
            "50ml/1¾fl oz double cream",
            "110g/3½oz soft brown sugar",
            "5g ground mixed spice",
            "1 lemon, zest only",
            "1 orange, zest only"
        ],
        "For the pine custard": [
            "250ml/9fl oz milk",
            "250ml/9fl oz cream",
            "50g/1¾oz fresh Douglas fir pine needles",
            "200g/7oz pasteurised egg yolk, or fresh egg yolks",
            "80g/2¾oz caster sugar"
        ]
    },
    "steps": [
        "For the apple granita, juice the apples using a juicer (or alternatively use bought apple juice). You will need 125ml/4fl oz apple juice. Add a little sugar if it is too sour, then strain through a fine metal sieve into a freezable tub. Freeze until completely frozen.",
        "For the baked apples, preheat the oven to 240C/475F/Gas 9.",
        "Use a pastry brush to coat the apples in some of the butter and sprinkle over the demerara sugar. Set aside until needed.",
        "Place the remaining baked apple ingredients, except the mixed spice and zests, into a pan. Bring to the boil and simmer for two minutes. Remove from the heat and add the mixed spice and zest.",
        "Divide the mixture between four small ovenproof pots or ramekins and top with the halved apples.Transfer to the oven and bake for 10 minutes.",
        "Reduce the oven temperature to 160C/325F/Gas 3 and cook until soft (approximately 10 minutes), then set aside.",
        "For the pine custard, in a pan bring the milk, cream and pine needles up to the boil. Turn off the heat and set aside for 30 minutes to infuse.",
        "When the mix has infused, slowly bring back up to the boil.",
        "Whisk together the egg yolks and sugar in a large heatproof bowl until pale.",
        "When the infused milk is boiling, turn off the heat. Pour it gradually, in a steady stream, into the egg yolk mixture, whisking constantly. Keep whisking until the mixture has cooled down a little, then strain through a fine metal sieve into a clean pan and keep warm.",
        "When ready to serve, scrape the frozen juice with the back of a spoon to form a granita.",
        "To serve, divide the custard between four bowls then place a baked apple half on top and sprinkle over the granita. Serve at once."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}