{
    "title": "Baked peaches with amaretti crumble and cream",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "This easy summer fruit crumble of peach halves covered with an irresistibly nutty, crunchy topping is sure to become a family favourite.",
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "show": {
        "b01rycym": "Chefs: Put Your Menu Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the filling": [
            "75g/2½oz whole hazelnuts",
            "40g/½oz oat biscuits",
            "40g/½oz amaretti biscuits",
            "50g/1¾oz unsalted butter, room temperature",
            "25g/1oz caster sugar",
            "1 free-range egg yolk"
        ],
        "For the baked peaches": [
            "½ lemon, juice only",
            "4 ripe peaches or nectarines",
            "1 tsp lemon zest"
        ],
        "To garnish": [
            "4 tbsp thick cream",
            "4 sprigs fresh mint (optional)"
        ]
    },
    "steps": [
        "Preheat the oven to 190C/375F/Gas 5.",
        "For the filling, dry fry the hazelnuts in a pan over a medium heat until golden-brown (take care not to leave them on the heat for too long). Chop the hazelnuts finely.",
        "Crush both types of biscuit roughly using a rolling pin or the bottom of a clean small pan.",
        "Mix the hazelnuts, biscuits, butter, sugar, and egg yolk in a bowl until the ingredients hold together as a rough paste.",
        "For the baked peaches, put the lemon juice in a shallow dish. Slice the peaches in half, remove the stones and put the cut half in the lemon juice to avoid discolouration.",
        "Pack a round spoonful of the filling onto each half. This should fill the cavity and cover most of the exposed half. Place the halves in an ovenproof dish, and bake for 15-20 minutes, depending on the ripeness of the peaches.",
        "To serve, place the baked peaches on to serving plates, and scoop a dollop of the thick cream beside it. Garnish with mint if desired."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}