{
    "author": {
        "darina_allen_and_rosemary_kearney": "Darina Allen and Rosemary Kearney"
    },
    "cookTime": "1 to 2 hours",
    "description": "Soft, speckled bananas are best for this recipe. The mixture also makes adorable little mini muffins if you cook them in individual cases - great for children's packed lunches. Big kids like them too!",
    "dishes": [
        "banana_bread",
        "bread",
        "muffins",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "creaming"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/bananabread_74771_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "40g/1½oz cherries",
            "75g/3oz sultanas",
            "110g/4oz butter, softened",
            "110g/4oz caster sugar",
            "2 large eggs, preferably free-range",
            "3 large ripe bananas",
            "175g/6oz fine rice flour",
            "50g/2oz cornflour",
            "2 tsp gluten-free baking powder",
            "½ tsp salt",
            "1kg/2lb loaf tin, lined with parchment paper, or 24 small paper muffin cases"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "14",
    "serves": "Makes 1 x 900g/2lb loaf",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Wash and dry the cherries. Cut into quarters and mix with the sultanas. Set aside.",
        "Cream the butter and sugar together until pale, light and soft. Add the eggs, one by one, and beat well between each addition.",
        "Mash the bananas and add to the creamed mixture. Sift the rice flour, cornflour, gluten-free baking powder and salt together and fold carefully into the banana mixture. Very gently, stir in the cherries and sultanas, so that they are evenly distributed through the mixture.",
        "Pour the mixture into the loaf tin or into 24 small muffin cases and bake in the oven for about 1¼ - 1½ hours for the loaf, 25 minutes for the mini muffins, until golden on top and a skewer inserted into the centre comes out clean.",
        "Remove the loaf from the tin and cool on a wire rack; cool mini muffins on a rack in their paper cases. Slice the loaf into eight slices to serve."
    ],
    "tips": [
        
    ],
    "title": "Gluten-free banana bread",
    "videos": "[]"
}