{
    "author": {
        "anna_jones": "Anna Jones"
    },
    "cookTime": "10 to 30 mins",
    "description": "This delicious dairy-free, egg-free recipe is jam packed with good ingredients. A scoop of coconut ice cream will turn them into a feel-good pudding, too.",
    "dishes": [
        "caramel",
        "compote",
        "jam",
        "oven-baked_dishes",
        "pancake"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the batter": [
            "100g/3½oz porridge oats",
            "50g/1¾oz pecan nuts, roughly chopped",
            "1 tsp baking powder",
            "pinch sea salt",
            "1 ripe banana, peeled and mashed",
            "150ml/5fl oz coconut milk or almond milk",
            "4 tbsp coconut oil, for frying",
            "200g/7oz blueberries"
        ],
        "For the blueberry compôte": [
            "200g/7oz blueberries",
            "100g/3½oz caster sugar"
        ],
        "To serve": [
            "2 bananas, peeled and cut into thin slices",
            "50g/1¾oz pecan nuts, finely chopped",
            "1 lime, cut into wedges",
            "8 tbsp maple syrup (optional)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Makes 8 small pancakes",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 120C/100C fan/Gas ½.",
        "In a food processor, pulse the oats until you have a coarse flour. Transfer to a large bowl. Add the pecans, baking powder and salt.",
        "In a separate bowl, mix the mashed banana with the milk (you can do this in the food processor, if you like). Beat the banana mixture into the dry ingredients and leave the batter to sit for a few minutes.",
        "For the blueberry compôte, put the blueberries and sugar in a small frying pan and cook for 3-4 minutes, or until you have a thick shiny compôte. Set aside until ready to serve.",
        "Heat a non-stick pan over a medium heat. Add the banana slices and fry on both sides in the dry pan until golden-brown and caramelised. Keep warm in the oven.",
        "Put the pan back on the heat and add a little coconut oil or butter. Drop in a generous tablespoon of batter for each pancake. Once the sides are cooked and bubbles have risen to the top, scatter over a handful of blueberries and flip the pancake over. Cook for another couple of minutes on the other side, or until lightly coloured. (The pancakes will stay a little moist in the middle because of the banana, so don’t worry.) Keep them warm in the oven while you cook the remaining pancakes.",
        "Serve the pancakes in a stack with the banana slices. Add some chopped pecans and a squeeze of lime, and, if you like, with a drizzle of maple syrup. Serve the compôte on the side."
    ],
    "tips": [
        "You can use butter and cow's milk if you’re not concerned about eating dairy products."
    ],
    "title": "Banana, blueberry and pecan pancakes",
    "videos": "[]"
}