{
    "title": "BBQ ‘beer-can’ chicken",
    "cookTime": "1 to 2 hours",
    "prepTime": "overnight",
    "serves": "Serves 4",
    "recommendations": "13",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/bbq_beer-can_chicken_80142_16x9.jpg"
    ],
    "description": "Try something different on your barbecue with this tasty recipe for super-moist chicken. Serve with a green salad and crusty bread.",
    "author": {
        "lisa_allen": "Lisa Allen"
    },
    "show": {
        "b0071y6r": "Great British Menu"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the chicken": [
            "4 tbsp light golden ale, plus 500ml/17floz to marinade the chicken, plus 300ml/10½fl oz light golden ale for roasting (reserve the empty beer can)",
            "90g/3oz malt extract",
            "½ tsp chilli powder",
            "½ tsp English mustard powder",
            "½ tsp crushed garlic",
            "½ tsp smoked paprika",
            "½ tsp muscovado sugar",
            "1 x 2kg/4lb 4oz chicken, preferably free-range",
            "160g/5½oz butter",
            "pinch salt"
        ]
    },
    "steps": [
        "For the chicken, mix four tablespoons of the ale, the malt extract, chilli powder, mustard, garlic, smoked paprika and sugar together in a bowl to make a paste.",
        "Rub the paste all over the chicken and set aside to marinate for three hours. Pour over 500ml/18fl oz of ale and leave to marinade overnight",
        "Preheat the barbecue (it is best to use a barbecue with a lid) or alternatively preheat the oven to 190C/375F/Gas 5.",
        "Rinse the marinade off the chicken and pat dry. Carefully smear the butter under the chicken skin and over the thighs and season with salt. Pour the 300ml/10½fl oz ale into the reserved beer can, then carefully place the chicken onto the beer can, so that the chicken is sitting upright, with the can in its cavity.",
        "Roast the chicken for 40-45 minutes, basting a couple of times. Remove the chicken from the barbecue or oven and set aside to rest for 15 minutes."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}