{
    "title": "Pork noodles with bean sauce",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "6",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/beansaucenoodles_76545_16x9.jpg"
    ],
    "description": "This pork mince stir-fry cooks in minutes and you can use either yellow bean or black bean sauce.",
    "author": {
        "ken_hom": "Ken Hom"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "You can save time by using straight to wok noodles."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "300g/10½oz dried or fresh egg noodles, cooked according to the packet instructions and drained",
            "1½ tbsp oil",
            "2 garlic cloves, finely chopped",
            "1 tbsp fresh root ginger, finely chopped",
            "3 tbsp spring onions, chopped, plus extra for garnish",
            "450g/1 lb minced pork",
            "3 tbsp yellow bean sauce or black bean sauce",
            "1½ tbsp Shaoxing rice wine or dry sherry (optional)",
            "2 tbsp soy sauce",
            "½ tsp freshly ground black pepper",
            "2 tsp chilli oil (optional)",
            "2 tsp sugar"
        ]
    },
    "steps": [
        "For the sauce, heat a wok or large frying-pan over high heat until hot. Add the oil. When it is very hot and slightly smoking, add the garlic, ginger and spring onions. Stir-fry for 15 seconds, then add the minced pork.",
        "Stir well to break up all the pieces and continue to stir-fry for about 2 minutes, or more, until the pork loses its pink colour. Add the remaining ingredients, except the noodles, stirring all the time. Bring the mixture to the boil, turn the heat down to low and simmer for 5 minutes, adding a little water if it looks too dry.",
        "Plunge the cooked noodles into a bowl of boiling water from the kettle for 30 seconds, or until they are just heated through. Drain them well in a colander or sieve.",
        "Tip the noodles into a large serving bowl and pour the hot sauce over the top.",
        "Sprinkle spring onions on top, mix everything together well and serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}