{
    "title": "Beef Madras",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "gordon_jones": "Gordon Jones"
    },
    "show": {
        "b00mb9r7": "Virgin Cooks"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the curry gravy": [
            "2 tbsp groundnut oil",
            "4 large onions, peeled and sliced",
            "4 cloves garlic, peeled, finely chopped",
            "1 red chilli, chopped",
            "1 bird's-eye chilli, chopped",
            "4 tomatoes, chopped",
            "2 green peppers, seeds removed, sliced",
            "1in/2.5cm piece fresh root ginger, peeled and chopped",
            "5 green cardamom pods",
            "1 cinnamon stick",
            "1 tsp Madras curry powder",
            "½ tsp nigella seeds (kalonji)",
            "1 tsp ground coriander seeds",
            "1 tsp ground cumin",
            "300ml/10½fl oz water",
            "pinch salt"
        ],
        "For the pilau rice": [
            "1 tsp ghee",
            "1 onion",
            "2 cloves garlic, peeled, finely chopped",
            "½ cinnamon stick",
            "3 green cardamom pods, lightly crushed",
            "250g/9oz basmati rice",
            "650ml/1 pint 3½fl oz vegetable stock"
        ],
        "For the beef Madras": [
            "2 x 250g/9oz sirloin steaks, fat trimmed, cut into thin strips",
            "1 tsp cayenne pepper",
            "1 tbsp Madras curry powder",
            "1 tsp ground cumin",
            "1 tsp nigella seeds (kalonji)",
            "1in/2.5cm piece fresh root ginger, peeled and grated",
            "2 garlic cloves, peeled and thinly sliced",
            "1 large green chilli, seeds removed, finely chopped",
            "1 tsp ghee",
            "1 aubergine, chopped into cubes",
            "8-10 okra, trimmed, sliced",
            "¼ tsp salt"
        ],
        "To serve": [
            "pinch garam masala",
            "1 large bunch fresh coriander, roughly chopped"
        ]
    },
    "steps": [
        "For the curry gravy, heat the groundnut oil in a wok or large pot and add the onions, garlic and chilli and fry for 1-2 minutes, or until softened. Add the tomatoes, green peppers, ginger, cardamom pods, cinnamon stick, nigella seeds, ground coriander seeds and ground cumin. Season with a pinch of salt and cover with the water. Bring to the boil, then reduce the heat and simmer for 4-5 minutes.",
        "Cover the wok or pot with a lid and simmer for 30-40 minutes over a low heat. Remove the cinnamon stick then, using a stick blender, blend the mixture until smooth. Set aside.",
        "For the pilau rice, heat the ghee in a pan and fry the onion and garlic for 4-5 minutes, or until softened and beginning to colour.",
        "Add the half cinnamon stick and the cardamom pods, then stir in the basmati rice and pour over the hot vegetable stock. Stir well, then cover the pan with a lid and simmer gently for 20-25 minutes, or until all of the stock has been absorbed and the rice is tender.",
        "For the beef Madras, mix together the spices, ginger, garlic and chillies in a large bowl. Add the beef slices and stir well to coat in the mixture.",
        "Heat the ghee in a pan and fry the beef for 2-3 minutes, then add the chopped aubergine, okra and tomato purée. Season, to taste, with a pinch of salt, then cook for a further 3-4 minutes, or until the beef is cooked through.",
        "Pour the curry gravy over the beef and cook for 1-2 minutes, to warm through.",
        "To serve, spoon the pilau rice onto serving plates and spoon the beef madras alongside. Sprinkle the garam masala over the beef and garnish with the fresh coriander leaves."
    ],
    "howTos": [
        "searing_meat"
    ],
    "videos": "[p00bf50c:p00bf50f]"
}