{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "Bring a bit of cheer to a cold, drab day by dishing up this simple, hearty stew with dumplings and buttered carrots.",
    "dishes": [
        "beef_stew",
        "casserole",
        "jam",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stew",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        "browning_meat"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Vichy carrots": [
            "4 medium carrots, peeled and left whole",
            "50g/1¾oz unsalted butter",
            "1 tbsp sugar"
        ],
        "For the beef stew": [
            "2 tbsp olive oil",
            "25g/1oz unsalted butter",
            "750g/1lb 10oz stewing steak, cut into 2-3cm/¾-1¼in pieces",
            "2 tbsp plain flour",
            "2 garlic cloves, chopped",
            "250g/9oz round shallots, peeled and left whole",
            "150ml/5½fl oz red wine",
            "500ml/18fl oz beef stock",
            "2 fresh bay leaves",
            "3 tbsp fresh thyme leaves",
            "Worcestershire sauce, to taste",
            "salt and black pepper"
        ],
        "For the dumplings": [
            "125g/4½oz plain flour",
            "1 tsp baking powder",
            "pinch salt",
            "60g/2¼oz suet"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4-6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the beef stew, heat the oil and butter in an ovenproof casserole and fry the beef until browned on all sides.",
        "Sprinkle over the flour and cook for a further 2-3 minutes. Add the garlic and shallots and fry for 1-2 minutes.",
        "Stir in the wine, stock and herbs, then add the Worcestershire sauce to taste. Season to taste with salt and freshly ground black pepper.",
        "Cover with a lid, transfer to the oven and cook for about two hours, or until the meat is tender.",
        "For the dumplings, sift the flour, baking powder and salt into a bowl. Add the suet and enough water to form a thick dough. With floured hands, roll spoonfuls of the dough into small balls.",
        "After two hours, remove the lid from the stew and place the dumpling balls on top of the stew. Cover, return to the oven and cook for a further 20 minutes, or until the dumplings have swollen and are tender. (If you prefer your dumplings with a golden top, leave the lid off when returning to the oven.)",
        "For the Vichy carrots, place the carrots, butter, sugar and four tablespoons of water into a pan and bring to a simmer.",
        "Cover with a lid or cartouche (a circle of greaseproof paper arranged so that it covers the top of the carrots) and cook gently for 4-5 minutes, or until the carrots are tender. Season with salt and black pepper.",
        "To serve, place a spoonful of the stew onto a plate and place one whole carrot and a dumpling next to it."
    ],
    "tips": [
        
    ],
    "title": "Beef stew and dumplings with Vichy carrots",
    "videos": "[]"
}