{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "jam",
        "stir-fries",
        "stock",
        "stroganoff"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the beef stroganoff": [
            "75g/3oz butter",
            "1 onion, finely sliced",
            "150g/5oz white mushrooms, finely sliced",
            "2 tbsp tomato purée",
            "1½ tsp Dijon mustard",
            "½ tsp smoked hot paprika",
            "110ml/4fl oz beef stock",
            "500g/1lb 2oz beef fillet, cut into strips",
            "salt and freshly ground black pepper",
            "150ml/5fl oz brandy",
            "200ml/7fl oz soured cream",
            "2 tbsp flatleaf parsley"
        ],
        "For the sautéed potatoes": [
            "3 tbsp olive oil",
            "3 large potatoes, peeled and cubed",
            "½ onion, finely chopped"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "82",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Heat a frying pan until hot, then add half the butter. When foaming, add the onion and fry for 2-3 minutes, or until just softened.",
        "Add the mushrooms and cook for 1-2 minutes.",
        "Add the tomato purée, mustard and paprika and cook for a further minute.",
        "Add the beef stock and bring to the boil, then reduce the heat and simmer for 3-4 minutes.",
        "Season the beef with salt and freshly ground black pepper.",
        "Heat a separate frying pan and add the remaining butter. When foaming, add the beef and fry for 2-3 minutes on both sides, until browned all over.",
        "Add the brandy and carefully allow to flambé in the pan. (CAUTION: make sure there are no flammable materials above the pan when flaming.)",
        "Add the soured cream to the onion and mushroom mixture and mix well.",
        "When the flames have subsided, add the beef to the soured cream and mushroom mixture and cook for one minute. Season, to taste, with salt and freshly ground black pepper and add the parsley.",
        "For the sautéed potatoes, heat the oil in a frying pan until hot, then add the potatoes and cook for 2-3 minutes on each side, or until tender and golden-brown all over. Season well with salt and freshly ground black pepper and add the onions. Stir gently to combine.",
        "To serve, place two spoonfuls of the sautéed potatoes onto each plate and spoon equal portions of the beef stroganoff alongside."
    ],
    "tips": [
        
    ],
    "title": "Beef stroganoff with sautéed potatoes",
    "videos": "[]"
}