{
    "title": "Beer and honey mustard-encrusted steaks with rosemary aubergines",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "over 2 hours",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the mustard": [
            "150g/5oz yellow mustard seeds",
            "75g/3oz brown mustard seeds",
            "110ml/4fl oz white wine vinegar",
            "60g/2½oz English set honey",
            "200ml/7fl oz light ale"
        ],
        "For the steaks": [
            "4 x 175g/6oz fillet steaks",
            "25g/1oz butter",
            "4 tbsp olive oil",
            "2 aubergines, cut into 2.5cm/1in chunks",
            "2 large banana shallots, roughly chopped",
            "3 sprigs rosemary"
        ]
    },
    "steps": [
        "For the mustard, place the mustard seeds into a bowl.",
        "Place the vinegar and honey into a non-reactive pan and heat until the honey has dissolved. Pour the vinegar and honey mixture over the mustard seeds and mix thoroughly.",
        "Add the ale and stir to combine. Cover with cling film and set aside for at least four hours, preferably overnight.",
        "Pour the mustard mixture into a food processor and blend until smooth. This will take time as all of the mustard seeds need to break down.",
        "Spoon into sterilised jars and seal.",
        "For the steaks, place the steaks between two pieces of cling film and bash lightly with a rolling pin to flatten the steaks slightly.",
        "Spread two tablespoons of the mustard over each steak.",
        "Heat a frying pan until hot, add the butter and two tablespoons of the olive oil. Once the butter has melted add the steaks and cook for 3-4 minutes on both sides, or until cooked to your liking. Remove from the pan and rest for at least five minutes.",
        "Meanwhile, heat a frying pan until hot and add the remaining olive oil. Add the aubergines, shallots and rosemary and fry for 5-6 minutes, stirring occasionally, until the aubergines are golden-brown and soft.",
        "To serve, place a steak onto each of four serving plates and top with a spoonful of the mustard. Place a couple of spoonfuls of the aubergine mixture alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}