{
    "title": "Beer-battered cod with triple-cooked chips, minted peas and tartare sauce",
    "cookTime": "over 2 hours",
    "prepTime": "over 2 hours",
    "serves": "Serves 4",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "",
    "author": {
        "richard_phillips": "Richard Phillips"
    },
    "show": {
        "b00dznhb": "Put Your Money Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the triple-cooked chips": [
            "1.2kg/2lb 10¼oz floury potatoes, such as Maris Piper or King Edward, cut into 1cm/½inch thick chips, soaked in a bowl of cold water for 10-15 minutes (change the soaking water regularly), drained",
            "1 litre/1 pint 15¼oz groundnut oil, for frying",
            "sea salt"
        ],
        "For the fish": [
            "4 x 180g/6¼oz cod fillets, skin removed",
            "sea salt flakes",
            "4 sprigs fresh thyme"
        ],
        "For the beer batter": [
            "250ml/8¾fl oz beer",
            "200g/7¼oz plain flour, plus extra for drudging the fish",
            "5g/¼oz fresh yeast",
            "1 free-range egg yolk",
            "pinch salt",
            "pinch sugar",
            "1 free-range egg white, whisked until soft peaks form when the whisk is removed"
        ],
        "For the tartare sauce": [
            "1 tbsp ready-made good quality mayonnaise",
            "1-2 free-range eggs, hard-boiled, finely chopped",
            "1 tbsp chopped fresh flatleaf parsley",
            "2-3 gherkins, finely chopped",
            "2 tsp capers, drained, rinsed, finely chopped",
            "freshly squeezed lemon juice, to taste",
            "salt and freshly ground black pepper"
        ],
        "For the minted peas": [
            "300g/10½oz fresh peas, out of their pods",
            "1 tbsp unsalted butter",
            "1 tbsp chopped fresh young mint leaves",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "For the triple-cooked chips, bring a large pan of water to the boil. When the water is boiling, add the drained potato chips. Return the water to the boil, then reduce the heat to a gentle simmer. Simmer the potato chips for 5-8 minutes, or until tender.",
        "Carefully remove the potatoes from the hot water, using a slotted spoon, and place them onto a baking tray. Set aside until completely cooled, then chill in the fridge for 30 minutes.",
        "Heat the groundnut oil in a deep fat fryer to 130C. Alternatively, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended). Carefully lower the chilled, parboiled chips into the hot oil (CAUTION: The temperature of the chips may cause the oil to spit - keep eyes and face clear and ensure the chips are completely dry).",
        "Fry the chips for 3-4 minutes, or until crisp but not coloured, then remove from the pan using a slotted spoon and set aside to drain on kitchen paper. When completely cool, chill in the fridge for a further 30 minutes.",
        "Meanwhile, for the fish, lay the cod fillets in the bottom of a roasting tray. Season the fillets with salt, then sprinkle over the fresh thyme leaves. Cover the roasting tray with cling film and set aside for 15 minutes.",
        "For the beer batter, in a bowl, whisk the beer, flour, yeast and egg yolk to a smooth paste. Stir in the sugar, salt then carefully fold in the egg white until well combined.",
        "For the tartare sauce, mix together all of the tartare sauce ingredients in a bowl until well combined (add the lemon juice a little at a time, tasting after each addition). Season, to taste, with salt and freshly ground black pepper.",
        "For the peas, boil the peas in a pan of salted water for 4-5 minutes, or until just tender. Drain well and refresh in iced water, then drain again.",
        "Melt the butter in the pan the peas were boiled in, add the cooked peas and mint leaves and season, to taste, with salt and freshly ground black pepper. Stir to coat the peas and mint in the melted butter. Keep warm.",
        "For the fish, reheat the groundnut oil to 160C. Sprinkle some flour onto a plate and dredge the cod fillets in it until completely covered, shaking off any excess.",
        "Dip one floured cod fillet into the beer batter mixture, then carefully lower it into the hot oil. Fry for 4-5 minutes, or until golden-brown, then remove from the pan using a slotted spoon and set aside to drain on a wire rack. Repeat the process with the remaining floured cod fillets.",
        "To finish the chips, increase the temperature of the oil to 180C. Carefully lower the partially-cooked chips into the hot oil and fry for 3-4 minutes, or until crisp and golden-brown. (CAUTION: The temperature of the chips may cause the oil to spit - keep eyes and face clear and ensure the chips are completely dry). Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Sprinkle over the salt.",
        "To serve, place one piece of beer-battered cod into the centre of each of four serving plates. Pile the triple-cooked chips alongside, along with a spoonful of the minted peas and tartare sauce."
    ],
    "howTos": [
        "folding"
    ],
    "videos": "[]"
}