{
    "title": "Beer-splashed jerk chicken with chargrilled sweetcorn and herby rice",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "Sweet with a powerful kick, this easy jerk chicken with rice is a perfect summer dish. Just add more cold beer.",
    "author": {
        "stephanie_moon": "Stephanie Moon"
    },
    "show": {
        "b01rycym": "Chefs: Put Your Menu Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the jerk chicken": [
            "5cm/2in fresh ginger, chopped",
            "2 garlic cloves, roughly chopped",
            "1 Scotch bonnet chilli, seeds removed and finely chopped",
            "2 tbsp jerk seasoning",
            "50-75ml/2-2½fl oz dark soy sauce",
            "1 tsp thyme leaves",
            "2-3 tbsp olive oil",
            "1 onion, roughly chopped",
            "4 skinless, boneless chicken pieces, cut into bite-sized pieces",
            "2 bell peppers of various colours, seeds removed and roughly chopped",
            "2 tbsp honey",
            "2 tbsp dark brown sugar",
            "1 x 330ml/11fl oz bottle of beer",
            "300ml/10fl oz chicken stock",
            "salt and freshly ground black pepper"
        ],
        "For the sweetcorn": [
            "2 ears sweetcorn on the cob, each cut into 4 pieces",
            "drizzle olive oil"
        ],
        "For the herby rice": [
            "300g/10½oz basmati rice",
            "6 cloves",
            "2 bay leaves",
            "handful chopped coriander and parsley"
        ]
    },
    "steps": [
        "For the jerk chicken, blend the ginger, garlic, chilli, jerk seasoning, dark soy sauce and thyme leaves in a food processor until smooth.",
        "Heat the olive oil in a large pan and fry the onions for 2-3 minutes or until softened. Add the chicken pieces and peppers and fry until browned.",
        "Add the jerk paste to the pan and cook for a further few minutes. Stir in the honey, sugar and pour in the beer. Deglaze by scraping the base of the pan to release any caramelised residue. Stir in the chicken stock, season with salt and black pepper and reduce the heat. Cook for 20-25 minutes, or until the sauce has thickened and the chicken is cooked through.",
        "Drizzle the sweetcorn pieces with a touch of olive oil and char-grill on a hot griddle pan for a few minutes on each side, until nicely charred. Season with salt and black pepper. Keep warm in the oven if necessary.",
        "For the herby rice, place the basmati rice in a sieve and wash with cold water until the water runs clear. Drain. Place the rice in a saucepan with the cloves and bay leaves. Cover with water until it is ½in/1cm above the rice and bring to the boil. Reduce the heat, cover with a lid and simmer gently for 12-15 minutes or until cooked. Once cooked, stir through the coriander and parsley.",
        "To serve, spoon the herby rice onto serving plates. Spoon the jerk chicken alongside and add the char-grilled sweetcorn pieces."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}