{
    "author": {
        
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "For a proper Sunday lunch that won't break the bank try this beef shin stew. Serve with some creamy mash for a mouthwatering meal. Try the Eat Well for Less quiz to find out how you could cut your food bills.",
    "dishes": [
        "beef_stew",
        "casserole",
        "oven-baked_dishes",
        "pie",
        "stew",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        "de-glazing_pans"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/beer_braised_shin_of_12682_16x9.jpg"
    ],
    "ingredients": {
        "For the mashed potato": [
            "1kg/2lb 4oz floury potatoes, such as King Edward or Maris Piper, cut into 4cm/1½in cubes",
            "150g/5½oz salted butter",
            "splash milk or cream, to taste"
        ],
        "default": [
            "6 tbsp rapeseed oil",
            "2 large onions, thinly sliced",
            "4 carrots, sliced",
            "3 celery sticks, sliced",
            "½ garlic bulb, bashed",
            "3 tbsp plain flour, for dusting",
            "2kg/4lb 8oz shin of beef, bone in (ask your butcher to cut it into 3cm/1¼in slices)",
            "568ml/1 pint ale",
            "300ml/½ pint beef stock",
            "3-4 sprigs rosemary",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 6",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 160C/140C Fan/Gas 3.",
        "Heat 2 tablespoons of the oil in a large heavy-bottomed frying pan over a medium heat. Add the onions, carrots, celery and garlic and fry until they start to colour. Transfer to a large lidded casserole dish.",
        "Put the flour on a plate and season with salt and pepper. Coat the beef in the seasoned flour and shake off any excess flour. Turn the heat up to high, then add the remaining oil to the frying pan. Fry the beef, in batches, for 1 minute on each side until browned all over. Add the beef to the casserole dish.",
        "Add a splash of ale to the frying pan and scrape off any cooked on pieces of food, then pour it all into the casserole dish. Pour in the remaining ale, the beef stock and rosemary. Put in the oven and cook for 3-4 hours, or until the meat falls easily from the bone.",
        "Meanwhile, bring a pot of lightly salted water to the boil and add the potatoes. Cook for 15-20 minutes until tender. Drain and return to the pot. Mash until smooth. Mix in the butter and milk. Season to taste with salt and pepper.",
        "Serve the braised shin with the mash."
    ],
    "tips": [
        
    ],
    "title": "Beer braised shin of beef with creamy mash",
    "videos": "[]"
}