{
    "title": "Bengali fish curry",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "18",
    "images": [
        
    ],
    "description": "This recipe is traditionally made with mustard oil but we’ve found that a combination of mustard seeds and English mustard powder brings just the right level of heat and flavour to this simple dish.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "tips": [
        "This is a light tasting curry but don’t reduce the amount of oil in the recipe as you need it to help thicken the sauce. Any fish fillets can be used or make it with fish steaks instead – as they often do in India - but you’ll need to increase the cooking time accordingly."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "2 sea bass or sea bream fillets (each around 200g/7oz), scales removed but skin on",
            "1 tsp flaked sea salt, plus extra to season",
            "¼ tsp cayenne pepper",
            "2½ tsp English mustard powder",
            "freshly ground black pepper",
            "4 tbsp sunflower oil",
            "1 heaped tsp yellow mustard seeds",
            "¾ tsp black mustard seeds",
            "¾ tsp cumin seeds",
            "1 medium onion, finely sliced",
            "2 long green chillies, stalk trimmed and cut in half without deseeding",
            "1 bay leaf",
            "½ tsp ground turmeric",
            "½ tsp garam masala",
            "150g/5½oz ripe tomatoes, roughly chopped",
            "150g/5½oz rice, cooked according to packet instructions"
        ]
    },
    "steps": [
        "Cut the fish fillets into roughly 7cm/3in wide strips. Put in a bowl and toss with the salt, cayenne pepper, half a teaspoon of the mustard powder and lots of freshly ground black pepper.",
        "Mix the remaining mustard powder with 300ml/10fl oz water, adding it gradually and stirring constantly until you have thin yellow liquid. Set aside.",
        "Heat the oil in a large non-stick frying pan and fry the fish over a high heat, skin-side down for a minute, or until the skin begins to crisp. Carefully turn over and cook on the other side for a further minute. Take the fish out of the pan and put on a plate. (Don’t let the fish get crowded in the pan or they will be difficult to turn. If your pan isn’t large enough, cook the fish in two batches instead. It’s nice to have the skin on the fish but you can easily remove it after frying if you prefer.)",
        "As soon as the fish is cooked, return the pan to the heat and add both the mustard seeds and cumin seeds. Cook for a few seconds, stirring constantly. Add the sliced onion, chillies and bay leaf. Cook for about five minutes, stirring constantly, until the onion is softened and pale golden-brown. Make sure you cook with the extractor on full-speed as the spices could make you sneeze! Sprinkle over the turmeric and garam masala, add the chopped tomatoes and cook for two minutes more, stirring constantly.",
        "Stir in the reserved mustard liquid and bring to a simmer. Cook for three minutes, or until the sauce has thickened and the volume of liquid has reduced by approximately one-third. The spices should have mellowed and the sauce should coat the back of a spoon. Return the fish to the pan and warm through in the bubbling sauce for two minutes until hot.",
        "Serve immediately with rice."
    ],
    "howTos": [
        
    ],
    "videos": "[p0174nlm:p0174nlw]"
}