{
    "author": {
        "john_burton_race": "John Burton Race"
    },
    "cookTime": "1 to 2 hours",
    "description": "",
    "dishes": [
        "bread",
        "gravy",
        "oven-baked_dishes",
        "pie",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the gravy": [
            "lamb bones and fat trimmings (reserved from rack of lamb, see below)",
            "2 tbsp unsalted butter",
            "1 tbsp olive oil",
            "1 onion, peeled, finely chopped",
            "1 garlic clove, peeled, finely chopped",
            "1 tbsp tomato purée",
            "4 ripe tomatoes, roughly chopped",
            "2 sprigs fresh thyme",
            "1 bay leaf",
            "400ml/14½fl oz good quality chicken stock"
        ],
        "For the lamb": [
            "large handful flatleaf parsley, roughly chopped",
            "2 garlic cloves, crushed to a paste with the edge of a knife",
            "1 fresh thyme sprig, leaves only, roughly chopped",
            "2 fresh rosemary sprigs, leaves only, roughly chopped",
            "handful fresh breadcrumbs",
            "2 tbsp olive oil",
            "3 tbsp Dijon mustard",
            "4 x best end (four-rib) racks of lamb, French-trimmed"
        ],
        "For the potatoes": [
            "4 medium floury potatoes, such as Maris Piper or King Edward, washed, peeled, cut in half",
            "2 garlic cloves",
            "1.2 litres/2 pints chicken stock",
            "150ml/5fl oz double cream",
            "400g/14oz fine green beans, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 8",
    "show": {
        "b00dznhb": "Put Your Money Where Your Mouth Is"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the gravy, roast the lamb trimmings in the oven for 15-20 minutes, or until golden-brown. Remove and set aside.",
        "Heat the butter and olive oil in a frying pan over a medium heat until foaming. Add the onion and the garlic and fry for 4-5 minutes, or until softened.",
        "Increase the heat, add the tomato purée and stir to combine. Continue to cook for a further 2-3 minutes, stirring frequently, then add the roasted bones and trimmings, chopped tomatoes, thyme, bay leaf and stock. Bring the mixture to a simmer and continue to simmer for 35-40 minutes. Strain the mixture through a sieve into a clean pan. Keep warm.",
        "Meanwhile, for the lamb, blend the parsley, garlic, thyme, rosemary, breadcrumbs and one tablespoon of the olive oil in a food processor s.",
        "Heat the remaining oil in a large frying pan over a medium to high heat. When the oil is hot, add the lamb racks and fry for 4-5 minutes, or until browned on all sides. Remove from the pan and set aside to cool.",
        "When the lamb racks have cooled, brush the fillet side of each rack with Dijon mustard. Press a large handful of the herb and breadcrumb mixture onto the mustard to coast.",
        "Transfer the lamb racks to the oven and roast for 15-20 minutes (for medium), or until cooked to your liking.",
        "Meanwhile, for the potatoes, add the potato halves and garlic cloves to the chicken stock. Boil for 12-15 minutes, or until the potatoes are tender. Drain well, reserving the chicken stock.",
        "Strain 300ml/10½fl oz of the reserved chicken stock through a sieve into a separate pan. Bring to the the boil and continue to boil for 5-7 minutes, or until the volume of liquid has reduced by half.",
        "Add the cream and continue to boil the mixture for a further 5-7 minutes, or until the volume of liquid has reduced by half again.",
        "Return the potatoes to the cream mixture and stir well to coat.",
        "Meanwhile, boil the beans in a pan of salted water for 4-5 minutes, or until just tender. Drain well.",
        "To serve, carve the racks of lamb into two-rib pieces. Place one two-rib rack of lamb into the centre of each of eight serving plates. Spoon the potatoes and green beans alongside. Drizzle over the gravy."
    ],
    "tips": [
        
    ],
    "title": "Best end of lamb with creamy potatoes",
    "videos": "[]"
}