{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "These fun desserts appeal to all ages - try serving with boozy whipped cream for a grown-up finish. Equipment and preparation: For this recipe, you will need 2 jelly moulds; one large (approximately 700ml/1 pint 4fl oz) and one small (approximately 600ml/1 pint). James Martin used rabbit-shaped moulds.",
    "dishes": [
        "icing",
        "jam",
        "jelly",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "5 gelatine leaves",
            "750g/1lb 10oz fresh raspberries",
            "100g/3½oz icing sugar",
            "1 heaped tbsp cornflour",
            "250ml/9fl oz full-fat milk",
            "1 tsp vanilla extract",
            "250ml/9fl oz double cream",
            "2-3 sprigs lemon verbena, leaves only, to decorate"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Soak the gelatine leaves in a bowl of cold water for a few minutes, until softened.",
        "Meanwhile, blend 600g/1lb 5oz of the raspberries and all but 2 tablespoons of the icing sugar to a purée in a food processor. Strain the mixture through a fine sieve into a bowl, discarding the seeds.",
        "In a bowl, whisk the cornflour and the remaining icing sugar with 75ml/3fl oz of the milk to form a smooth, thick paste. Stir in the remaining milk and vanilla extract until smooth and well combined, then pour the mixture into a saucepan and heat until just simmering.",
        "Simmer for a couple of minutes until the mixture has thickened slightly, then squeeze the soaked gelatine leaves dry and add them to the mixture, stirring constantly until dissolved.",
        "Remove the pan from the heat and whisk in the double cream and 150ml/5fl oz of the raspberry purée until well combined.",
        "Pour the blancmange mixture into the moulds and chill in the fridge for at least 4 hours.",
        "When ready to serve, remove the moulds from the fridge and quickly dip them into a bowl of hot water to loosen the blancmange. Invert the moulds onto serving plates. Serve with the remaining raspberry purée, garnished with the remaining whole fresh raspberries and the lemon verbena leaves."
    ],
    "tips": [
        "If desired, once the blancmanges have been turned out onto serving plates, light a blowtorch and torch the blancmanges very lightly all over until just shiny."
    ],
    "title": "Big kids’ raspberry blancmange",
    "videos": "[p03fkqws:p03fkqwx]"
}