{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "over 2 hours",
    "cusine": "East_European",
    "description": "This is the national dish of Poland. It can be made with any kind of meat from pork to rabbit or venison, but should always have spicy Polish sausage. Like most stews this tastes better left overnight and reheated the next day making it a great dish to prepare in advance for an evening with friends.",
    "dishes": [
        "casserole",
        "prepare-ahead_desserts",
        "sausage",
        "stew",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "50g/1¾oz butter",
            "1 onion, sliced",
            "1 tsp juniper berries, crushed",
            "½ tsp caraway seeds",
            "300g/10½oz lean pork belly, cubed",
            "1 tbsp brown sugar",
            "500g/1lb 2oz sauerkraut",
            "half a white cabbage, shredded",
            "200g/7oz fresh chopped tomatoes or 400g tin tomatoes",
            "500ml/18fl oz chicken or beef stock",
            "10g/¼oz dried mushrooms",
            "300g/10½oz smoked Polish sausage, such as kabanas, chopped",
            "1 apple, grated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 6",
    "show": {
        "b069hr3q": "The Hairy Bikers' Northern Exposure"
    },
    "steps": [
        "Melt the butter in a large casserole. Add the onion and sauté over a medium heat until the onion is softened and translucent. Sprinkle over the juniper berries and caraway, then add the pork. Sprinkle over the brown sugar. Turn the heat up high for a couple of minutes, turning the meat so it browns well.",
        "Drain the sauerkraut well and give it a rinse if you want to reduce the vinegar flavour. The easiest thing to do is squeeze it out with your hands. Add to the casserole with the white cabbage and chopped tomatoes, then pour over the stock. Simmer for about 30 minutes.",
        "Soak the dried mushrooms in warm water. When they have softened, drain, adding their soaking liquor to the casserole. Chop the mushrooms finely and add these to the casserole, along with the sausage and apple.",
        "Simmer for a further hour and a half and serve or cover overnight and reheat the following day."
    ],
    "tips": [
        "Many Polish recipes recommend making this stew two days in advance, cooking properly the first day, for a further hour the second day, and another hour before serving on the final day. But it will still taste really good on the first day too!"
    ],
    "title": "Bigos stew",
    "videos": "[p030zfct:p030zfd2]"
}