{
    "title": "Black olive polenta with field mushrooms",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "750ml/1 pint 7fl oz boiling water",
            "pinch salt",
            "200g/7oz fine quick-cook polenta",
            "100g/3½oz black olives, finely chopped",
            "salt and freshly ground black pepper",
            "1-2 tbsp olive oil",
            "150g/5½oz unsalted butter",
            "1 garlic clove, crushed to a paste with the edge of a knife",
            "450g/1lb assorted wild and field mushrooms, brushed clean, rinsed well, roughly chopped",
            "½ lemon, zest and juice",
            "1 tbsp chopped fresh thyme leaves",
            "parmesan shavings, to serve"
        ]
    },
    "steps": [
        "Bring the water to the boil and add a pinch of salt. Pour in the polenta, stirring well. Reduce the heat until the water is just bubbling and continue to cook, stirring well, for 4-5 minutes, or until the polenta has absorbed all of the water and is smooth and thick.",
        "Stir in the chopped olives and season, to taste, with salt and freshly ground black pepper.",
        "Line a baking tray with a sheet of baking paper and spread the polenta mixture onto it in an even layer. Set aside until the polenta has set and is completely cool.",
        "When the polenta has cooled and set, cut it into 10cm/4in squares. Brush each square on both sides with a little of the olive oil.",
        "Heat a griddle pan over a medium heat. When the pan is hot, add the polenta squares, in batches if necessary, and cook for 2-3 minutes on each side, or until golden-brown griddle marks have appeared on both sides and the polenta is warmed through. Remove the griddled polenta squares from the pan and keep warm. Repeat the process with the remaining polenta squares.",
        "Meanwhile, heat the remaining oil and the butter in a frying pan over a medium heat. Add the garlic and mixed mushrooms and fry for 3-4 minutes, or until browned.",
        "Add the lemon juice, lemon zest and thyme and stir well to combine.",
        "To serve, place one square of griddled polenta into the centre of each of six serving plates. Spoon the field mushrooms and pan juices over the polenta square. Garnish each serving with a few parmesan shavings."
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}