{
    "title": "Apple and blackberry charlotte",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "James Martin’s wicked dessert is the perfect way to use up a glut of blackberries.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "To make this extra special, serve with a scoop of vanilla ice cream too."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "3 Bramley apples, peeled, 2 cut into chunks and 1 sliced for garnish",
            "400g/14oz blackberries, 100g/3½ reserved for garnish",
            "110g/4oz caster sugar",
            "10 slices white bread, crusts removed",
            "100g/3½oz butter, melted, plus extra for greasing"
        ],
        "For the custard": [
            "200ml/7fl oz double cream",
            "200ml/7fl oz full-fat milk",
            "1 vanilla pod, seeds removed",
            "4 free-range egg yolks",
            "75g/2½oz caster sugar"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7. Grease four individual dariole moulds with butter.",
        "Heat the apples, 300g/10½oz blackberries and sugar with 2-3 tablespoons water in a saucepan for 2-3 minutes, or until the apples are softened and the blackberries have broken down. Remove the pan from the heat.",
        "Cut out four circles of bread to line the base of the dariole moulds and four larger circles for the tops. Cut the remaining bread into strips.",
        "Dip each piece of bread into the melted butter and use them to line the bottom and sides of the dariole moulds. Spoon the apples and blackberries into the moulds and top with the larger circles of bread.",
        "Bake the charlottes in the oven for 25 minutes or until golden-brown on top.",
        "Meanwhile for the custard, bring the cream, milk and vanilla pod to a simmer for five minutes over a very low heat. Remove the pan from the heat and remove the vanilla pod.",
        "Whisk the egg yolks and sugar together in a bowl until well blended. Slowly whisk in the hot milk and cream. Return the mixture to the pan and cook over a gentle heat, stirring continuously, until the custard thickens enough to coat the back of a spoon. Strain through a fine sieve into a bowl.",
        "For the garnish, heat a medium frying pan and add any remaining melted butter, the reserved sliced apples and blackberries and gently fry for two minutes.",
        "To serve, carefully turn the apple and blackberry charlottes. Spoon a little custard onto each of four serving plates, place the charlottes on top and spoon the garnish alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}