{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "10 to 30 mins",
    "description": "Foraging has fruitful rewards, particularly for a blackberry fool recipe. Equipment and preparation: You’ll need six tumblers.",
    "dishes": [
        "fruit_fool",
        "icing",
        "jelly",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the fool": [
            "500g/1lb 2oz blackberries",
            "1 lemon, juice and zest",
            "150g/5oz caster sugar",
            "500ml/17fl oz double cream",
            "25g/1oz icing sugar",
            "1 vanilla pod, split lengthways, seeds scraped out"
        ],
        "For the jelly": [
            "500g/1lb 2oz blackberries, plus extra for garnish",
            "½ lemon, juice only",
            "100g/3½oz caster sugar",
            "1 tbsp balsamic vinegar",
            "80ml/2½fl oz water",
            "3 sheets gelatine, soaked in water"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Makes 6",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "Place all the ingredients apart from the gelatine into a saucepan and bring to the boil. Simmer for six minutes.",
        "Remove the fruit mixture from the heat and strain through a sieve into a bowl.",
        "Squeeze the excess water from the gelatine and stir it into the fruit mixture. Leave the jelly to cool slightly, stirring regularly.",
        "Place two blackberries in the bottom of each of six tumblers and divide the jelly mixture between them, leaving some space at the top of each tumbler. Chill in the fridge for at least two hours.",
        "For the fool, place the berries, lemon and sugar into a saucepan. Cover and cook for 6-8 minutes, then remove from the heat and set aside to cool.",
        "Whisk together the cream with the icing sugar and vanilla until soft peaks form when the whisk is removed. Fold the cream into the fruit mixture and spoon on top of the set jelly. Garnish with more fruit and serve."
    ],
    "tips": [
        
    ],
    "title": "Blackberry jelly fool",
    "videos": "[]"
}