{
    "author": {
        "francesco_mazzei": "Francesco Mazzei"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Black cod has more fat than most fish so won't dry out when grilled slowly as it is here.",
    "dishes": [
        "jam",
        "prepare-ahead_desserts"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the black cod": [
            "150ml/5fl oz liquorice liqueur",
            "2 tbsp honey",
            "100ml/3½fl oz prosecco",
            "½ lemon, peel only (reserve the juice for dressing the lettuce)",
            "5g chocolate mint leaves, chopped",
            "1 chilli, seeds removed, cut in half lengthways",
            "15g tarragon",
            "4 x 140g/5oz Alaskan black cod fillets",
            "salt and freshly ground black pepper"
        ],
        "For the red onion jam": [
            "500g/1lb 2oz red onion, chopped (about 6 onions)",
            "125g/4½oz caster sugar",
            "20g/¾oz cooked beetroot, chopped",
            "50ml/2fl oz red wine vinegar"
        ],
        "To serve": [
            "2 Little Gem lettuce, cut into quarters",
            "2 tbsp extra virgin olive oil",
            "handful pea shoots"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the black cod, prepare the marinade the day before you want to eat. Add the liquorice liqueur, honey, prosecco, lemon peel, chocolate mint leaves, chilli and tarragon to large bowl and mix to combine. Add the cod fillets and marinate in the fridge overnight. The next day, remove the cod and discard the marinade. Season the fish with salt and pepper. Set aside until ready to cook.",
        "For the red onion jam, put the onions, caster sugar, beetroot and vinegar in a pan and simmer over a low heat for approximately 45 minutes. Once the mixture resembles a thin jam, use a spatula to pass it through a strong sieve to remove lumps. Set aside to cool.",
        "To cook the fish, preheat the grill to a low-medium heat. Grill the cod for 15-20 minutes, or until nicely glazed and firm",
        "To serve, char the lettuce using a chef’s blow torch then dress with olive oil and the reserved lemon juice.",
        "Spoon some onion jam onto each plate and top with the cod. Put the lettuce alongside and dress the plate with pea shoots. Serve immediately."
    ],
    "tips": [
        
    ],
    "title": "Black cod with red onion jam and charred lettuce",
    "videos": "[]"
}