{
    "title": "Blackberry fool with mace biscuits",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "overnight",
    "serves": "Serves 6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Summer favourite blackberry fool gets a chef makeover. Equipment: You’ll need a cream whipper/espuma gun.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the blackberry fool": [
            "50g/1¾oz butter",
            "50g/1¾oz caster sugar",
            "500g/1lb 2oz blackberries, plus 50g/1¾oz extra for garnish",
            "½ lemon, juice only"
        ],
        "For the custard": [
            "300ml/10½fl oz double cream",
            "300ml/10½fl oz milk",
            "6 egg yolks",
            "50g/1¾oz caster sugar"
        ],
        "For the mace biscuits": [
            "175g/6oz self-raising flour",
            "110g/4oz light muscovado sugar",
            "1 tsp ground mace",
            "1 tsp bicarbonate of soda",
            "60g/2¼oz butter, diced",
            "1 egg, lightly beaten",
            "1 tbsp golden syrup"
        ],
        "To serve": [
            "1 ball vanilla ice cream per person",
            "1 tsp ground mace"
        ]
    },
    "steps": [
        "For the blackberry fool, melt the butter in a saucepan and add the sugar. Pour the blackberries on top and add the lemon juice. Cook on a low heat until it becomes a purée. Blend until smooth, then pass through a fine sieve into a bowl and cover with cling film. Set aside until needed.",
        "For the custard, bring the cream and milk to the boil in a large saucepan. In a heatproof bowl, whisk together the egg yolks and caster sugar. Pour the cream and milk onto the eggs, whisking continuously. Place the pan back on the heat and gently cook until the custard coats the back of a spoon or reaches 82C/180F on a cooking thermometer. Pass through a fine sieve into a bowl, cover with cling film and chill in the fridge.",
        "Mix 400g/14oz blackberry purée with the custard. Pass through a fine sieve and pour into an espuma gun. Charge with two chargers and give it a good shake. Leave to settle for 10-15 minutes.",
        "For the mace biscuits, place all the dry ingredients in a large mixing bowl and add the butter, rubbing it together until the mixture resembles coarse crumbs. Add the egg and syrup and bring together to form a stiff paste. Wrap in cling film and chill in the fridge for at least one hour.",
        "When you are ready to cook reheat the oven to 180C/350F/Gas mark 4. Line two baking sheets with baking parchment.",
        "Roll the mixture into 16-20 walnut-sized balls and place them 5cm/2in apart on the baking sheets so they have room to spread out. Bake for 12-15 minutes, until just cooked. Remove from the oven, leave on the sheets to firm up for a couple of minutes, then place on a wire rack to cool completely.",
        "To serve, mix some blackberries with some purée and place in the bottom of six serving glasses. Crumble on some mace biscuits. Add a ball of vanilla ice cream to each glass. Add more blackberries and purée, then some more crumbled biscuit. Spray on the fool. Dust with mace and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}