{
    "title": "Blinis with smoked salmon pâté, mackerel and a beetroot and shallot pickle",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Rich smoked salmon is perfectly balance with earthy beetroot and sharp pickles in this dish that is sure to impress.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the blinis": [
            "200g/7oz plain flour",
            "7g instant yeast (one sachet)",
            "250ml/9 fl oz milk",
            "1 tsp salt",
            "1 tsp sugar",
            "2 free-range egg whites",
            "50g/1¾ oz butter"
        ],
        "For the smoked salmon pâté": [
            "175g/6 oz smoked salmon, roughly chopped",
            "75ml/2½ fl oz double cream",
            "50g/1¾ oz crème fraiche",
            "1 lemon, juice only",
            "salt and freshly ground black pepper"
        ],
        "For the beetroot and shallot pickle": [
            "½ bunch baby heritage beetroots, cleaned, small stalk left on",
            "75g/2¾oz unsalted butter",
            "200 ml white wine vinegar",
            "75g/2¾oz caster sugar",
            "1 tsp salt",
            "½ tsp black peppercorns",
            "2 banana shallots, thinly sliced"
        ],
        "To serve": [
            "4 mackerel fillets, filleted, pin boned, skin on",
            "250g/9oz crème fraîche",
            "2 tbsp chopped fresh chives/chervil",
            "4 tsp caviar (optional)"
        ]
    },
    "steps": [
        "For the blinis, whisk together the flour, yeast, milk, salt and sugar. Set aside in a warm place to prove for an hour.",
        "Whisk the egg whites in a separate bowl until stiff peaks form when the whisk is removed. When the batter has proved fold in the egg whites.",
        "To cook the blinis, melt the butter in a large frying pan. Add a tablespoon of batter to the pan per blini and cook until golden-brown on the underside. Flip over and cook the other side. Remove the blini and place onto kitchen paper. Repeat until you have used all the batter. Keep the blinis warm until ready to serve.",
        "For the smoked salmon pâté, blend the smoked salmon, double cream and crème fraiche in a food processor to a fine purée.",
        "Season with salt, pepper and lemon juice then place in a bowl in the fridge until ready to serve.",
        "For the beetroot and shallot pickle, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut in half. Melt the butter in a medium frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown.",
        "For the pickled shallots, heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar has dissolved. Put the shallots in a bowl and pour over the hot vinegar mixture. Mix together, coating the shallots. Set aside to pickle for at least an hour, but preferably 24 hours.",
        "To serve, put the mackerel skin-side up on a heavy baking tray and use a chef's blow torch to char the skin. Season with salt and pepper.",
        "Place the blinis on the plate alongside the mackerel. Place the smoked salmon pâté on top of the blinis and the pickled beetroot and shallots on the side. Garnish with fresh chives/chervil, crème fraiche and caviar (if using)."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}