{
    "title": "Blinis with horseradish cream and roasted peppers",
    "cookTime": "less than 10 mins",
    "prepTime": "1-2 hours",
    "serves": "Serves 6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the blinis": [
            "225g/4oz buckwheat/wholewheat flour",
            "225g/4oz plain flour",
            "pinch salt",
            "2 free-range eggs, plus 2 free-range egg whites",
            "45g/1½oz fresh yeast",
            "2 tsp caster sugar",
            "700ml/1 pint 5fl oz warm milk",
            "1 tbsp melted butter",
            "vegetable oil, for frying"
        ],
        "For the topping": [
            "4 red peppers, roasted, peeled, seeds removed",
            "225g/4oz soured cream",
            "1 tbsp creamed horseradish from a jar",
            "1 tbsp chopped fresh tarragon",
            "½ lemon, juice only",
            "12 black olives",
            "freshly ground black pepper"
        ]
    },
    "steps": [
        "For the blinis, sift the buckwheat (or wholewheat) flour and plain flour into a bowl and mix with a pinch of salt.",
        "Make a well in the centre of the flour mixture and add the two whole eggs and one of the egg whites. Whisk from the centre outwards to create a thick paste.",
        "In a separate bowl, combine the yeast, sugar and milk and leave to stand for a couple of minutes.",
        "Gradually pour the yeast mixture into the flour and egg mixture, whisking constantly, to make a smooth batter.",
        "Add the melted butter and stir well.",
        "Cover the bowl with clingfilm and leave in a warm place for one hour.",
        "Just before cooking the blinis, whisk the remaining egg white in a clean bowl until light, then fold into the batter.",
        "Heat a little oil in a frying pan over a medium heat. Pour enough batter into the pan to make a 10cm/4in diameter blini.",
        "When bubbles start to appear on the surface of the batter, turn the blini over and cook the other side.",
        "Remove the blini from the pan and keep warm while you make the rest of the blinis in the same way.",
        "For the topping, slice the roasted red peppers into strips.",
        "Spoon the soured cream, horseradish, tarragon and lemon into a bowl and mix well.",
        "Spoon one tablespoon of the cream mixture onto each blini and top with some of the red pepper pieces.",
        "Top each blini with an olive and season with freshly ground black pepper."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}