{
    "title": "Blow-torched mackerel with blini, warm pickled beetroot and chive crème fraîche",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "Cooking the mackerel with a blow-torch gives a lovely charred flavour without overcooking the flesh.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the blini": [
            "10g/¼oz yeast",
            "10g/¼oz sugar",
            "300ml/10fl oz warm milk",
            "150g/5½oz flour",
            "75g/2¾oz buckwheat flour",
            "1 free-range egg, separated, plus 2 extra egg whites",
            "vegetable oil, for frying"
        ],
        "For the beetroot pickle": [
            "250g/9oz redcurrant jelly",
            "250ml/9floz red wine vinegar",
            "4 cloves",
            "75g/2¾oz Dijon mustard",
            "2 large cooked beetroot, peeled and diced"
        ],
        "For the chive crème fraîche": [
            "200g/7oz crème fraîche",
            "1 bunch chives, finely chopped"
        ],
        "For the mackerel": [
            "4 mackerel, filleted and pin boned",
            "rapeseed oil, for drizzling",
            "4 shallots, finely chopped",
            "1 tin Avruga caviar"
        ]
    },
    "steps": [
        "To make the blini, mix the yeast, sugar, milk, flours and egg yolk together in a bowl to make a paste.",
        "Whisk the egg whites in a separate bowl until they form stiff peaks, then fold them into the yeast mixture. Cover the bowl and set aside at room temperature for 20 minutes.",
        "Heat a frying pan until medium hot, add a little vegetable oil and small spoonfuls of the blini mixture.",
        "Cook the blini on each side until golden-brown then remove and drain onto kitchen paper. Repeat with the remaining batter and keep the blini warm until ready to serve.",
        "For the beetroot, place the redcurrant jelly, vinegar and cloves into a saucepan and cook until reduced down to a glaze thick enough to coat the back of a spoon.",
        "Pass the mixture through a sieve into a clean bowl, whisk in the mustard then fold the beetroot into the pickle mix and keep warm.",
        "Whisk the crème fraîche until thickened, add the chives and season with salt and freshly ground black pepper.",
        "Cut the mackerel fillets in half lengthways. Drizzle with rapeseed oil, gently blow torch on both sides until cooked through then season with salt and freshly ground black pepper.",
        "To serve, place the mackerel onto the serving plates with a little of the chopped shallots, the warm beetroot pickle, blini, crème fraîche and some Avruga caviar."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}