{
    "author": {
        "joanne_wheatley": "Joanne Wheatley"
    },
    "cookTime": "over 2 hours",
    "description": "",
    "dishes": [
        "biscuit",
        "icing",
        "jam",
        "jelly",
        "macaroon",
        "oven-baked_dishes",
        "sandwich",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the blueberry jelly filling": [
            "750g/1lb 10oz blueberries",
            "400g/14oz jam sugar"
        ],
        "For the blueberry macaroons": [
            "250g/9oz icing sugar",
            "210g/7½oz ground almonds",
            "40g/1½oz dried blueberries",
            "175g/6oz free-range egg whites (equivalent to about 5 egg whites)",
            "225g/8oz caster sugar",
            "4 tbsp water",
            "navy blue food colouring"
        ],
        "For the coconut cream filling": [
            "284ml/10fl oz double cream",
            "2 tbsp icing sugar, sifted",
            "1 x 50g/1¾oz sachet creamed coconut"
        ],
        "For the coconut macaroons": [
            "250g/9oz icing sugar",
            "210g/7½oz ground almonds",
            "40g/1½oz desiccated coconut",
            "175g/6oz free-range egg whites (equivalent to about 5 egg whites)",
            "4 tbsp water",
            "225g/8oz caster sugar"
        ],
        "For the strawberry buttercream filling": [
            "6 large ripe strawberries",
            "125g/4½oz unsalted butter",
            "250g/1lb 2oz icing sugar"
        ],
        "For the strawberry macaroons": [
            "250g/9oz icing sugar",
            "250g/9oz ground almonds",
            "175g/6oz free-range egg whites (equivalent to about 5 egg whites)",
            "4 tbsp water",
            "225g/8oz caster sugar",
            "red food colouring paste",
            "strawberry essence"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Makes 60 macaroons",
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "steps": [
        "To make the blueberry jelly filling, place the blueberries and sugar in a small pan, heat over a gentle heat until the sugar has dissolved then boil over a high heat for 7 – 10 minutes. Pour the jelly through a fine sieve into a large shallow dish and set aside to cool completely.",
        "Preheat the oven to 170C/325F/Gas 3. Line 4 large baking trays with greaseproof paper.",
        "For the blueberry macaroons, place the icing sugar, ground almonds and blueberries into a food processor and pulse until you have a fine dust. Sieve the mixture into a bowl, discarding anything left in the sieve, then return the mixture to the food processor. Weigh out 85g/3oz of the egg whites, add them to the food processor and blend to make a paste.",
        "Place the sugar and water in a heavy-based saucepan and heat until the sugar has dissolved and the mixture is syrupy.",
        "Whisk the remaining egg whites in a food mixer or with an electric whisk until they form soft peaks then add the colouring and gradually mix in the syrup. Continue whisking until the mixture is shiny and stiff then transfer it to a clean mixing bowl.",
        "Fold the almond mixture into the whisked egg whites with a large metal spoon then spoon the mixture into a piping bag fitted with a 1cm/½in nozzle and pipe circles about 4cm/1½in diameter onto the baking trays. Give the baking trays a couple of slams on the work surface to flatten the macaroons then bake with the oven door slightly ajar for 12 - 15 minutes or until just firm. Leave to cool on wire racks before filling.",
        "Make the coconut and strawberry macaroons by repeating steps 3 – 6, substituting the dried blueberries with the desiccated coconut for the coconut macaroons, and adding a little strawberry essence and red colouring for the strawberry macaroons.",
        "For the coconut filling, whip the double cream with the icing sugar until stiff peaks form, then fold in the coconut cream and spoon into a piping bag. Sandwich the coconut macaroons together with a little piped filling.",
        "For the strawberry filling, chop the strawberries and press them through a fine sieve to make a purée. Beat the butter until soft and fluffy then whisk in the icing sugar and strawberry purée and spoon into a piping bag. Sandwich the macaroons together with a little piped filling.",
        "To assemble the blueberry macaroons, cut circles of the jelly with a small biscuit cutter slightly smaller than the macaroons. Sandwich the macaroons together with the circles of jelly."
    ],
    "tips": [
        "The filled macaroons benefit from 'resting' in the fridge for at least 24 hours; they will keep for 2-3 days in the fridge."
    ],
    "title": "Blueberry macaroons, coconut macaroons and strawberry macaroons",
    "videos": "[]"
}