{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "10 to 30 mins",
    "description": "This dessert dish of rich buttermilk panna cotta studded with jewels of blueberries and a blueberry sauce is a great make-ahead pud.",
    "dishes": [
        "panna_cotta",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/blueberry_and_buttermilk_71250_16x9.jpg"
    ],
    "ingredients": {
        "For the blueberry sauce": [
            "100g/3½oz caster sugar",
            "1 star anise",
            "100g/3½oz blueberries"
        ],
        "For the panna cotta": [
            "300ml/10fl oz double cream",
            "70g/2½oz caster sugar",
            "1 tsp vanilla extract",
            "2½ sheets gelatine, soaked in a bowl of cold water (or use a vegetarian alternative)",
            "300ml/10fl oz buttermilk",
            "90g/3¼oz blueberries"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "9",
    "serves": "Makes 5",
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "steps": [
        "Warm the cream, sugar and vanilla in a pan until the sugar has dissolved and the cream just comes to the boil.",
        "Remove the pan from the heat. Squeeze the gelatine to remove any excess water. Add it to the pan and stir until dissolved. Add the buttermilk and mix well.",
        "Divide the blueberries between five ramekins. Pour over the cream mixture to fill the moulds.",
        "Place in the fridge to set - this will take at least four hours, or leave overnight.",
        "For the blueberry sauce, put the sugar, 50ml/2fl oz of water and star anise into a pan. Bring to the boil so that the sugar dissolves and the syrup thickens slightly but doesn’t change colour.",
        "Remove from the heat and add the blueberries. Leave to cool and the syrup will turn a deep red colour and the blueberries will soften.",
        "To serve, run a knife around the panna cotta to loosen it. Tip out onto serving plates and pour over a little of the blueberry sauce."
    ],
    "tips": [
        
    ],
    "title": "Blueberry and buttermilk panna cotta",
    "videos": "[]"
}