{
    "title": "Boreks",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "These pastry parcels are a fab canapé idea, and also work well in lunchboxes or for picnics and parties.",
    "author": {
        "kate_morris_and_sally_brown": "Kate Morris and Sally Brown"
    },
    "show": {
        "b00w1ddl": "I Can Cook"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "100g/3½oz feta, crumbled",
            "freshly ground black pepper",
            "1 heaped tsp raisins or sultanas",
            "20g/¾oz fresh flatleaf parsley, leaves only, chopped",
            "plain flour, for dusting",
            "4 sheets filo pastry",
            "50g/2oz butter, melted",
            "mixed salad, to serve (optional)"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "In a bowl, season the feta, to taste, with the black pepper. Stir in the raisins or sultanas and the parsley. Set aside.",
        "Lightly dust a work surface with flour. Lay out one sheet of filo pastry and brush with a little melted butter. Fold the pastry sheet in half lengthways.",
        "Place two or three heaped teaspoons of the filling mixture in the bottom left-hand corner of the pastry rectangle. Fold the filled corner of the pastry up towards the top of the rectangle to form a triangle, brushing the folded pastry with melted butter as you go.",
        "Fold the top left-hand corner of the pastry across and over, to wrap the triangular parcel with more of the pastry. Keep folding the pastry parcel over itself, brushing with melted butter each time, until the parcel resembles a samosa.",
        "Repeat the process with the remaining three sheets of filo and the remaining filling mixture.",
        "Place all four boreks onto a baking tray, with the last flap of pastry at the bottom. Bake in the oven for 18-20 minutes, or until the pastry is crisp and golden-brown. Serve with a mixed salad."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}