{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "cake",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "poaching_eggs"
    ],
    "images": [
        
    ],
    "ingredients": {
        "To serve": [
            "2 poached eggs",
            "4 rashers bacon, fried until crisp"
        ],
        "default": [
            "2 large baking potatoes",
            "salt and freshly ground black pepper",
            "½ onion, peeled, very finely sliced",
            "1 tbsp vegetable oil",
            "40g/1½ oz butter",
            "8 slices ready-made black pudding, fried until crisp"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 2",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "Boil the potatoes, in their jackets, in a large pan of water for exactly seven minutes, then remove from the pan and set aside to cool slightly.",
        "When the potatoes are cool enough to handle, peel and coarsely grate the potatoes into a bowl. Season, to taste, with salt and freshly ground black pepper, then stir in the onion.",
        "Heat the oil and butter in a 20-25cm/8-10in frying pan over a medium heat.",
        "When the butter is foaming, add half of the potato mixture to the pan and press down using a wooden spoon to form an even layer. Arrange the black pudding slices on top of the potato layer, then spoon the remaining potato mixture on top of the black pudding and press down again. Fry for 5-6 minutes, or until the bottom layer of grated potato is crisp, golden-brown and cooked through.",
        "Carefully turn the potato cake over and fry for a further 5-6 minutes, or until all of the grated potato is crisp, golden-brown and cooked through.",
        "Slice the potato rösti in two and serve each portion with a poached egg and two rashers of bacon."
    ],
    "tips": [
        
    ],
    "title": "Breakfast rosti",
    "videos": "[]"
}