{
    "title": "Brioches à tête",
    "cookTime": "10 to 30 mins",
    "prepTime": "overnight",
    "serves": "Makes 16 brioche têtes",
    "recommendations": "8",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/brioches__ttes_39328_16x9.jpg"
    ],
    "description": "Brioche à tête (or parisienne) is a brioche baked into a fluted round tin with a ball of dough placed on top to form the ‘head’, the tête. Great for brunch with a strong coffee. Equipment and preparation: You will need 16 brioche moulds.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2oz strong white flour",
            "50g/1¾oz caster sugar",
            "10g/⅓oz fast-acting yeast",
            "7g/¼oz salt",
            "140ml/5fl oz full-fat milk",
            "6 free-range eggs, one egg beaten for egg wash",
            "250g/9oz unsalted butter, softened"
        ]
    },
    "steps": [
        "Put the flour, sugar, yeast, salt, milk and five eggs into a free-standing food mixer and mix, for about five minutes, to a smooth dough. If mixing by hand, this will take about eight minutes.",
        "Add the butter to the dough and mix for a further five minutes in the mixer, or 10 minutes by hand. Put the dough into a bowl, cover and leave in the fridge overnight.",
        "The dough should now be stiff and easily shaped. Cut the dough into 50g/1¾oz pieces and divide 45g/1½oz for the brioche bodies and 5g/¼oz for the brioche heads.",
        "Using your hands, shape the dough pieces into balls. Put each large piece of dough into a brioche mould and push a smaller dough on top of each once. Leave the brioche in a warm place to rise for one hour.",
        "Preheat the oven to 200C/400F/Gas 6. Brush the brioche with the egg wash and bake for 20 minutes, or until golden-brown.",
        "Transfer to a wire rack to cool."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}