{
    "title": "Broad bean hummus",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This is a summery take on a classic hummus recipe. If you can’t get broad beans, frozen work well too.",
    "author": {
        "gary_rhodes": "Gary Rhodes"
    },
    "show": {
        "b016pbs9": "Great British Food Revival"
    },
    "tips": [
        "For many months of the year fresh broad beans are out of season, but fresh beans can be substituted using frozen broad beans."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "450g/1lb fresh broad beans, podded weight",
            "100g/3½oz tinned chickpeas, drained reserving 6 tbsp of the liquid from the can",
            "1 garlic clove, crushed",
            "2 heaped tbsp tahini",
            "1 tbsp lemon juice",
            "½ tsp salt",
            "pinch ground cumin",
            "pinch ground white pepper",
            "pinch caster sugar (optional)",
            "4 tbsp extra virgin olive oil, plus extra for drizzling"
        ],
        "To serve": [
            "1 tsp sesame seeds, toasted",
            "melba toasts"
        ]
    },
    "steps": [
        "Cook the podded broad beans in a pan of boiling, salted water for a minute or two, or until tender. Drain and cool in iced water.",
        "Once cold, the beans are ready to drain and re-pod (double podding stage): remove the skin from the bright green beans.",
        "Place the broad beans (saving a few for garnish), chickpeas, crushed garlic, tahini paste, lemon juice, salt, cumin, white pepper and caster sugar, if using, in a food processor and blend until smooth, loosening with the reserved chickpea liquor.",
        "As the mix continues to purée, slowly pour in the olive oil until completely combined.",
        "Serve the homemade broad bean hummus spooned or piped into a bowl, topped with the saved broad beans, toasted sesame seeds and a little drizzle of olive oil with the melba toast."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}