{
    "title": "Bruno Loubet’s bean and vegetable chilli",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6-8",
    "recommendations": "11",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/bruno_loubets_bean_and_68770_16x9.jpg"
    ],
    "description": "The list of ingredients here may look long and daunting but I promise you, the recipe is very simple – a one-pot wonder. This recipe was kindly given to me by a great chef – Bruno Loubet – who worked with me for many years. Risking Bruno’s wrath, I made a few changes to the recipe. I hope he will forgive my boldness and see the wisdom of an older man. This meal, when served as eight portions, provides 359kcal, 9g protein, 46g carbohydrate (of which 15g sugars), 13g fat (of which 2g saturates), 8g fibre and 1.8g salt per portion.",
    "author": {
        "raymond_blanc": "Raymond Blanc"
    },
    "show": {
        "b05n91p4": "Kew on a Plate"
    },
    "tips": [
        "Brown basmati rice will have more fibre and flavour than white."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the toasted spices": [
            "1½ tsp ground coriander",
            "1½ tsp ground cumin",
            "2 tsp sweet smoked paprika"
        ],
        "For the vegetable base": [
            "125g/4½oz onion (about ½), cut into chunks",
            "3 garlic cloves, crushed",
            "125g/4½oz celery, cut into 3cm/1¼in chunks",
            "70g/2½oz fennel, cut into 3cm/1¼in chunks",
            "1 large carrot, cut into 3cm/1¼in chunks",
            "375g/13oz button mushrooms",
            "1 red chilli",
            "12g/½oz fresh root ginger, finely grated or sliced",
            "1 red pepper, cut into large dice",
            "100ml/3½fl oz rapeseed oil",
            "large pinch sea salt"
        ],
        "For the rice": [
            "100g/3½oz flageolet beans",
            "260g/9½oz brown basmati rice",
            "1 bay leaf"
        ],
        "To finish the chilli": [
            "100g/3½oz tomato purée",
            "200g/7oz piquillo peppers",
            "1 x 400g tin chopped tomatoes",
            "1 x 240g tin red kidney beans (drained weight)",
            "100g/3½oz brown sauce",
            "2 tbsp Worcestershire sauce"
        ],
        "To finish": [
            "40g/1½oz chocolate (100 per cent cocoa solids), finely grated",
            "10g coriander leaves, roughly chopped",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "For the toasted spices, in a dry frying pan over a low–medium heat, cook the spices for a minute – taking care to ensure you don’t burn them (you just want to extract the essential oils). Set aside.",
        "For the vegetable base, add the onion, garlic, celery, fennel, carrot, mushrooms, chilli, ginger and red pepper to a food processor. Pulse in 3-second bursts for 30 seconds, until you have 2–3mm dice. This may need to be done in batches depending on the capacity of your food processor.",
        "Heat the oil in a large saucepan over a medium heat and gently fry the vegetables, toasted spices, and a large pinch of salt for 10 minutes.",
        "For the rice, in a separate large saucepan over a high heat, bring 550ml/1 pint water to the boil and cook the flageolet beans for 10 minutes on a full boil until just tender. Lift the beans from the pan using a slotted spoon but keep the cooking liquor on the heat as you will use it to cook the rice. Reserve the beans.",
        "To finish the chilli, add the tomato purée, piquillo peppers and tinned tomatoes and simmer for 10 minutes. Add the kidney beans, cooked flageolet beans, brown and Worcestershire sauces and leave to cook for a further 5 minutes.",
        "While the chilli is cooking, cook the brown rice in the flageolet bean cooking liquor with the bay leaf and simmer for 15–20 minutes, covered with a lid. Depending on the variety of rice, it may take a few more minutes. Once cooked, drain off any excess liquid and transfer to serving dishes.",
        "To finish, stir in the grated chocolate. Taste and season with salt and pepper as required. Serve the chilli with the chopped coriander and brown rice alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}