{
    "author": {
        "raymond_blanc": "Raymond Blanc"
    },
    "cookTime": "10 to 30 mins",
    "description": "This simple dish of barbecued aubergine is dressed with chilli, chickpeas, feta and mint.",
    "dishes": [
        "bun",
        "crumble",
        "salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/burnt_aubergine_salad_22252_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "3 medium aubergines",
            "4 tbsp extra virgin olive oil, plus extra for drizzling",
            "½ lemon, juice only",
            "10g/¼oz salt",
            "8g ground black pepper",
            "pinch sugar",
            "80g/3oz drained cooked or tinned chickpeas",
            "10 dates, chopped",
            "1 red pepper, finely chopped",
            "small bunch mint, leaves picked and chopped",
            "small bunch coriander, leaves picked and chopped",
            "chilli, to taste, finely chopped",
            "1 garlic clove, finely chopped",
            "40g/1½oz feta, crumbled",
            "handful flaked almonds",
            "balsamic vinegar, for drizzling",
            "croûtons, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "14",
    "serves": "Serves 4",
    "show": {
        "b036zkh2": "Raymond Blanc: How to Cook Well"
    },
    "steps": [
        "Prick the aubergines to allow moisture to escape while cooking.",
        "On a hot barbecue, cook the whole aubergines for 15 minutes, turning every five minutes until the aubergines are soft and the skin is blackened and blistered. Set aside until cool enough to handle.",
        "On a small tray, slice the aubergine open lengthways, spoon out the excess water and seeds. Remove the flesh from the skin with a spoon and place into a large bowl.",
        "Drizzle with your best olive oil and the lemon juice. Season to taste with salt and freshly ground black pepper; then add a pinch of sugar.",
        "Reserve some of the chickpeas, pepper and mint for garnish, then mix in the remaining chickpeas, dates, pepper, mint, coriander, chilli and garlic. Taste and correct the seasoning to your liking.",
        "Spoon the aubergine into the middle of a serving plate and garnish with the feta, flaked almonds, reserved chickpeas, chopped mint and pepper.",
        "Drizzle with balsamic vinegar and a little more olive oil. Top with crisp croûtons and serve."
    ],
    "tips": [
        
    ],
    "title": "Grilled aubergine salad",
    "videos": "[]"
}