{
    "author": {
        "john_williams": "John Williams"
    },
    "cookTime": "10 to 30 mins",
    "description": "Fancy a challenge? Try this fine dining version of lobster with butter-brasied vegetables and a delicate lemon verbena sauce.",
    "dishes": [
        "pie",
        "sauce",
        "seafood",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the broad beans": [
            "25g/1oz broad beans",
            "15g/½oz butter",
            "salt and sugar, to taste"
        ],
        "For the lemon verbena sauce": [
            "1 tbsp olive oil",
            "1 shallot, finely chopped",
            "1 carrot, finely chopped",
            "1 stick celery",
            "10g/1/3oz fennel",
            "1cm/½in piece fresh ginger",
            "1 stick of lemongrass",
            "1 sprig lemon verbena (fresh or dried leaves)",
            "60ml/2fl oz vegetable stock",
            "60ml/2fl oz chicken consommé",
            "3 tbsp cream",
            "lemon, juice only",
            "small pinch sugar"
        ],
        "For the morels": [
            "3 morels",
            "4 tsp chicken consommé",
            "15g/½oz butter",
            "salt and freshly ground black pepper"
        ],
        "For the spiced carrot purée": [
            "1 star anise",
            "1 cardamom pod",
            "1 vanilla pod",
            "2cm/1in piece fresh ginger",
            "2 carrots, diced",
            "25g/1oz butter",
            "salt and freshly ground black pepper",
            "2 tsp cream"
        ],
        "default": [
            "1 lobster",
            "50g/1¾oz butter",
            "2 tbsp sugar",
            "pinch salt"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the spiced carrot purée, tie the star anise, cardamom, vanilla and ginger in a muslin bag.",
        "Place the carrots in a pan with the bag of spices, butter (reserving a small amount), salt and pepper, and enough water to cover. Cook slowly until the carrots are tender, remove the spices and set aside.",
        "Drain the carrots - reserving the cooking water. In a blender, liquidise the carrots to a smooth purée. Use some of the reserved water to loosen the purée if necessary. Stir in the remaining butter and cream.",
        "For the lemon verbena sauce, heat the oil in a frying pan and gently fry the shallots, carrots, celery and fennel until softened but not coloured.",
        "Add the ginger and lemongrass, and cook gently for 15 minutes.",
        "Add the vegetable stock and chicken consommé, bring to the boil and simmer gently for 30 minutes.",
        "Remove from the heat and add the lemon verbena leaves. Set aside to infuse in a covered pan for five minutes, then pass through a chinois or fine metal sieve.",
        "Add the cream and whisk vigorously to a light foam, season with salt and pepper, to taste, and finish with lemon juice and sugar.",
        "For the lobster, to kill the live lobster place it in the freezer for 30 minutes to stun it then pierce it just behind the head with a sharp, heavy knife or skewer.",
        "Separate the claws and tail from the head.",
        "In a pan of boiling water, blanch the claws for five minutes and the tail for three minutes, remove and refresh in ice-cold water.",
        "Remove the lobster meat from the shell, keeping the meat in large pieces.",
        "For the broad beans, blanch the broad beans and then remove from the husks quickly.",
        "To cook the morels, remove their stalks and quickly wash to ensure there is no sand inside. Braise in an emulsion of the consommé and 15g/½oz butter. Season, to taste, with salt and freshly ground black pepper. Cook gently until soft.",
        "To finish cooking the broad beans, melt the butter in a pan. Add two tablespoons of water, a pinch of salt and a pinch of sugar and mix to make an emulsion. Add the broad beans and allow to warm through for a few minutes.",
        "When ready to serve, reheat the lobster by melting the butter with two tablespoons of sugar, a pinch of salt and a little water in a pan. Mix to make an emulsion. Add the lobster meat and allow to sit off the heat for three minutes to warm through.",
        "To serve, place a spoonful of carrot purée in the centre of each plate. Place the lobster meat on top. Dress with the morels and broad beans. Spoon the verbena sauce around the plate and serve."
    ],
    "tips": [
        
    ],
    "title": "Butter poached lobster, spiced carrot purée and lemon verbena sauce",
    "videos": "[]"
}