{
    "title": "How to make shortbread",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes about 18 biscuits",
    "recommendations": "32",
    "images": [
        
    ],
    "description": "Shortbread biscuits fill the kitchen with a wonderful buttery freshly-baked smell. So simple and easy to flavour with your own choice of vanilla, lemon zest or even lavender. Kids will love making them too.",
    "author": {
        "donal_skehan": "Donal Skehan"
    },
    "show": {
        
    },
    "tips": [
        "You can leave out the vanilla for plain biscuits, or try adding grated lemon zest, orange zest or lavender flowers into the mix for different flavours."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "200g/7oz unsalted butter, at room temperature, cut into small cubes",
            "100g/3½oz sugar, plus extra for sprinkling",
            "1 tsp vanilla extract",
            "300g/10½oz plain flour, sifted, plus extra for dusting"
        ]
    },
    "steps": [
        "Preheat the oven to 160C/325F/Gas 3.",
        "Mix together the butter and sugar, either by hand or using an electric hand whisk, until pale and smooth. Add the vanilla extract, then gently mix in the flour until completely incorporated (try not to work the flour too much or the biscuits will not be so crumbly). Using your hands, squeeze the mixture together into a ball of dough.",
        "Gently roll the dough out to about 5mm/¼in thick (dust the work surface with a little flour if the dough sticks). Cut into shapes using a biscuit cutter. Transfer the biscuits to a baking tray lined with baking parchment (or a non-stick baking tray) and chill in the fridge for 15 minutes to rest (chilling makes them hold their shape better when baking).",
        "Before cooking, sprinkle each biscuit with a pinch of granulated sugar. Bake in the preheated oven for 15-20 minutes, or until pale golden-brown.",
        "Remove from the oven and transfer the biscuits to a wire rack to cool."
    ],
    "howTos": [
        
    ],
    "videos": "[p018cl38:p018cl3c]"
}