{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "Marron glacé (candied chestnuts) give a Christmassy taste to this grown-up Swiss roll, served with a cinnamon goats’ milk sauce.",
    "dishes": [
        "crumble",
        "icing",
        "jam",
        "meringue",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries",
        "swiss_roll"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the cinnamon goats’ milk sauce": [
            "600ml/1 pint 2fl oz goats’ milk",
            "200g/7oz caster sugar",
            "75g/3oz golden syrup",
            "2 cinnamon sticks",
            "1 tsp baking powder"
        ],
        "For the roulade": [
            "5 free-range egg whites",
            "275g/9¾oz caster sugar",
            "icing sugar, for dusting",
            "600ml/20fl oz double cream",
            "200g/7oz marron glacé (candied chestnuts), roughly chopped"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4-6",
    "show": {
        "b03lsr84": "Christmas Kitchen with James Martin"
    },
    "steps": [
        "For the cinnamon goats’ milk sauce, bring the goats’ milk, sugar and golden syrup to the boil in a saucepan.",
        "Crumble the cinnamon sticks into the mixture and stir in the baking powder. Remove the mixture from the heat straight away as the baking powder will make the mixture bubble up.",
        "Whisk the sauce until the bubbling subsides, then return the pan to the heat and cook the mixture over a gentle heat, whisking continuously, until the sauce is simmering.",
        "Continue to simmer the sauce over a low heat for 45 minutes, or until thickened and golden-brown in colour. Strain before serving to remove the pieces of cinnamon.",
        "For the roulade, preheat the oven to 180C/350F/Gas 4 and line a 23x33cm/9x13in Swiss roll tin with baking parchment.",
        "In a large bowl, whisk the egg whites using an electric hand whisk until stiff peaks form when the whisk is removed. Gradually add the sugar, a spoonful at a time, whisking between each addition. Whisk until very stiff and glossy and all the sugar has been added.",
        "Spoon the mixture into the prepared tin and smooth the surface. Place the tin in the preheated oven and bake for eight minutes, or until golden-brown. Lower the temperature to 160C/325F/Gas 3 and bake for a further 15 minutes, or until crisp.",
        "Remove from the oven and turn out, crispy-side down, onto a sheet of non-stick baking paper dusted with icing sugar. Remove the baking parchment from the base of the cooked meringue and allow to cool.",
        "Place the cream in a bowl and lightly whip. Spread evenly over the meringue and scatter over the marron glacé. Starting at the long end, roll up the meringue using the paper to help you.",
        "Finish with a dusting of icing sugar.",
        "To serve, cut the roulade into thick slices and place onto a plate, then finish with a generous drizzle of sauce."
    ],
    "tips": [
        
    ],
    "title": "Candied chestnut meringue roulade with cinnamon goats’ milk sauce",
    "videos": "[]"
}