{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "description": "Cardamom with white chocolate is a surprisingly good combination in a sponge cake. Equipment: You will need 2 x 20cm/8in loose-bottomed sandwich tins, and a dove shaped stencil to decorate.",
    "dishes": [
        "cake",
        "icing",
        "oven-baked_dishes",
        "sandwich",
        "sponge_cake",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "melting_chocolate",
        "testing_to_see_if_a_cake_is_cooked"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the cake": [
            "225g/8oz butter",
            "4 free-range eggs",
            "225g/8oz caster sugar",
            "225g/8oz self-raising flour",
            "2 tsp baking powder",
            "12 cardamom pods"
        ],
        "For the icing": [
            "100g/3½oz white chocolate",
            "50g/1¾oz butter, softened",
            "75g/2½oz cream cheese",
            "200g/7oz icing sugar",
            "½ tsp vanilla extract",
            "icing sugar and dove stencil, to decorate (optional)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 8",
    "show": {
        "b074bqr2": "Mary Berry's Easter Feast"
    },
    "steps": [
        "Preheat the oven 180C/160C Fan/Gas4. Grease two 20cm/8in loose-bottomed sandwich tins and line with non-stick baking paper.",
        "Place the butter, eggs, sugar, flour and baking powder into a large bowl and beat together (using an electric hand whisk if you have one) until well combined.",
        "Bash the cardamom pods with a rolling pin to release the seeds. Tip the seeds in a pestle and mortar and mash until fine. (Be sure to crush the cardamom seeds only, not the pods as these do not tenderize down.) Stir the crushed seeds into the cake batter, then pour the mixture into the prepared tins.",
        "Bake for about 25 minutes until golden-brown and springy to the touch. Remove from the oven and leave to cool for 5 minutes and then turn them out to cool on a wire rack.",
        "To make the icing, gently melt the white chocolate in a bowl over a pan of just simmering water. (Do not overheat the white chocolate otherwise it will not set.) Stir until runny then set aside to cool and thicken a little.",
        "Whisk the butter and cream cheese together until fluffy and soft. Add half the icing sugar, whisk again, add the vanilla and the remaining icing sugar and whisk again. Stir in the white chocolate until combined. Transfer to the fridge for about 20 minutes until thickened to a spreading consistency.",
        "Slice each cake in half horizontally to give 4 thin sponges. Sandwich together with the icing and arrange on a cake stand so you have 4 layers of cake and 3 layers of icing leaving the top of the cake plain.",
        "Sprinkle with icing sugar, using a decorative dove stencil if you have one."
    ],
    "tips": [
        
    ],
    "title": "Cardamom sponge with white chocolate icing",
    "videos": "[]"
}