{
    "title": "Cardamom and lemon stamped cookies",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Makes 24 biscuits",
    "recommendations": "38",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/cardamom_and_lemon_74033_16x9.jpg"
    ],
    "description": "We discovered that cardamom is a really popular spice in Norway, used in many cake and biscuit recipes. Some say the spice was first brought back to the country hundreds of years ago by Vikings who worked as mercenaries in what was then Constantinople (now Istanbul). Whatever the truth, Norwegians are certainly keen on their cardamom. We made these cookies on a boat on the Geiranger Fjord – a stunning spot.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b01dl8gl": "Hairy Bikers' Bakeation"
    },
    "tips": [
        "You can also make these cookies using a biscuit press. They’ll be about half the size, so cook them for 10–12 minutes instead."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "225g/8 oz butter, softened",
            "150g/5½ oz caster sugar",
            "1 lemon, zest only",
            "250g/9 oz plain flour",
            "100g/3½ oz ground almonds",
            "3 tsp ground cardamom or 1 heaped tsp cardamom seeds, ground in a pestle and mortar"
        ]
    },
    "steps": [
        "Preheat the oven to 190C/375F/Gas 5. Line 2 large baking trays with baking parchment.",
        "Using an electric hand-whisk, beat the butter, sugar and lemon zest together in a large bowl until pale and fluffy.",
        "Beat in the flour, almonds and cardamom until the mixture is well combined and comes together to form a stiff dough.",
        "Roll the dough into 24 balls and place 12 on each baking tray – make sure you leave space between each one.",
        "Press each cookie with a cookie stamp or the bottom of a glass to flatten and leave decorative indentations in the dough.",
        "Bake a tray at a time for 12–14 minutes until the cookies are pale golden brown.",
        "Leave them to cool on the tray for a few minutes, then transfer to a wire rack. They will crisp up as they cool. Store the cookies in an airtight tin and eat within 7 days."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}