{
    "title": "Carrot and walnut cake",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Makes 6 small cakes",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "Individual carrot cakes topped with a pistachio and cream cheese icing and marzipan decorations.",
    "author": {
        "jun_tanaka": "Jun Tanaka"
    },
    "show": {
        "b01rclgp": "Country Show Cook Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the carrot cake": [
            "2 free-range eggs",
            "200g/7oz light brown sugar",
            "pinch salt",
            "85g/3oz vegetable oil, plus extra for greasing",
            "250g/9oz carrots, grated",
            "35g/1¼oz walnuts, chopped",
            "125g/4½ oz strong flour, sifted",
            "½ tsp baking powder",
            "½ tsp bicarbonate of soda",
            "1 tsp ground cinnamon"
        ],
        "For the topping": [
            "200g/7oz cream cheese",
            "100g/3½oz caster sugar",
            "50g/1¾oz pistachio paste (available online)",
            "few drops green food colouring"
        ],
        "To decorate (optional)": [
            "250g/9oz marzipan",
            "few drops orange food colouring",
            "few drops red food colouring",
            "20g/¾oz cocoa powder",
            "6 tbsp cocoa nibs"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4 and grease six 10x5cm/4x2in disposable rectangular moulds or a six cup muffin tin.",
        "To make the cake, whisk the eggs, sugar, salt and oil together in a large bowl. Add the carrots, walnuts, flour, baking powder, bicarbonate of soda and cinnamon and fold in to combine.",
        "Spoon the batter into the moulds or muffin tin and bake for 25 minutes.",
        "Meanwhile, make the topping. In a bowl combine the cream cheese, sugar and pistachio paste. Add green food colouring, stirring through a drop at a time, until you get an even light-green colour. Set aside until ready to use.",
        "When cooked, remove the cakes from the oven and set aside to cool. When completely cool, spread the topping over the cakes.",
        "To decorate, massage the marzipan to soften. Set aside a third of the marzipan. Knead in the orange and a little red food colouring into the remaining marzipan until you have bright-orange ‘carrot’ colour. Mould into mini carrots. Knead the green food colouring into the reserved marzipan, mould it into carrots tops and attach them to the orange ‘carrots’.",
        "Place them on top of the cake and dust with cocoa powder.",
        "Along the top of each cake, sprinkle a line of cocoa nibs to look like soil with the green tops of the carrots sticking out."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}