{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "description": "A moist chocolate cake that really can’t go wrong and keeps well for birthday parties. It has a wonderful white chocolate icing so the contrast looks stunning too.",
    "dishes": [
        "cake",
        "chocolate_cake",
        "icing",
        "oven-baked_dishes",
        "sandwich",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "greasing_and_lining",
        "icing_cake_ganache",
        "testing_to_see_if_a_cake_is_cooked"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/celebration_chocolate_18175_16x9.jpg"
    ],
    "ingredients": {
        "For the icing": [
            "200g/7oz white chocolate",
            "150ml/¼ pint double cream",
            "1 x 125g/4½oz tub full-fat cream cheese"
        ],
        "default": [
            "190g/6½oz self-raising flour",
            "150g/5oz caster sugar",
            "2 level tbsp cocoa powder",
            "1 level tsp bicarbonate of soda",
            "1 level tsp baking powder",
            "2 tbsp golden syrup",
            "2 free-range eggs",
            "150ml/¼ pint sunflower oil",
            "150ml¼ pint milk"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "64",
    "serves": "Serves 8",
    "show": {
        "b01qgf70": "The Mary Berry Story"
    },
    "steps": [
        "Heat the oven to 180C/350F/Gas 4 and grease and line with greased greaseproof paper the bases of two 20cm/8in straight-sided loose bottomed sandwich tins.",
        "Sift the dry ingredients into a large bowl and make a well in the centre. Add the syrup, eggs, oil and milk, mix with an electric hand whisk and pour into the tins.",
        "Bake in the oven for 25-30 minutes, or until the cakes springs back when lightly pressed with your fingertips. Turn out on a wire rack, remove the paper and leave to cool.",
        "For the icing, break the white chocolate into a bowl. Heat the double cream in a pan, until very hot but not boiling and pour the hot cream over the white chocolate to melt it. Stir until melted and set aside to cool.",
        "Spoon the cream cheese into a bowl then gradually add the white chocolate mixture and stir until combined. Set aside to cool a little, until thick enough to ice.",
        "Spread half of the icing on one cake, sit the other cake on top and spread the remaining icing on top to give a pretty finish."
    ],
    "tips": [
        "This is a great recipe to make for and with children. Mary always places a large plate underneath the mixing bowl so that there’s no worry that when the child cracks an egg on the side of the bowl most of it doesn’t go on the table."
    ],
    "title": "Celebration chocolate cake",
    "videos": "[]"
}