{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "Try a twist on an old-fashioned favourite with rich buttery brioche and custard infused with tea and spices.",
    "dishes": [
        "bread",
        "bread_and_butter_pudding",
        "brioche",
        "custard",
        "oven-baked_dishes",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "15 green cardamom pods",
            "8 cloves",
            "1 tsp freshly grated nutmeg (roughly half a whole nutmeg)",
            "1½ tsp ground ginger",
            "½ tsp flaked sea salt",
            "400ml/14fl oz whole milk",
            "150g/5½oz golden caster sugar, plus 1 heaped tbsp for sprinkling",
            "1 tsp vanilla extract",
            "2 tbsp Indian leaf tea, preferably Assam",
            "1 long strip orange peel",
            "1 cinnamon stick, broken in half",
            "300g/10½oz brioche loaf, thickly sliced (or 10 slices of crustless, thickly cut white bread)",
            "50g/1¾oz softened butter, plus extra for greasing",
            "125g/4½oz mixed dried fruit",
            "4 large free-range egg yolks",
            "2 large free-range eggs",
            "300ml/10fl oz double cream"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "6",
    "serves": "Serves 6",
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "steps": [
        "Put the cardamom pods and cloves in a pestle and mortar and pound for about a minute, or until the pods are split and the cloves are roughly crushed. Tip into a medium non-stick saucepan and add the nutmeg, ginger, salt and milk. Stir in the sugar, vanilla, leaf tea, orange peel and cinnamon stick. Bring to a gentle simmer and cook over a low heat for five minutes, stirring occasionally. Remove the pan from the heat and leave to stand for 10 minutes.",
        "Butter a 1.75-2 litre/3-3½ pint shallow ovenproof dish – a round one looks good. Spread one side of each slice of brioche with softened butter. Arrange the brioche slices in the dish, butter side up and slightly upright but leaning against each other, scattering the mixed dried fruit between the slices as you go.",
        "Whisk the egg yolks, whole eggs and cream together in a large jug or bowl until smooth. Strain the infused milk through a fine sieve onto the egg mixture and stir well to combine. Discard the spices and peel.",
        "Pour the creamy liquid slowly over the buttered brioche. (The bread will float, so press it down gently with a spatula for a few seconds to help it absorb the custard.) Leave to stand for 15 minutes.",
        "Meanwhile, preheat the oven to 180C/350F/Gas 4.",
        "Place the dish in a roasting tin. Pour boiled water into the roasting tin around the outside of dish to come half way up the sides. Sprinkle the pudding with sugar and bake for 35-40 minutes, or until the custard is just set, but still just a little creamy in the centre, and the bread is golden-brown and crisp on top.",
        "Remove from the oven and carefully lift out of the roasting tin. Serve hot with cream, custard or good vanilla ice cream."
    ],
    "tips": [
        
    ],
    "title": "Chai bread and butter pudding",
    "videos": "[p0179tyc:p0179tyh]"
}