{
    "author": {
        "galton_blackiston": "Galton Blackiston"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Buy the best quality smoked salmon you can for this recipe and have the steaks cut from the centre, at least 1cm/½in thick so that you can get chargrilled lines on both sides of the fish and still leave the centre fairly rare.",
    "dishes": [
        "pie",
        "sauce",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the herbed scrambled eggs": [
            "9 free-range eggs",
            "150g/5oz butter, cut into small pieces",
            "3 tbsp snipped chives",
            "2 tbsp chopped parsley",
            "1 tbsp chopped tarragon",
            "1 tbsp chopped mint",
            "salt and freshly ground black pepper"
        ],
        "For the lemon purée": [
            "caster sugar, measured to the 850ml/1½ pint mark in a measuring jug",
            "3 unwaxed lemons"
        ],
        "For the salmon": [
            "450g/1lb smoked salmon, cut into 1-2cm/½-¾in thick steaks"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the lemon purée, put the sugar and 850ml/1½ pint water into a saucepan.",
        "Over a low heat, allow the sugar to dissolve and then bring it up to a light simmer for 10 minutes. Remove from the heat and leave to cool. This stock syrup will keep in the fridge for up to a week.",
        "Prick the lemons fairly deeply all over and place into a saucepan with sufficient cold water to cover. Bring to the boil, remove from the heat and allow the lemons to cool in the water. Repeat this twice more using fresh water each time.",
        "Place the lemons into the saucepan again and cover with a third of the stock syrup. Bring to the boil, remove from the heat and allow the lemons to cool in the stock syrup.",
        "Repeat this twice more using fresh stock syrup each time.",
        "Place the lemons together with a few tablespoons of the stock syrup (retain the remaining stock syrup) and blend in a blender until smooth.",
        "Pass through a sieve, taste and add a little more of the retained stock syrup if necessary, store in a squeezy bottle in the fridge.",
        "For the herbed scrambled eggs, break the eggs into a large bowl, beat them well and then push them through a sieve into a heavy based, non-stick saucepan. Add the pieces of butter and set aside.",
        "Place the chives, parsley, tarragon and mint in a bowl.",
        "About 20 minutes before serving, heat the eggs on the lowest possible heat, stirring continuously.",
        "Once the butter has melted, the eggs will start to cook: watch them carefully as they need to be fairly runny when served and will continue to cook after you have taken them off the heat.",
        "Just before serving, add the herbs and salt and pepper, to taste.",
        "For the salmon, heat a heavy-based ridged frying pan until it is nearly smoking.",
        "Place the salmon steaks across the ridges of the pan and press down for no longer than 30 seconds.",
        "Turn the steaks over and repeat on the other side.",
        "To serve, place the salmon onto each plate, pile the eggs alongside with a squeeze of lemon purée."
    ],
    "tips": [
        
    ],
    "title": "Chargrilled smoked salmon with herbed scrambled eggs and lemon purée",
    "videos": "[]"
}