{
    "author": {
        "elizabeth_david": "Elizabeth David"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "French",
    "description": "This classic recipe for a rich, cheesy souffle is perfect for a quick supper. All it needs is a simple green salad.",
    "dishes": [
        "oven-baked_dishes",
        "prepare-ahead_desserts",
        "salad",
        "sauce",
        "souffle",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/cheesesouffle_5237_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 tbsp flour",
            "1oz butter",
            "½pt milk, warmed",
            "2oz finely grated parmesan cheese",
            "4 large egg yolks",
            "5 large egg whites",
            "salt and freshly ground pepper",
            "cayenne pepper"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "13",
    "serves": "Serves 4-5",
    "show": {
        
    },
    "steps": [
        "Prepare the basic mixture by stirring one generous tablespoon of flour into 1oz of butter melted in a heavy saucepan. Gradually add just under ½pt of warmed milk, stirring until your mixture is quite smooth. Let this sauce cook very gently and slowly, stirring frequently, for close on 10 minutes. Now stir in 2oz of finely grated parmesan cheese (or if you prefer, 1oz each of parmesan and gruyère) and then the very thoroughly beaten yolks of 4 large eggs. Remove the mixture from the fire, and continue stirring for a few seconds. Now add a seasoning of salt (always to be added after the cheese) and quite a generous amount of freshly-ground pepper, plus if you like, a scrap of cayenne. This basic mixture can be made well in advance.",
        "When the time comes to make the souffle, preheat the oven to 200C/400F/Gas6. Have the shelf placed fairly low in the oven, and a baking sheet on the shelf. Butter 1½pt souffle dish (the size is important).",
        "Whisk the whites of the eggs, in a large scrupulously dry and clean bowl, until they stand in peaks on the whisk and look very creamy. Tip half the whites on top of the basic mixture. With a palette knife cut them into it again, slowly rotating the bowl with your left hand, lifting rather than stirring the whole mass. Add the remainder of the whites in the same way. All this should take only a few seconds and as you pour the whole mixture, without delay, into the dish, it should look very bubbly and spongy, but if the whites have been over-beaten or rammed into the main mixture with a heavy hand, it will already begin to look flat. With a palette knife, mark a deep circle an inch or so from the edge, so that the souffle will come out with a cottage-loaf look to the top. Put it instantly into the oven.",
        "As to timing, it depends so much upon the size and type of both the oven and the dish that it is misleading to give precise details. I can only say, as a general guide, that in the oven of a representative domestic gas cooker, this souffle is perfectly cooked at 200C/400F/Gas 6 in 23 to 35 minutes."
    ],
    "tips": [
        
    ],
    "title": "Cheese soufflé",
    "videos": "[]"
}