{
    "author": {
        "rachel_khoo": "Rachel Khoo"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "Savoury cakes are very popular in France, they appear in boulangeries and with a side salad on lunch menus in chic cafés, but they’re most likely to appear at a picnic. They are super-simple to make and can be adapted to use whatever leftovers you have in your fridge – just follow the basic batter recipe and get creative with the fillings!",
    "dishes": [
        "cake",
        "oven-baked_dishes",
        "pie",
        "salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "250g/9oz plain flour",
            "1 tbsp baking powder",
            "150g/5½oz soft goat’s cheese, cut into small pieces",
            "80g/2¾oz pistachios, roughly chopped",
            "100g/3½oz prunes, roughly chopped",
            "4 free-range eggs",
            "150ml/5fl oz olive oil",
            "100ml/3½fl oz milk",
            "50g/1¾oz plain yoghurt",
            "1 tsp salt",
            "pinch freshly-ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "43",
    "serves": "",
    "show": {
        "b01dy7yt": "The Little Paris Kitchen: Cooking with Rachel Khoo"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4 and line a loaf tin measuring 22x11cm/8½x4¼in across the top and 6cm/2½in deep with baking paper.",
        "In a bowl, mix together the flour, baking powder, goat’s cheese, pistachios and prunes.",
        "In a separate bowl, whisk the eggs until fluffy and pale in colour. Then gradually whisk in the oil, milk and yoghurt. Season with the salt and freshly-ground black pepper.",
        "Fold the flour mixture into the whisked eggs. Try not to overbeat as this will make the end result tough (it’s better to undermix).",
        "Pour the batter into the prepared tin.",
        "Bake for 30-40 minutes or until a metal skewer inserted in the centre of the cake comes out clean.",
        "Leave to cool in the tin."
    ],
    "tips": [
        "Use a rubber spatula rather than a whisk to prevent overbeating the flour."
    ],
    "title": "Cheese, pistachio and prune cake",
    "videos": "[p00qw207:p00qw209]"
}