{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "10 to 30 mins",
    "description": "The Hairy Bikers serve up this creamy chicken liver pâté as part of an Eastern European smorgasboard, it also makes wonderful party food or a tasty starter if you have friends over for dinner.",
    "dishes": [
        "pate",
        "pie",
        "terrine"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "15g/½oz butter",
            "½ small onion or one shallot, finely chopped",
            "1 sprig fresh thyme, leaves picked and finely chopped",
            "400g/14oz chicken livers, roughly chopped",
            "1 tsp finely ground white pepper",
            "3 allspice berries, finely ground (available online and in some supermarkets)",
            "50ml/2 fl oz sherry or brandy",
            "salt, to taste"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b069hr3q": "The Hairy Bikers' Northern Exposure"
    },
    "steps": [
        "Melt the butter in a frying pan. When it is just foaming, add the onion and thyme. Sauté until the onion is soft and translucent, then add the chicken livers and spices.",
        "Turn up the heat and fry until the livers are just cooked through, this should take about 3-5 minutes. To test if the chicken is cooked, remove a piece of liver and cut it open; it should be moist but not bloody ,a little tinge of pink is fine. Transfer the mixture to a bowl and leave to cool.",
        "Return the frying pan to the heat, pour in the sherry. Allow to bubble and reduce by half, stirring and scraping up any sediment from the bottom of the frying pan as you go, remove from the heat and leave to cool.",
        "Put the chicken mixture in a food processor. Pour in the reduced sherry. Pulse the food processor until the pâté is smooth. To make the pâté extra smooth pass it through a coarse sieve. Season with salt to taste.",
        "Put the pâté in a terrine dish or pot and chill in the fridge for about 2 hours. If you want to keep the pâté for a few days, cover it with clarified butter."
    ],
    "tips": [
        
    ],
    "title": "Chicken liver pâté",
    "videos": "[p031llk8:p031llkc]"
}