{
    "author": {
        "elaine_wilson": "Elaine Wilson"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "British",
    "description": "A traditional chicken pie is a classic comfort food favourite. Serve with mashed potatoes and green vegetables, or a simple salad.",
    "dishes": [
        "bread",
        "chicken_pie",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "salad",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/chicken_pie_24044_16x9.jpg"
    ],
    "ingredients": {
        "For the filling": [
            "1 medium chicken",
            "1 onion, peeled",
            "6 cloves",
            "1 carrot, peeled",
            "2 bay leaves",
            "1 chicken stock cube",
            "6–8 peppercorns"
        ],
        "For the pastry": [
            "450g/1lb plain flour",
            "½ tsp salt or to taste",
            "120g/4½ oz butter, cold",
            "120g/4½ oz vegetable shortening, cold",
            "1 free-range egg, beaten, for glazing"
        ],
        "For the sauce": [
            "250ml/9fl oz whole milk",
            "55g/2oz butter",
            "55g/2oz plain flour"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "14",
    "serves": "Serves 8",
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "steps": [
        "Rinse the chicken in cold water and place it in a large pan.",
        "Stud the onion with cloves and add it to the pan with the carrot, bay leaves, stock cube and peppercorns.",
        "Cover with cold water and bring to the boil, then reduce the heat and simmer until the chicken is cooked. This will take about 45 minutes–1¼ hours, depending on the size of the chicken.",
        "Meanwhile, make the pastry. Sift the flour and salt together into a large mixing bowl. Dice the cold butter and vegetable shortening and rub them into the flour until the mixture resembles fine breadcrumbs.",
        "Mix in just enough cold water to form a stiff dough. Turn this out onto a lightly floured surface and knead gently to form a smooth ball of dough. Wrap in clingfilm or place in a plastic bag and chill for at least 30 minutes.",
        "When the chicken is cooked, take the pan off the heat. Remove the chicken and place it on a plate. Put the pan back on the heat and reduce the cooking liquid to about 250ml/9fl oz. Strain the reduced liquid into a jug and leave to cool, then skim off the fat and discard it.",
        "When the chicken is cool enough to handle, cut the meat into chunks and discard the skin and bones.",
        "For the sauce, remove the cloves from the onion and place in a food processor with the reserved stock. Blend until smooth, then add the milk and set aside.",
        "Melt the butter in a pan and stir in the flour. Gradually add the stock and milk, then bring to the boil, stirring continuously. Reduce the heat and simmer for 4-5 minutes to cook out the taste of the flour.",
        "Season, to taste, with salt and freshly ground black pepper, then fold the meat gently into the sauce. Set the mixture aside to cool.",
        "Preheat the oven to 220C/425F/Gas 7. Roll out two-thirds of the pastry and use it to line a 20-25cm/8-10in pie plate and add the cooled chicken mix.",
        "Roll out the remaining pastry to make a lid for the pie, brush the edge with beaten egg and pinch the edges together to seal.",
        "Decorate the top of the pie with leaves made from pastry trimmings and brush all over with beaten egg. Make a hole in the top of the pie to allow the steam to escape, then bake in the preheated oven for about 45 minutes, or until the pastry is golden-brown."
    ],
    "tips": [
        
    ],
    "title": "Traditional chicken pie",
    "videos": "[]"
}