{
    "author": {
        "ching-he_huang": "Ching-He Huang"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Chinese",
    "description": "In Yunnan, after spending time fishing with the Dai minority ladies, I was inspired to cook steamed sea bream served with a salsa verde made using local Vietnamese mint and wild coriander.",
    "dishes": [
        "pie",
        "salsa",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the salsa verde": [
            "1 garlic clove, peeled, crushed and finely chopped",
            "2.5cm/1in piece fresh root ginger, peeled and finely chopped",
            "8 small fresh chillies, finely sliced",
            "2 spring onions, finely sliced",
            "large handful of Vietnamese mint (or a few leaves of fresh basil), finely chopped",
            "large handful of wild coriander (or farmed coriander), finely chopped",
            "5–6 tbsp groundnut oil",
            "¼ tsp sea salt",
            "2–3 tbsp light soy sauce"
        ],
        "default": [
            "1 x 675g/1½lb whole, large sea bream, cleaned",
            "2 large pinches of toasted and ground spice mix made from 2 Chinese cardamoms, 3 star anise and 1 tbsp Sichuan peppercorns",
            "2 large pinches of sea salt"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2-4",
    "show": {
        "b01lybfj": "Exploring China: A Culinary Adventure"
    },
    "steps": [
        "Season the fish with the toasted Chinese spices, then season with salt on both sides. Place the fish on a heatproof plate in a bamboo steamer. Half-fill the wok with boiling water, place the steamer over the wok (making sure the base doesn't touch the water), cover and steam on high heat for 10–15 minutes until the flesh of the fish turns opaque and flakes when poked.",
        "While the fish is cooking, combine all the salsa verde ingredients in a bowl and mix well.",
        "To serve, pour the sauce over the fish and accompany with rice and vegetables."
    ],
    "tips": [
        
    ],
    "title": "Ching's steamed sea bream with a Vietnamese mint and wild coriander salsa verde",
    "videos": "[]"
}