{
    "author": {
        "angela_hartnett": "Angela Hartnett"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "French",
    "description": "These moreish chocolate truffles are strictly for sweet-toothed chocoholics - keep them under lock and key as they're addictive and almost too easy to make.",
    "dishes": [
        "chocolate_truffle",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "300g/10½oz assorted chocolate bars, including dark chocolate, milk chocolate and raisin and nut chocolate, broken into pieces",
            "30g/1oz unsalted butter",
            "250ml/8¾fl oz double cream",
            "pinch salt",
            "100g/4oz chopped mixed nuts, such as pecan nuts, roasted hazelnuts and almonds"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "9",
    "serves": "Makes 30",
    "show": {
        
    },
    "steps": [
        "Bring a little water to a simmer in a pan. Place the chocolate and butter in a large bowl, then set the bowl over the simmering water. (Do not allow the base of the bowl to touch the water.) Stir until melted and glossy.",
        "Heat the cream in a separate saucepan until almost boiling (but do not allow the cream to reach boiling point).",
        "Pour the hot cream over the melted chocolate and mix together until smooth and well combined. Stir in a pinch of salt.",
        "Line a roasting tray with greaseproof paper and pour in the melted chocolate. Set aside to cool, then chill in the fridge until set.",
        "Once the chocolate mixture has cooled and set, mix the chopped nuts together and sprinkle onto a baking tray.",
        "Roll the chilled chocolate mixture into small balls using your hands, then roll each ball in the chopped nuts until completely coated. Place the truffles onto a baking tray or plate and chill until ready to serve."
    ],
    "tips": [
        "Roll the truffles into balls that are smaller than normal truffles because by the time you've coated them in the nuts they will look a lot bigger!"
    ],
    "title": "Chocolate truffles",
    "videos": "[]"
}