{
    "author": {
        "richard_phillips": "Richard Phillips"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A cheeky pinch of chilli and a splash of rum make this chocolate tart irresistible - lush with a fruit salad of papaya, citrus and pomegranate. Equipment and preparation: you will need a 25-30cm/10-12in chefs’ ring. Alternatively, use a large flan tin.",
    "dishes": [
        "bread",
        "chocolate_tart",
        "icing",
        "oven-baked_dishes",
        "pastry",
        "salad",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chocolate tart": [
            "150ml/5fl oz double cream",
            "250ml/9fl oz full-fat milk",
            "small pinch dried chilli flakes",
            "400g/14oz dark chocolate, melted",
            "50ml/2fl oz white rum",
            "2 medium free-range eggs"
        ],
        "For the lemon cream": [
            "200ml/7fl oz double cream",
            "1 unwaxed lemon, juice only"
        ],
        "For the marinated fruits": [
            "100g/3½oz caster sugar",
            "1 thumb-sized knob fresh root ginger, finely grated",
            "1 papaya, finely diced",
            "1 pomelo fruit (or grapefruit if not available)",
            "1 pomegranate, seeds only"
        ],
        "For the pastry": [
            "80g/3oz icing sugar",
            "125g/4½oz plain flour, plus extra for dusting",
            "75g/2½oz unsalted butter",
            "2 free-range egg yolks",
            "½ vanilla pod, split in half and seeds scraped out",
            "rice, for baking blind (alternatively use baking beans)"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "",
    "serves": "Serves 8-10",
    "show": {
        "b01rycym": "Chefs: Put Your Menu Where Your Mouth Is"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the pastry, place all the ingredients except the rice in a food processor and blend in light pulses until the mixture resembles fine breadcrumbs.",
        "Remove the mixture from the processor and bring together into a smooth ball using your hands. Wrap in cling film and place in the fridge to rest for at least an hour.",
        "For the marinated fruits, put the sugar, 100g/3½fl oz water and the ginger into a small saucepan and cook until the sugar has dissolved. Remove from the heat and set aside until cool.",
        "Once cooled, add the fruit to the mixture and set aside in the fridge until needed.",
        "Remove the pastry from the fridge. On a lightly floured work surface roll out the pastry until it is 5mm/¼in thick. Place a 25-30cm/10-12in chefs’ ring on a baking tray. Carefully lift the pastry and press into the chefs' ring (or flan tin). Put a large sheet of greaseproof paper on top and fill with rice or baking beans (this is called baking blind).",
        "Bake for 10-12 minutes, or until golden-brown. Remove from the oven and discard the paper and rice.",
        "For the chocolate tart, put the cream and milk in a large saucepan with the chilli flakes. Warm through and remove from the heat. Add the chocolate, rum and egg yolks and stir.",
        "Once the pastry has cooled, pour in the chocolate mixture and bake for 30-40 minutes.",
        "For the lemon cream, whisk the cream until stiff peaks form when the whisk is removed, add the lemon juice and stir.",
        "To serve, place a slice of the tart on each plate, put the cream on top and fruits on the side."
    ],
    "tips": [
        "The rice used for blind baking can be saved in an airtight container and reused."
    ],
    "title": "Chocolate tart, marinated fruits and lemon cream",
    "videos": "[]"
}