{
    "title": "Chocolate whoopie pies",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 12",
    "recommendations": "36",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/chocolate_whoopies_67418_16x9.jpg"
    ],
    "description": "Whoopie pies are two soft cookies sandwiched with a delicious filling. Try Simon Rimmer's easy recipe.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "125g/4½oz butter",
            "150g/5½oz chocolate, minimum 70% cocoa solids, plus extra for melting (optional)",
            "225g/8oz sugar",
            "3 free-range eggs",
            "1 tsp vanilla extract",
            "250g/8¾oz flour",
            "30g/1¼oz cocoa powder",
            "½ tsp baking powder",
            "18 marshmallows"
        ],
        "To serve": [
            "Cocoa powder",
            "Icing sugar"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper.",
        "Melt the butter and chocolate in a bowl set over a pan of simmering water. (Do not let the base of the bowl touch the water.)",
        "Whisk the sugar, eggs and vanilla together in a separate bowl then fold in the chocolate mixture.",
        "Sift the flour, cocoa and baking powder together, then fold into the chocolate and egg mixture.",
        "Place tablespoonfuls of the mixture onto the baking tray (the mixture should make 36 biscuits) and bake in the oven for 6-8 minutes.",
        "Remove from the oven and set aside half of the biscuits on a cooling rack. Turn the remaining biscuits over and place a marshmallow on top of each. Return to the oven for 2-3 minutes, or until the marshmallows have softened.",
        "Remove from the oven and set aside on a cooling rack to cool slightly. Press the cooled biscuits on top.",
        "Optional: Melt 100g/3½oz extra chocolate and pour this over the cookies, then set aside to cool."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}