{
    "title": "Chocolate mousse",
    "cookTime": "less than 10 mins",
    "prepTime": "1-2 hours",
    "serves": "Serves 8",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "",
    "author": {
        "sophie_dahl": "Sophie Dahl"
    },
    "show": {
        "b00701fw": "A Taste of My Life"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "250g/8oz good quality dark chocolate, minimum 70% cocoa solids",
            "4 tbsp water",
            "30ml/1fl oz rum or orange or coffee liqueur",
            "25g/1oz butter, cut into small pieces",
            "4 free-range eggs, separated",
            "90ml/3½fl oz double cream",
            "¼ tsp cream of tartar",
            "40g/1½oz caster sugar",
            "grated chocolate, to decorate"
        ]
    },
    "steps": [
        "Melt the chocolate with the water in a bowl set over a pan of simmering water, stirring occasionally, taking care not to allow the bowl to touch the water. Heat, stirring, until the all the chocolate is melted.",
        "Remove the pan from the heat and whisk in the rum or liqueur together with the butter pieces, until smooth and creamy.",
        "In a separate bowl, whisk the egg yolks until thick and creamy and then beat into the melted chocolate.",
        "In a separate bowl, whip the double cream until the whisk leaves a trail on the surface of the cream when the whisk is lifted up. Stir a spoonful of the whipped cream into the chocolate mixture, then fold the chocolate mixture back into the remaining cream.",
        "In a separate bowl, whisk the egg whites until frothy, add the cream of tartar and whisk until soft peaks form when the whisk is removed from the bowl. Be careful not to over-whisk the egg whites.",
        "Fold a quarter of the egg whites gently into the chocolate mixture with a metal spoon, then gently fold in the remaining egg whites.",
        "Pour the mixture into a large glass bowl, or into eight individual serving bowls and chill in the fridge for one hour, or until set.",
        "Dust the chocolate mousse with grated chocolate and serve."
    ],
    "howTos": [
        "folding",
        "melting_chocolate",
        "whipping_cream"
    ],
    "videos": "[]"
}