{
    "title": "Chocolate meringue",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "antony_worrall_thompson": "Antony Worrall Thompson"
    },
    "show": {
        "p0077hxk": "Saturday Brunch"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the chocolate meringue base": [
            "6 egg whites",
            "½ tsp vanilla extract",
            "¼ tsp cream of tartar",
            "1 tbsp white wine vinegar",
            "300g/10½oz caster sugar",
            "60g/2¼oz white chocolate, finely chopped"
        ],
        "For the topping": [
            "500ml/17½fl oz double cream",
            "500g/1lb 1oz strawberries",
            "2-3 tbsp coarsely grated white chocolate"
        ]
    },
    "steps": [
        "Preheat the oven to 140C/275F/Gas 1 and line a baking tray with baking parchment.",
        "Beat the egg whites with the vanilla extract, cream of tartar and the white wine vinegar until they form stiff peaks and then beat in the sugar, a spoonful at a time, until the meringue is stiff and shiny.",
        "Add the finely chopped white chocolate then gently fold everything in until all the ingredients are thoroughly combined.",
        "Put the mixture onto a baking sheet in a fat circle approximately 23cm/10in in diameter, smoothing the sides and the top. Place in the oven and cook for about one and a half to two hours. When it's ready it should look crisp around the edges and on the sides and be dry on top. Press the top gently and you should feel the meringue give slightly.",
        "Turn off the oven and open the door slightly, and let the chocolate meringue disc cool completely.",
        "When you're ready to serve, put the meringue onto a large, flat-bottomed plate. Whisk the cream until thick and pile it on top of the meringue, then scatter over the strawberries. Coarsely grate the chocolate over the top, and serve."
    ],
    "howTos": [
        "folding"
    ],
    "videos": "[]"
}