{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This roulade was inspired by the nostalgic flavour of after-dinner mints. Bitter dark chocolate and a cool peppermint fondant centre.",
    "dishes": [
        "chips",
        "icing",
        "oven-baked_dishes",
        "pie",
        "stir-fries",
        "swiss_roll"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "folding",
        "how_to_make_a_swiss_roll_cake",
        "melting_chocolate",
        "whisking_egg_whites"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/chocolate_and_peppermint_25149_16x9.jpg"
    ],
    "ingredients": {
        "For the filling": [
            "325g/11½oz icing sugar, sifted",
            "100g/3½oz butter, softened",
            "2 tbsp milk",
            "3-4 drops peppermint flavour oil",
            "2 tbsp dark chocolate chips"
        ],
        "default": [
            "125g/4½oz dark chocolate",
            "4 free-range eggs, separated",
            "125g/4½oz caster sugar, plus extra for dusting",
            "2 tbsp cocoa powder, sifted"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "7",
    "serves": "Serves 8",
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "steps": [
        "Line a 24x35cm/9½x14in Swiss roll tin with greaseproof paper and preheat the oven to 180C/350F/Gas 4.",
        "Melt the chocolate in a heat-proof bowl set over a pan of simmering water.",
        "Whisk the egg yolks with the sugar in a bowl. Add the cocoa powder, stir to combine until the mixture has thickened, is pale and increased in volume.",
        "Whisk the egg whites in a separate bowl until stiff.",
        "Pour the melted chocolate into the egg yolk and sugar mixture. Stir until the chocolate is fully incorporated.",
        "Gently fold in the egg whites.",
        "Pour the mixture into the prepared tin. Tilt the tin so that the mixture spreads into the corners.",
        "Bake for 18-20 minutes, or until firm and springy to touch.",
        "Once cooked, turn the roulade out onto a piece of greaseproof paper dusted with caster sugar.",
        "Gently remove the lining paper and cover with a damp tea towel. Leave to cool completely.",
        "For the filling, gradually add the icing sugar to the softened butter. Beat until all the icing sugar is incorporated. Add the edible peppermint oil to the milk, and then stir into the buttercream.",
        "Spread the filling onto the cooled roulade, leaving a 1.5cm/¾in gap at each edge. Sprinkle over the chocolate chips.",
        "Using the greaseproof paper to help you, roll up the roulade from one of the short ends. Don’t worry if it cracks a little. Transfer onto a serving plate."
    ],
    "tips": [
        "This roulade doesn’t contain any flour; as a result it will crack when rolled. For the best possible flavour choose not only good-quality chocolate, but the best peppermint possible. While extracts are commonly found for sale, a good-quality peppermint oil will give the best results, however check on the label that it is an edible one."
    ],
    "title": "Chocolate and peppermint roulade",
    "videos": "[]"
}