{
    "title": "Chocolate yuzu miso",
    "cookTime": "10 to 30 mins",
    "prepTime": "over 2 hours",
    "serves": "Serves 16-20",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Yuzu and miso add a savoury twist to a chocolate dessert.",
    "author": {
        "sat_bains": "Sat Bains"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the aerated chocolate": [
            "500g/1lb 2oz good quality milk chocolate (minimum 40% cocoa solids)",
            "2 tbsp sunflower oil"
        ],
        "For the yuzu purée": [
            "125ml/4fl oz yuzu juice",
            "150ml/5fl oz sugar syrup",
            "5½g agar-agar",
            "salt, for seasoning",
            "citric acid, for seasoning"
        ],
        "For the miso salt": [
            "10g/¼oz dried miso powder",
            "20g/¾oz sea salt flakes"
        ]
    },
    "steps": [
        "For the aerated chocolate, melt the chocolate with the sunflower oil and leave to infuse for 1 hour.",
        "Strain into an espuma gun and charge with 2 bulbs.",
        "Spray 100g/3½oz into a plastic container and place into a vacuum pack machine. Then place in a sous-vide machine and turn off when the chocolate reaches the top of the container.",
        "Leave in the fridge for at least 2 hours. Remove from container and cut into 4 portions.",
        "For the yuzu purée, mix the yuzu juice, sugar syrup and agar-agar together. Place in a pan and bring up to the boil. Pour into a container and leave to set.",
        "Once set, transfer to a blender and blend until smooth. Strain and if needed, season with a little salt and citric acid.",
        "For the miso salt, gently coat the salt in the miso powder and store in an airtight container until needed.",
        "To serve, pipe 5 dots of the yuzu purée across each portion of the aerated chocolate and dust with 4 to 5 grains of the miso salt."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}