{
    "author": {
        
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A classic bread and butter pudding is given a chocolatey twist. It’s still really easy to make and even better when made a day or two in advance.",
    "dishes": [
        "bread",
        "bread_and_butter_pudding",
        "brioche",
        "crumble",
        "custard",
        "oven-baked_dishes",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1 brioche loaf, crusts removed and reserved, remainder sliced into cubes",
            "50g/2oz chopped hazelnuts",
            "200g/7oz chocolate and hazelnut spread",
            "2 bananas, sliced",
            "125g/4oz good quality dark chocolate, roughly chopped",
            "400ml/14fl oz whole milk",
            "400ml/14floz whipping cream",
            "7 free-range eggs",
            "75g/3oz sugar",
            "butter, for greasing"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "5",
    "serves": "Serves 10-12",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Grease a large baking dish with butter.",
        "Bake the reserved brioche crusts in the oven until golden-brown. Remove the crusts from the oven and crumble into breadcrumbs. Mix the breadcrumbs and chopped nuts together in a bowl. Set aside.",
        "Use 50g/2oz of the chocolate and hazelnut spread to spread the reserved brioche cubes and place them into the baking dish.",
        "Add the banana slices and chocolate and mix until well combined.",
        "Heat the remaining chocolate and hazelnut spread, milk and cream in a saucepan, stirring continuously until well combined.",
        "Meanwhile, whisk the eggs and sugar together in a large bowl. Whisk in the cream mixture until well combined.",
        "Pour the chocolate custard over the bread mixture and set aside for 30 minutes, pressing the bread into the custard occasionally.",
        "Bake the pudding in the oven for 10 minutes, then sprinkle over the breadcrumb mixture and bake for a further 25 minutes, or until golden-brown and the custard has just set.",
        "Remove the pudding from the oven and set aside to stand for at least 10 minutes."
    ],
    "tips": [
        "Try making this pudding ahead as it’s best served warm, rather than straight from the oven."
    ],
    "title": "Chocolate, hazelnut and banana bread and butter pudding",
    "videos": "[]"
}