{
    "title": "Chocolate and mandarin pudding",
    "cookTime": "no cooking required",
    "prepTime": "1-2 hours",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This easy, no-cook take on a tiramisu can be made ahead of time and tastes great. Try making it with the kids.",
    "author": {
        "kate_morris_and_sally_brown": "Kate Morris and Sally Brown"
    },
    "show": {
        "b00w1ddl": "I Can Cook"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "2 heaped tsp instant hot chocolate powder, plus extra to serve",
            "8-10 sponge fingers",
            "16 mandarin segments (tinned or fresh), plus extra to serve",
            "75g/3oz cream cheese",
            "125g/4½oz plain yoghurt",
            "½ tsp vanilla extract"
        ]
    },
    "steps": [
        "In a bowl, mix the two teaspoons of hot chocolate powder with 50ml/2fl oz boiled warm water until smooth.",
        "Arrange half of the sponge fingers in a layer at the bottom of a small trifle bowl. Drizzle over half of the drinking chocolate mixture to soak the sponge fingers.",
        "Arrange eight of the mandarin segments on top of the sponge fingers.",
        "Whisk the cream cheese in a mixing bowl until smooth and loose. Whisk in the yoghurt and vanilla extract until well combined.",
        "Spoon half of the cream-cheese mixture into the trifle dish and smooth with a palette knife.",
        "Repeat the layering process once more with the remaining sponge fingers, drinking chocolate mixture, mandarin segments and cream cheese mixture. Dust the top with a little extra hot chocolate powder.",
        "Cover the trifle dish with cling film and chill in the fridge for about one hour.",
        "To serve, spoon the trifle onto serving plates and garnish with a few extra mandarin segments."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}