{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "no cooking required",
    "description": "Marrons glacé are chestnuts preserved in sweet syrup - a classic combination with dark chocolate.",
    "dishes": [
        "cake",
        "chocolate_tart",
        "icing",
        "jam",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "250g/9oz marrons glacés",
            "75ml/2½fl oz dark rum",
            "50g/2oz caster sugar",
            "400g/14oz ready-made chocolate cake",
            "375g/13oz dark chocolate, melted",
            "200g/8oz sweetened chestnut purée",
            "560ml/20½fl oz double cream",
            "5 tbsp icing sugar"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "",
    "serves": "Serves 8",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Roughly chop two thirds of the marrons glacés.",
        "Place the rum and caster sugar into a saucepan over a medium heat. Bring to a simmer, then cook until the sugar is melted. Remove from the heat and add the chopped marrons glacés. Stir well and allow the rum syrup to cool.",
        "Take a 2.5cm/1in thick slice of the chocolate cake and place it into the bottom of a 25cm/10in round tart case. Repeat to cover the base of the tin.",
        "Pour the soaked marrons glacés and rum evenly over the chocolate cake.",
        "Pour the melted chocolate into a bowl. Add the sweetened chestnut purée and whisk to combine.",
        "Pour the cream into the chestnut and chocolate mixture and whisk to combine.",
        "Pour the chocolate and cream mixture over the marrons glacés and cake and smooth over. Transfer to the fridge to chill for at least two hours, preferably overnight.",
        "To serve, remove the tart from the tin. Dust with icing sugar and decorate with the remaining whole marrons glacés."
    ],
    "tips": [
        
    ],
    "title": "Chocolate and marrons glacés tart",
    "videos": "[]"
}