{
    "title": "Ciabatta",
    "cookTime": "10 to 30 mins",
    "prepTime": "overnight",
    "serves": "3 loaves",
    "recommendations": "54",
    "images": [
        
    ],
    "description": "Expert baker Paul Hollywood is on hand to help you make the perfect homemade Italian bread.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "Ovenight preparation": [
            "250g/9oz Italian type '00' bread flour",
            "190ml/7fl oz water",
            "15g/½oz yeast"
        ],
        "To finish the bread": [
            "250g/9oz Italian type '00' bread flour",
            "10g/¼oz yeast",
            "190ml/7fl oz water",
            "12g/½oz salt"
        ]
    },
    "steps": [
        "For the overnight preparation, mix the flour with the water in a large bowl and add the yeast. Whisk for three minutes and leave to rise overnight (or at least eight hours).",
        "To finish the bread, add the remaining flour and yeast to the bread mixture and mix well.",
        "Gradually add the rest of the water to the bread mixture. When nearly all of the water has been added, add the salt to the remaining water and mix together for a further five minutes, until a sticky dough is formed.",
        "Transfer the dough into a large oiled bowl and leave to rise for one hour.",
        "Transfer the dough to a heavily floured work surface and leave to rest for a further 30 minutes.",
        "Preheat the oven to 240C/465F/Gas 8.",
        "Cut the dough into three strips and stretch them out to make long, flat ciabatta loaf shapes.",
        "Place onto a baking sheet lined with baking paper and leave for ten minutes.",
        "Transfer the dough to the oven to bake for 25 minutes, or until risen and golden-brown.",
        "Remove from the oven and transfer to a wire rack to cool."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}