{
    "title": "Cinder toffee",
    "cookTime": "10 to 30 mins",
    "prepTime": "over 2 hours",
    "serves": "Makes About 30 lumps of toffee",
    "recommendations": "4",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/cinder_toffee_33877_16x9.jpg"
    ],
    "description": "Whether it’s ‘cinder toffee’, ‘honeycomb’, ‘puff candy’ or ‘sea foam’, whatever you call it, this toffee is by far the most dramatic to make. Take care as it bubbles up like a volcano to the top of your pan while being heated.",
    "author": {
        "kitty_hope_and_mark_greenwood": "Kitty Hope and Mark Greenwood"
    },
    "show": {
        "b04d9lns": "Sweets Made Simple"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "vegetable oil, for greasing",
            "75g/2½oz granulated sugar",
            "100g/4oz liquid glucose",
            "25g/1oz of golden syrup",
            "15g/½oz bicarbonate of soda"
        ]
    },
    "steps": [
        "Use the oil to grease a 23cm/9in square baking tin that’s 4cm/1½in deep. Line it with baking parchment, then grease again with a little oil.",
        "Place the sugar, liquid glucose, golden syrup and a tablespoon of water into a deep, heavy-bottomed pan. (Make sure the pan is very deep as the mixture will bubble up later.) Heat gently to dissolve the sugar, then increase the heat very slightly, until the mixture has turned into a syrup.",
        "Watch the pan very carefully from this point on, boiling it steadily at a fairly low heat, until the mixture turns amber. It should be the colour of marmalade. This will take approximately 15 minutes.",
        "Turn the heat off and get a balloon whisk to hand. Add the bicarbonate of soda and whisk it all together. It will bubble up right to the top of the pan, so take care not to burn yourself as the caramel will be very hot.",
        "Immediately pour the toffee into the prepared tin and leave to cool completely (about two hours).",
        "When cold, prise the toffee out of the tin using a flat knife and break it up into chunks. If it is difficult to release from the tin, hit it with a hammer."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}