{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "James Martin pairs a classic crêpes Suzette with sticky orange sauce and a creamy citrus syllabub.",
    "dishes": [
        "caramel",
        "crepe",
        "icing",
        "jam",
        "pancake",
        "sauce",
        "stir-fries",
        "syllabub"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the crêpes": [
            "125g/4½oz plain flour",
            "1 free-range egg",
            "300ml/10½fl oz milk",
            "25g/1oz butter"
        ],
        "For the sauce": [
            "75g/2¾oz caster sugar",
            "50ml/2fl oz brandy",
            "4 clementines",
            "1 lemon, juice only",
            "25g/1oz unsalted butter"
        ],
        "For the syllabub": [
            "250g/9oz mascarpone",
            "1 heaped tbsp icing sugar, sifted",
            "400ml/14fl oz double cream",
            "2 clementines, 1 juiced, 1 sliced",
            "200g/7oz ready-made orange or passion fruit curd",
            "2 sprigs fresh mint"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b06s5h9c": "Home Comforts at Christmas"
    },
    "steps": [
        "For the syllabub, whisk the mascarpone and icing sugar together in a large bowl until smooth. Gradually pour in the double cream, whisking continuously until the mixture is pale and thick.",
        "Fold in the clementine juice and orange or passion fruit curd to create a ripple effect.",
        "Spoon the syllabub mixture into a piping bag and pipe it into glass serving dishes. Top each with a slice of clementine and a sprig of mint. Chill in the fridge until ready to serve – the syllabubs will keep in the fridge for 3-4 days, covered.",
        "For the crêpes, whisk the flour and egg together in a large bowl. Gradually add the milk to form a smooth batter with the consistency of double cream.",
        "Heat a little of the butter in a frying pan over a medium heat. Add a ladleful of the crêpe batter to the pan and swirl to coat the bottom evenly. Fry for 1-2 minutes, then flip the pancake and cook for a further minute, or until golden-brown on both sides. Remove the crêpe from the pan and place on a sheet of greaseproof paper. Keep warm.",
        "Repeat the process with the remaining butter and crêpe batter, stacking the crêpes between layers of greaseproof paper.",
        "For the sauce, heat the sugar in a frying pan over a medium heat until the sugar melts and caramelises. Add the brandy and set alight with a match. Allow the flames to flare up and die down. (Caution: Keep the flames away from your eyes and face and make sure the extractor fan is not turned on). Stir in the juice from 2 of the clementines, the lemon juice, and the zest from 1 clementine, then segment the last 2 clementines and add them to the pan. Finally, stir in the butter until it has melted and the sauce has thickened.",
        "To serve, fold the crêpes into quarters and arrange on serving plates. Spoon over the warm orange sauce. Serve the syllabub alongside."
    ],
    "tips": [
        "The crêpes can be frozen or chilled once cooked. Freeze them between sheets of greaseproof paper and defrost as needed. The caramel orange sauce will solidify when cooled but can be reheated."
    ],
    "title": "Clementine syllabub and crêpes Suzette",
    "videos": "[p03b25fp:p03b25fv]"
}