{
    "title": "Coconut pancakes with mango and passion fruit curd",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "This tropical pancake recipe makes a great alternative to the classic combo of lemon and sugar for Pancake Day.",
    "author": {
        "michel_roux_jr": "Michel Roux Jr."
    },
    "show": {
        "b03mzc66": "Food & Drink"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the pancakes": [
            "125g/4½ plain flour",
            "15g/½oz caster sugar",
            "pinch of salt",
            "4 medium free-range eggs",
            "350ml/12fl oz full-fat milk",
            "2 tbsp desiccated coconut, toasted",
            "butter, for frying"
        ],
        "For the curd": [
            "8 large free-range egg yolks",
            "120g/4½oz caster sugar",
            "160ml/5½fl oz mango juice",
            "110ml/3½fl oz passion fruit juice",
            "250g/9oz unsalted butter"
        ],
        "To serve": [
            "fresh pineapple, thinly sliced",
            "fresh mint, leaves picked",
            "dusting of icing sugar"
        ]
    },
    "steps": [
        "For the pancakes, combine the flour, sugar and salt together, then mix in the eggs with a whisk. Add the milk gradually to avoid any lumps, then stir in the toasted coconut. Leave to rest while you make the curd.",
        "To make the curd, whisk the eggs, sugar, mango and passion fruit juices together in a saucepan. Place over a medium heat and stir continuously until the mixture thickens - do not boil. Whisk in the butter, cut into small pieces. Cover and leave to cool.",
        "To cook the pancakes, add a smear of melted butter to a non-stick pan and ladle in some batter, swirling around to coat the pan - it might take one or two test pancakes before you’ve got the amount of batter just right. Cook each pancake on both sides until golden-brown and then remove to a plate while you cook the next pancake.",
        "To assemble, spread each pancake with the fruit curd and then roll up into cigars. Serve with fresh pineapple, mint leaves and a dusting of icing sugar."
    ],
    "howTos": [
        
    ],
    "videos": "[p022v1yy:p022v1z7]"
}