{
    "author": {
        "antony_worrall_thompson": "Antony Worrall Thompson"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Thai_and_South-East_Asian",
    "description": "",
    "dishes": [
        "pie",
        "sauce",
        "stew",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "4 dried hot red chillies (¾-1¼cm/2-3in), seeded and cut in pieces and soaked in warm water for 10 minutes, drained",
            "6 spring onions, roughly chopped",
            "2 tsp chopped garlic",
            "2 stalks lemongrass, outer leaves discarded, chopped (lemon juice could be used instead)",
            "1½ tbsp peanut oil, extra if required",
            "2 tsp ground coriander",
            "½ tsp ground turmeric",
            "1 tsp paprika",
            "290ml/½ pint of canned unsweetened coconut milk, well stirred",
            "150ml/¼ pint hot vegetable stock or water",
            "750g/1½lb butternut squash, peeled, seeded and cut into 5cm/2in chunks",
            "2 green cardamom pods, crushed",
            "1 cinnamon stick",
            "1 red pepper, seeded and julienned",
            "salt to taste",
            "1½ tbsp soy sauce",
            "1½ tsp light brown sugar",
            "1½ tsp lemon juice",
            "2 tbsp fresh coriander leaves"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "9",
    "serves": "Serves 4-6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Grind the chillies, spring onions, garlic and lemongrass to a paste in a processor, adding a little oil if necessary. Heat 1½ tbsp oil in a heavy saucepan over a medium-low heat. Add the chilli paste and cook, stirring until it is fragrant and no longer tastes raw.",
        "Add the coriander, turmeric, and paprika and stir for 1 minute. Add the coconut milk and simmer, stirring for 5 minutes.",
        "Stir in the stock and bring to a simmer.",
        "Reduce the heat to low and add the butternut squash, red pepper, cardamom, cinnamon stick and salt to taste. Simmer, partially covered until the butternut squash is tender and the sauce is reduced, about 20-25 minutes.",
        "Stir in the soy sauce, sugar and lemon juice and simmer for another 2 minutes. Serve garnished with coriander leaves.",
        "This is quite a wet stew. It can be thickened with cornflour paste if required. Serve with plain rice."
    ],
    "tips": [
        
    ],
    "title": "Coconut butternut squash stew",
    "videos": "[]"
}