{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "French",
    "description": "Éclairs are easier to make than you might think - irresistable with this coffee filling and chocolate icing.",
    "dishes": [
        "icing",
        "jam",
        "oven-baked_dishes",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "making_choux_pastry"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the icing": [
            "230g/8oz fondant icing sugar",
            "2 tbsp espresso, cooled"
        ],
        "For the éclairs": [
            "50g/1¾oz unsalted butter",
            "75g/2¾oz plain flour",
            "2 medium free-range eggs"
        ],
        "To finish": [
            "75g/2½oz desiccated coconut",
            "425ml/15fl oz double cream",
            "1 tbsp icing sugar, sifted",
            "½ tsp vanilla extract",
            "4 passion fruit, seeds only"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven 200C/400F/Gas 6. Line a baking tray with non-stick baking parchment.",
        "For the éclairs, place 125ml/4fl oz water and the butter into a saucepan and gently melt the butter. Bring to a rolling boil for a minute.",
        "Remove from the heat and add the flour all at once, beating well until the mixture is smooth and comes away from the sides of the pan.",
        "Return to the heat for a minute or two to cook through.",
        "Remove from the heat again and add the eggs, one at a time - beating well between the addition of each egg - until smooth and glossy.",
        "Spoon the dough into a piping bag and pipe 5cm/2in long éclairs onto the lined baking tray and bake for 20 minutes, or until golden-brown. Remove from the oven and set aside to cool on a wire rack.",
        "Once cooled, make a hole in one end of the éclair.",
        "For the icing, mix half the icing sugar with the coffee in a small bowl. The mixture should have a spreadable consistency, so add more icing sugar if necessary.",
        "In another bowl, place the remaining fondant icing with two tablespoons of water and mix until combined.",
        "To finish, heat a small frying pan and toast the coconut until golden brown.",
        "Whip the cream with the icing sugar and vanilla extract until soft peaks form when the whisk is removed.",
        "Transfer the whipped cream into a piping bag fitted with a 1cm/½in plain nozzle and pipe into the éclairs.",
        "Dip half of one side of the éclairs in the coffee icing and the other in the plain icing. Sprinkle with toasted coconut. Serve the coconut éclairs with the passion fruit seeds."
    ],
    "tips": [
        
    ],
    "title": "Coffee éclairs",
    "videos": "[]"
}