{
    "title": "Coronation chicken",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "40",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/coronation_chicken_30402_16x9.jpg"
    ],
    "description": "Step back into 1952 and showcase the classic chicken salad for a delicious lunch of Coronation nostalgia.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "2 free range chicken breasts, skin removed",
            "1 tbsp olive oil",
            "1 lemon, juice and zest",
            "sea salt and freshly ground black pepper",
            "knob of butter",
            "1 shallot, finely chopped",
            "1 red chilli, deseeded and finely chopped",
            "2 teaspoons madras curry powder",
            "2 tbsp tomato purée",
            "100ml/3½fl oz dry white wine",
            "100ml/3½fl oz chicken stock",
            "1 tbsp apricot jam",
            "150ml/5fl oz mayonnaise",
            "75ml/3fl oz crème fraîche",
            "1 large mango, peeled, stone removed, flesh diced",
            "4 spring onions, finely chopped",
            "2 tbsp chopped fresh coriander",
            "dash Tabasco sauce",
            "50g/2oz flaked almonds (toasted lightly dry frying pan)",
            "green salad leaves, to serve"
        ]
    },
    "steps": [
        "Rub the olive oil all over the chicken. Scatter over the lemon zest and season with the salt and black pepper.",
        "Steam the chicken for 20-25 minutes, or until cooked through, then set aside to cool.",
        "Melt the butter in a frying pan, add the shallot and chilli and fry for five minutes. Stir in the curry powder and cook for 2-3 minutes. Stir in the tomato purée and cook for a further minute. Add the wine and continue to cook until the volume of the liquid has reduced by half.",
        "Stir in the jam and stock, continue to simmer until the volume of the liquid has reduced by half. Set aside to cool.",
        "Mix the mayonnaise and the crème fraiche in a bowl until well combined, then stir in the curry dressing. Fold in the mango, spring onions, lemon juice and coriander.",
        "Cut the chicken into bite-sized pieces. Fold this into the mayonnaise mixture. Season with salt, freshly ground black pepper and Tabasco to taste. Serve with a green salad, and dress with the toasted almond flakes."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}