{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Japanese",
    "description": "Try this simple to prepare salad of white crabmeat served with cucumber, seaweed and spicy mayonnaise.",
    "dishes": [
        "mayonnaise",
        "prepare-ahead_desserts",
        "salad",
        "sauce",
        "seafood"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the wakame dressing": [
            "½ tsp dashi granules",
            "40ml/1½fl oz warm water",
            "8ml rice wine vinegar",
            "½ tsp white sugar",
            "1 tsp dark soy sauce"
        ],
        "For the wasabi mayonnaise": [
            "2 free-range egg yolks",
            "2 tsp white wine vinegar",
            "2 tsp wasabi powder",
            "300ml/10fl oz rapeseed oil",
            "½ tsp salt"
        ],
        "default": [
            "40g/1½oz dried wakame seaweed",
            "½ cucumber, peeled",
            "225g/8oz fresh white crabmeat",
            "1 tbsp bonito flakes"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "steps": [
        "Refresh the wakame seaweed in a bowl of boiling water for five minutes, then drain well and slice if necessary.",
        "Cut the cucumber in half lengthways and scoop out the seeds with a teaspoon. Cut across into thin slices.",
        "For the wakame dressing, in a bowl dissolve the dashi granules in the warm water and mix with the rest of the dressing ingredients. Add the wakame seaweed and the cucumber and mix together well with the dressing. Set aside in the fridge to chill.",
        "To make the mayonnaise, mix the egg yolks, white wine vinegar and wasabi powder together in a bowl. Using a wire whisk gradually beat in the oil a few drops at a time, until you have incorporated it all and have achieved a mayonnaise-like texture. Season to taste with salt.",
        "To serve, divide the crabmeat equally between four small ramekins and gently press down. (Or serve piled up.) Turn the crabmeat out onto four plates and spoon a tablespoon of the wasabi mayonnaise alongside. Take a large handful of the cucumber and wakame seaweed and place next to the crabmeat, sprinkle the bonito flakes on top of the seaweed, and serve."
    ],
    "tips": [
        
    ],
    "title": "Crab with wakame salad and wasabi mayonnaise",
    "videos": "[]"
}