{
    "author": {
        "michael_caines": "Michael Caines"
    },
    "cookTime": "10 to 30 mins",
    "description": "This pasta recipe may be a little fiddly, but the delicate flavours make it well worth the effort.",
    "dishes": [
        "mousse",
        "pasta",
        "pastry",
        "ravioli",
        "sauce",
        "stir-fries",
        "stock",
        "torte",
        "tortellini"
    ],
    "flags": [
        
    ],
    "howTos": [
        "rolling_pasta_dough"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the basil oil": [
            "10g/¼oz fresh basil",
            "100ml/3½fl oz olive oil"
        ],
        "For the basil purée": [
            "500g/1lb 2oz basil leaves",
            "salt and freshly ground black pepper"
        ],
        "For the crab ravioli mousse": [
            "40g/1½oz scallops",
            "1 free-range egg yolk",
            "25ml/1fl oz double cream",
            "40g/1½oz brown crab meat",
            "1 tsp finely chopped ginger, blanched three times",
            "125g/4½oz white crab meat",
            "cayenne pepper",
            "lemon juice, to taste",
            "salt and freshly ground black pepper",
            "1 pink grapefruit, peeled, cut into segments",
            "2 tbsp basil cress"
        ],
        "For the lemongrass and ginger sauce": [
            "75g/3oz unsalted butter",
            "75g/3oz shallots",
            "25g/1oz fresh ginger",
            "50g/2oz fresh lemongrass",
            "5g/⅛oz white peppercorns",
            "5g/⅛oz coriander seeds",
            "75g/3oz brown crab meat",
            "250g/9oz crab carcasses (available from fishmongers)",
            "250ml/9fl oz fish stock",
            "300g/11oz unsalted butter",
            "½ tsp salt",
            "pinch ground white pepper",
            "1 tsp lemon juice"
        ],
        "For the pasta": [
            "20g/¾oz basil purée (see above)",
            "20g/¾oz basil oil (see above)",
            "3 free-range egg yolks",
            "1 free-range egg",
            "250g/9oz plain flour",
            "1 tsp salt",
            "2 tsp water"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the crab ravioli mousse, place the scallops, egg yolk, cream and brown crab meat into a food processor and mix until smooth.",
        "Remove the mixture from the food processor and spoon into a bowl suspended over ice.",
        "Stir in the ginger and white crabmeat. Season with salt, freshly ground black pepper and a pinch of cayenne pepper. Add a few drops of lemon juice.",
        "For the basil oil, heat the oil to 80C/175F (use a thermometer to check this) and add the basil. Infuse for a few minutes and then blend in a food processor until smooth. Pass the mixture through a fine sieve and set aside",
        "For the basil purée, bring a pan of lightly salted water to the boil, add the basil leaves and cook for 1-2 minutes, or until soft and tender. Drain and refresh in iced water.",
        "Pat the basil dry on kitchen paper, blend in a food processor until smooth and pass the mixture through a fine sieve.",
        "For the ravioli pasta, place the basil purée, basil oil, egg, egg yolk, flour and salt into a food processor. Switch on the processor and slowly add the water until well combined. Remove the dough from the food processor, knead briefly until smooth, then wrap in clingfilm and chill in the fridge for 30 minutes.",
        "For the sauce, heat a heavy-based saucepan until medium hot, add the butter, shallots, ginger and lemongrass and fry for five minutes.",
        "Stir in the peppercorns and coriander seeds and fry for another two minutes.",
        "Add the brown crabmeat and crab carcasses and fry for five minutes",
        "Pour in the fish stock and bring to the boil then simmer for 20 minutes. Pass the mixture through a fine sieve into a clean saucepan.",
        "To finish the sauce, add the butter, salt, freshly ground black pepper and lemon juice. Whisk until well combined.",
        "Split the crab mousse into four equal portions.",
        "Roll the pasta out thinly using a pasta machine or rolling pin. Using a pastry cutter, cut the dough into 10cm/4in circles.",
        "Place a spoonful of crab mixture onto a pasta circle, fold the top over to form a semi-circle, press down lightly to seal then wrap the edges of the semi-cirlce around your index finger and join together.",
        "Bring a saucepan of salted water to the boil, add the pasta and simmer for 4-5 minutes. Drain.",
        "To serve, place the tortellini into serving bowls, pour over the sauce and scatter with pink grapefruit and cress. Drizzle with a little basil oil."
    ],
    "tips": [
        
    ],
    "title": "Crab tortellini with lemongrass and ginger sauce",
    "videos": "[]"
}