{
    "title": "Cranachan cheesecake",
    "cookTime": "over 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 8",
    "recommendations": "7",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/cranachan_cheesecake_54836_16x9.jpg"
    ],
    "description": "The classic Scottish dessert, cranachan, is a delicious blend of toasted oatmeal, raspberries, honey and crowdie - a type of soft, mild cheese. I’ve used those ingredients as the inspiration for this gorgeous cheesecake. Make it in summer or early autumn when British raspberries are at their best. If you can’t get hold of any crowdie, ricotta works equally well.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the base": [
            "250g/9oz finely-milled oatcakes",
            "125g/4½oz unsalted butter, melted, plus extra for greasing",
            "3 tbsp honey"
        ],
        "For the filling": [
            "60g/2¼oz pinhead (coarse) oatmeal",
            "100g/3½oz caster sugar",
            "350g/12oz crowdie or ricotta",
            "350g/12oz full-fat cream cheese",
            "4 medium free-range eggs",
            "200g/7oz fresh raspberries"
        ],
        "For the raspberry coulis": [
            "500g/1lb 2oz fresh raspberries",
            "50g/1¾oz icing sugar"
        ]
    },
    "steps": [
        "Butter a deep 23cm/9in springform tin.",
        "To make the base, put the oatcakes in a food processor and process until they are finely ground. Add the melted butter and honey and process again until thoroughly combined. Press this mixture evenly into the base of the tin and put it in the fridge to set (about an hour).",
        "Preheat your oven to 180C/350F/Gas 4.",
        "Heat a small frying pan over a medium heat. Add the oatmeal and one teaspoon of the sugar. Toast them, tossing frequently, until golden. Tip onto a plate to cool.",
        "Put the crowdie or ricotta, cream cheese, eggs and remaining caster sugar in a food processor and blend until smooth. Stir in the cooled, toasted oatmeal. Pour onto the set base and scatter over the raspberries.",
        "Bake for 35-40 minutes or until the cheesecake is set around the edges but still a bit wobbly in the middle. Turn off the oven and leave the cheesecake inside with the door ajar until the cheesecake is cool. (This will take a few hours but helps prevent the top of cheesecake from cracking.)",
        "Meanwhile, to make the raspberry coulis, purée the raspberries and icing sugar together in a blender, or with a stick blender. Push the purée through a sieve to remove the pips.",
        "Serve the cooled cheesecake with pouring cream and the raspberry coulis."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}