{
    "title": "Cranachan",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "2",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/cranachan_20683_16x9.jpg"
    ],
    "description": "This recipe is based on a traditional Scottish cranachan but with the addition of half-fat crème fraiche to lighten the cream mixture and some flaked almonds for extra crunch.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "tips": [
        "If you don’t want to use the crème fraîche, increase the double cream by 150ml/5fl oz."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "75g/2½fl oz porridge oats",
            "35g/1oz flaked almonds",
            "300ml/10fl oz double cream",
            "150g/5½oz half-fat crème fraîche",
            "½ tsp vanilla extract",
            "3 tbsp whisky",
            "3 tbsp clear honey, plus extra for drizzling",
            "400g/14oz fresh raspberries",
            "2-3 tbsp caster sugar"
        ]
    },
    "steps": [
        "Put the oats and almonds in a large non-stick frying pan and dry-fry over a medium heat for 4-5 minutes, stirring occasionally until light golden-brown. Remove from the heat and leave to cool.",
        "Pour the double cream and crème fraîche into a large bowl and add the vanilla extract, whisky and honey. Whisk with an electric whisk until floppy peaks form. Don’t over-whisk the cream as it will stiffen further when mixed with the oats.",
        "Put half of the raspberries into a sieve over a clean bowl and press with a ladle to make a vibrant pink purée. Discard the seeds. Sweeten the purée with the sugar to taste.",
        "Set six tall glasses or tumblers on a tray. Put a spoonful of the whipped cream and whisky mixture in the base of each glass. Sprinkle half of the oats and almonds and half the whole raspberries on top.",
        "Drizzle over half of the raspberry purée. Repeat the layers once more. Keep the layers as loose as possible. You can assemble all the ingredients well ahead of time but make sure you serve the puddings as soon as they are layered."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}