{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "Nordic",
    "description": "Crayfish makes for a wonderfully flavourful chowder. Taking the time to make your own stock makes it extra special.",
    "dishes": [
        "bun",
        "caramel",
        "chowder",
        "sauce",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chowder": [
            "30g/1oz butter",
            "1 onion, finely chopped",
            "750g/1lb 10oz potatoes, cut into 2cm/¾in cubes",
            "4 leeks, washed, sliced into rounds",
            "dill leaves",
            "salt and freshly ground black pepper"
        ],
        "For the stock": [
            "1 tbsp olive oil",
            "1 onion, sliced",
            "1 carrot, diced",
            "1 celery stick, diced",
            "2kg/4lb 8oz crayfish (around 20 medium crayfish), shelled, tail meat reserved for soup",
            "250ml/9fl oz white wine",
            "2 bay leaves",
            "bunch of dill, stems only",
            "few sprigs parsley",
            "3 garlic cloves, peeled, left whole",
            "½ lemon, zest only",
            "1 tsp black peppercorns",
            "1 star anise"
        ],
        "To serve": [
            "4 tsp crème fraîche"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b069hr3q": "The Hairy Bikers' Northern Exposure"
    },
    "steps": [
        "First make the stock. Put the olive oil in a large, heavy-based saucepan. Add the vegetables and sauté briskly until starting to caramelise. Add the crayfish shells and stir until any liquid evaporates off and they turn a deep red.",
        "Pour over the white wine and leave to bubble for a couple of minutes. Pour in 1½ litres/2½ pints water and the remaining stock ingredients. Bring to the boil then turn the heat down and simmer for 40 minutes. Strain and set aside.",
        "For the chowder, melt half of the butter in a large saucepan. Add the onion and sauté until translucent. Add the potatoes and leeks and stir to mix. Add the stock and season with salt and pepper.",
        "Bring to the boil, turn down the heat and simmer, uncovered, for about 15 minutes. At this point the vegetables should be tender. Stir in the dill leaves.",
        "Melt the remaining butter in a frying pan. Season the reserved crayfish tails with salt and pepper and add to the pan. Fry for a couple of minutes and add to the chowder. Divide the chowder between 4 bowls and top with a teaspoon of crème fraîche, serve immediatedly."
    ],
    "tips": [
        
    ],
    "title": "Crayfish chowder",
    "videos": "[p0344xpt:p0344xq5]"
}