{
    "author": {
        "bryn_williams": "Bryn Williams"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "",
    "dishes": [
        "biscuit",
        "caramel",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "caramelising_sugar"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the biscuits": [
            "25g/1oz butter",
            "25g/1oz sugar",
            "2 tbsp liquid glucose or golden syrup",
            "65g/2½oz almonds, skins removed, chopped"
        ],
        "For the crème brûlée": [
            "75ml/2½fl whole milk",
            "250ml/9fl oz double cream",
            "1 vanilla pod, split and seeds removed",
            "4 free-range egg yolks",
            "50g/2oz caster sugar, plus extra for topping"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 120C/250F/Gas ¼.",
        "Place the milk, double cream, vanilla seeds and pod into a pan. Bring to the boil.",
        "In a large bowl whisk the egg yolks and sugar together until thoroughly combined, then stir in the milk.",
        "Strain the mixture through a sieve and divide among four ovenproof ramekins. Place the ramekins into a roasting tray and fill the tray with water until it comes halfway up the sides of the ramekins. Place the tray into the oven and cook for 30-40 minutes, or until the mixture is just firm to the touch. Once cooked, remove from the oven and allow to cool. Place into the fridge to chill.",
        "For the biscuits, preheat the oven to 160C/325F/Gas 2. Melt the butter in a pan then add the sugar and liquid glucose or golden syrup and bring to the boil. Remove the pan from the heat and stir in the almonds. Pour the mixture onto a tray covered with baking paper and place into the fridge to cool for 2-3 minutes, until the dough is firm and pliable.",
        "Remove the tray from the fridge and mould the almond mixture into approximately 25 marble size shapes. Place onto a clean baking sheet. Leave plenty of space between them for the biscuits to spread. Place the tray into the oven and cook for 4-5 minutes. Leave to cool.",
        "To serve, sprinkle each creme brulee with a sugar to cover and caramelise the top with a mini blowtorch. Alternatively, you can place the ramekins under a hot grill until browned and caramelised. Serve with an almond snap."
    ],
    "tips": [
        
    ],
    "title": "Crème brûlée with almond snap biscuits",
    "videos": "[]"
}