{
    "title": "Crêpes with orange butter sauce",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "1-2 hours",
    "serves": "Serves 4",
    "recommendations": "5",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/crepes_with_orange_97791_16x9.jpg"
    ],
    "description": "Fragrant with orange blossom water, these buttery citrus pancakes make a beautiful dessert.",
    "author": {
        "michel_roux": "Michel Roux"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the crêpes": [
            "125g/4½oz plain flour",
            "15g/½oz caster sugar",
            "pinch salt",
            "2 medium free-range eggs",
            "325ml/11½fl oz milk",
            "50ml/1¾fl oz double cream",
            "few drops orange flower water",
            "20g/¾oz clarified butter"
        ],
        "For the orange butter sauce": [
            "10 oranges, 6 juiced, 4 segmented",
            "100g/3½oz icing sugar",
            "125g/4½oz butter, diced, softened",
            "4 sprigs fresh mint"
        ]
    },
    "steps": [
        "For the crêpes, whisk the flour, sugar, salt, eggs and a third of the milk in a bowl to a smooth batter.",
        "Gradually stir in the rest of the the milk and all of the cream. Leave the batter to rest in a warm place for about an hour.",
        "Just before cooking, stir in the orange flower water.",
        "Brush a small 18cm-20cm/7in-8in frying pan with a little of the clarified butter and place over a medium heat. Add a ladleful of the batter and tilt the pan to cover the base thinly; cook the crêpe for a minute each side.",
        "Transfer the crêpe to a plate and repeat, stacking the crêpes between sheets of greaseproof paper, until all of the batter has been used up.",
        "For the orange butter sauce, strain the orange juice through a sieve into a saucepan and add the icing sugar.",
        "Gradually bring the mixture to the boil and cook until the volume of liquid has reduced by half.",
        "Turn off the heat and whisk in the butter, a little at a time.",
        "To serve, scatter the orange segments over each crêpe and roll up. Spoon over the orange sauce and garnish with a sprig of mint."
    ],
    "howTos": [
        "segmenting_citrus_fruit"
    ],
    "videos": "[]"
}