{
    "title": "Crispy duck salad",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "4",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/crispy_duck_salad_03934_16x9.jpg"
    ],
    "description": "Enjoy fantastic contrasts in this zingy salad - salt, sweet and sour flavours combine with warm duck and chilled fruit.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b04ksltb": "Tom Kerridge's Best Ever Dishes"
    },
    "tips": [
        "Tip: To remove the seeds from the pomegranate, cut the fruit in half. Hold the seeded side against your palm over a large bowl, then bash the skin with a wooden spoon until the seeds fall out."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "4 large duck legs",
            "½ chilled watermelon, skin removed, flesh chopped",
            "1 fresh pomegranate, seeds only",
            "½ bunch fresh mint, leaves picked and roughly torn",
            "large bunch coriander, leaves picked and stalks chopped",
            "1-2 red chillies (to taste)",
            "2 tbsp dark soy sauce",
            "2 tbsp Thai fish sauce",
            "2 limes, juice only",
            "½ tsp ground Sichuan pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 160C/350F/Gas 4.",
        "Place a wire rack on a roasting tin and place the duck legs on top, skin-side up. Roast the duck legs on the rack for 1¾-2 hours, or until the skin is crisp and the meat is cooked through (when the duck is cooked, the juices should run clear when a skewer is inserted into the thickest part of the leg). Set aside to cool for 10-15 minutes, reserving the duck fat on the baking tray.",
        "In a large bowl, mix together the chopped watermelon and pomegranate seeds. Stir in the mint leaves and coriander and the sliced chillies, to taste.",
        "When the duck legs have cooled, flake the meat from the bone and add it to the watermelon and pomegranate mixture. Add the soy sauce, fish sauce, lime juice and a little of the reserved duck fat, to taste, if desired. Season with Sichuan pepper and gently toss.",
        "Serve the salad immediately, while the watermelon is cold and the duck meat still warm."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}