{
    "author": {
        "ed_baines": "Ed Baines"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "This recipe is Ed's twist on the humble fish finger. Homemade fish fingers always go down a treat, whether cooking for adults or children, this one is always a winner.",
    "dishes": [
        "bread",
        "bun",
        "compote",
        "pie",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the tomato, courgette and olive compôte": [
            "4 tomatoes, roughly chopped",
            "225g/8oz courgettes, diced",
            "75ml/3fl oz olive oil",
            "1 small red onion, roughly chopped",
            "1 clove garlic, chopped",
            "30g/1oz mixed pitted olives, roughly chopped",
            "1 anchovy fillet, chopped",
            "½ tbsp white wine vinegar",
            "bunch of basil",
            "1 lime, juice only",
            "salt and pepper"
        ],
        "default": [
            "8oz tuna steak",
            "2 eggs",
            "100ml/3½fl oz milk",
            "225g/8oz flour",
            "110g/4oz breadcrumbs",
            "1 lime, grated zest only",
            "1 tsp dried oregano",
            "pinch of salt",
            "4 tbsp vegetable oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 2",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Heat the olive oil in a pan and add the onion and garlic and cook until soft.",
        "Turn up the heat and add the courgettes and cook for a further 2 minutes.",
        "Reduce the heat and add the tomatoes, olives, anchovy, vinegar, whole basil leaves, lime juice and seasoning.",
        "Stir all the ingredients and reduce the heat to the lowest possible and leave to cook while preparing the fish fingers, stirring occasionally.",
        "In a bowl crack the eggs and whisk in the milk.",
        "In another bowl mix the breadcrumbs, lime zest and oregano.",
        "In another bowl place the flour.",
        "Cut the tuna steaks into fingers",
        "Coat each piece of fish in the flour, then dip into the egg mixture and finally in the breadcrumbs.",
        "In a large frying pan heat the vegetable oil over a moderate heat and place the coated fish fingers in the oil.",
        "Cook until golden brown on both sides and drain.",
        "Serve with a large spoonful of compôte and the fish fingers arranged to one side."
    ],
    "tips": [
        
    ],
    "title": "Crispy tuna fingers with tomato, courgette and olive compôte",
    "videos": "[]"
}