{
    "title": "Crème brûlée with sugared almonds and a rhubarb purée",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Make crème brûlée extra special by serving it inside egg shells - how fun! Serve with sugared almonds and rhubrab purée for a standout dessert that is bound to impress. Equipment: You will need an egg cutter and a chef's blowtorch.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the crème brûlée": [
            "8 large free-range eggs",
            "115g/4oz caster sugar",
            "2 vanilla pods, seeds only",
            "250ml/9fl oz whole milk",
            "750ml/25fl oz double cream",
            "55g/2oz demerara sugar"
        ],
        "For the roasted sugared almonds": [
            "1 egg white",
            "550g/1lb 4oz whole almonds",
            "200g/7oz caster sugar",
            "¼ tsp sea salt"
        ],
        "For the rhubarb purée": [
            "300g/10½oz rhubarb, cut in 2cm/¾in pieces",
            "1 tbsp caster sugar",
            "2 blood oranges, juice only"
        ]
    },
    "steps": [
        "Using an egg cutter, cut the top off the large eggs and pour out the contents. Dry the egg shells out.",
        "Put the egg yolks in a bowl, add the caster sugar and vanilla seeds. Whisk together until pale, fluffy and well combined.",
        "In a small pan, bring the milk and cream to a gentle boil. Gradually pour over the egg mixture.",
        "Pour the mix back in the pan and cook until it has thickened, and coats the back of a spoon. Leave aside to cool.",
        "Carefully ladle the mixture into the dried egg shells. Just before serving sprinkle the demerara sugar on top and carmelise it using a chef's blowtorch.",
        "For the almonds, preheat the oven to 130C/110C Fan/Gas 1 and line a baking tray.",
        "Lightly beat the egg white with 1 tablespoon water. Add the almonds and stir until well-coated. Mix the sugar and salt together and sprinkle over the nuts. Toss to coat, and spread evenly on the tray.",
        "Cook for 1 hour in the oven, stirring occasionally, until golden-brown. Leave to cool.",
        "Increase the oven temperature to 200C/180C Fan/Gas 6.",
        "Put the rhubarb in a roasting tin. Sprinkle over the sugar, then drizzle over the juice. Roast the rhubarb in the oven for 8-12 minutes, or until just tender. Leave to cool. Place in a blender and blend until smooth.",
        "Serve the crème brûlée egg on a serving plate alongside the rhubarb purée and sugared almonds."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}