{
    "title": "Crêpes suzette",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "1-2 hours",
    "serves": "Serves 4",
    "recommendations": "7",
    "images": [
        
    ],
    "description": "A classic French dessert that always impresses. You can make the crêpes in advance and finish the sauce just before serving.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the crêpes": [
            "125g/4½oz plain flour",
            "1 free-range egg",
            "1 tsp melted butter",
            "300ml/10½fl oz milk",
            "butter, for frying"
        ],
        "For the sauce": [
            "50g/1¾oz unsalted butter",
            "1 orange, zest and juice",
            "2 oranges, juice only",
            "1 lemon, zest and juice",
            "3 tbsp caster sugar",
            "2 tbsp orange liqueur",
            "2 tbsp brandy"
        ]
    },
    "steps": [
        "For the crêpes, place the flour into a bowl. Add the egg, melted butter and milk and whisk to a smooth batter. Set aside for at least one hour, preferably overnight.",
        "Heat a frying pan until medium hot, melt a little butter in the pan, then add a ladle of batter and swirl to coat the bottom of the pan. Cook for 1-2 minutes, then flip and cook for a further minute.",
        "Slide the crêpe from the pan and place on greaseproof paper. Repeat with the remaining batter, layering the crêpes with greaseproof paper as you go. The crêpes can be chilled or frozen at this point and used later.",
        "For the sauce, heat a frying pan until hot, add the butter, orange zest and juice, lemon zest and juice and the caster sugar.",
        "Cook for a few minutes until just thickened and bubbling, then remove the pan from the heat.",
        "Fold the crêpes into quarters and carefully lay into the hot sauce. Return the pan to the heat then add the orange liqueur and brandy and flame to burn off the alcohol. (CAUTION: Keep your face and hair away from the flames. Do not leave the pan unattended.)",
        "Cook for a couple of minutes until the crêpes are heated through.",
        "To serve, spoon the crêpes onto serving plates and spoon the sauce over the top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}