{
    "title": "Crunchy chicken cutlets",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "6",
    "images": [
        
    ],
    "description": "Chicken cutlets are what Americans call escalopes, but such is my alliteration addiction, I had to go for this nomenclature. I could have called them Cornflake-Crunchy Chicken Cutlets as the crisp coating is provided not by breadcrumbs, but by cornflakes. Each breast provides a generously portioned escalope, and all I’d suggest you’d eat alongside is a handful of rocket, dotted with some halved cherry tomatoes, dressed simply.",
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "tips": [
        "This recipe is particularly handy if you want a gluten-free crunch, though do check the mustard jar and cornflake packet to be sure. In theory, cornflakes should by their very nature be gluten-free but, because of cross-contamination issues in factories, that isn’t always the case. If this isn’t an issue, then use any cornflakes you like. You can buy chicken escalopes already beaten, but otherwise just buy a couple of chicken breasts and, one at a time, place them on a chopping board lined with clingfilm, cover the chicken with another layer of clingfilm and bash the living daylights out of them with a rolling pin. This is a gratifying way to de-stress at the end of a long day."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "cherry tomatoes",
            "rocket or salad leaves of your choice",
            "1 lemon, cut into wedges"
        ],
        "To serve": [
            "cherry tomatoes",
            "rocket or salad leaves of your choice",
            "1 lemon, cut into wedges"
        ]
    },
    "steps": [
        "Take the chicken out of the fridge so that it isn’t too cold by the time you get frying. If you are using filleted chicken breasts, rather than escalopes, then proceed as described in the tips section.",
        "Get out a shallow dish that, preferably, you can get both escalopes in, and spoon in the mustard and garlic. Add the cinnamon and egg and whisk to combine. Put the escalopes in, turn them, and leave to sit in the mixture while you prepare the \"crumbs\".",
        "Put the cornflakes in a bowl and crush them by hand. This, sadly, is not as brutal as it sounds: merely break them up with your fingers to get coarsely crushed flakes, but not dust. Add the pimentón or paprika and use a fork to mix in.",
        "Dredge the egg-and-mustard-soaked escalopes, one by one, in the cornflake crumbs, so that they are well covered, and then transfer to a wire rack for 5–10 minutes so they can dry out.",
        "Heat the oil in a cast-iron pan or heavy-based frying pan in which the chicken pieces will fit neatly. Once hot, fry the chicken for 3 minutes on the first side, then turn them over carefully and give them another 3 minutes, by which time the chicken should be cooked through in the middle, though do check. Remove to waiting plates, already strewn with tomatoes and rocket or salad leaves of your choice."
    ],
    "howTos": [
        
    ],
    "videos": "[p03710s8:p03710sr]"
}