{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "East_European",
    "description": "These pies are served in Transylvanian cafés and they are a great roadside snack. They’re a bit like little pizzas really and you can pick your own filling. Very easy to make and they can be cooked in the oven or on top of the stove.",
    "dishes": [
        "ham",
        "meat_pie",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "pizza",
        "salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "Filling": [
            "ham, chorizo, cheese, mushrooms,",
            "whatever you fancy"
        ],
        "Pastry": [
            "200ml/⅓ pint sparkling mineral water",
            "pinch salt",
            "1 tbsp sunflower oil",
            "270g/9¾ oz plain flour, enough to form a soft dough",
            "2 eggs, beaten",
            "100ml/3½fl oz plain yoghurt"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "5",
    "serves": "Makes 4",
    "show": {
        "b01dl8gl": "Hairy Bikers' Bakeation"
    },
    "steps": [
        "Pour the mineral water into a mixing bowl and add the salt and oil. Fold in the flour, adding enough to make a soft dough. Wrap the dough in cling film and chill it in the fridge for about 30 minutes. This makes it easier to roll out.",
        "Preheat the oven to 180°C/350F/Gas 4. Take the dough out of the fridge and divide it into 4 balls. Roll out each ball as thinly as you can, then place a round chopping board or a plate underneath, letting the edges of the pastry overlap. This makes a kind of template for your filling.",
        "Place a thin layer of filling over the pastry spreading it out as far as the edges of the plate or board underneath. Don’t overdo the filling – a little goes a long way.",
        "Fold the edges of the pastry in towards the middle to form a nice pleated curly pie. Don’t worry if it looks a bit rustic – the folds make the curls in your curly pie. Repeat to make the remaining pies in the same way and place them on a baking tray.",
        "Beat the eggs with the yoghurt and brush the mixture over the pies. Bake them for about 40 minutes until they are cooked through and have a lovely golden crust.",
        "Serve with a salad."
    ],
    "tips": [
        
    ],
    "title": "Curly pie",
    "videos": "[]"
}