{
    "author": {
        "nigel_slater": "Nigel Slater"
    },
    "cookTime": "less than 10 mins",
    "description": "Nigel Slater shares an easy recipe with all the right ingredients: cream, booze and cherries on top.",
    "dishes": [
        "custard",
        "jelly",
        "pie",
        "prepare-ahead_desserts",
        "trifle"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/dads_banana_custard_00581_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "2 ready-made raspberry Swiss rolls, cut into 4cm/1½in-thick slices",
            "6 tbsp sweet sherry",
            "1 x 135g/5oz block blackcurrant jelly",
            "custard powder",
            "500ml/17fl oz milk",
            "2 ripe bananas, peeled and chopped",
            "600ml/1¼ pints double cream",
            "100g/3½oz flaked almonds",
            "200g/7oz glacé cherries, sliced",
            "50g/2oz candied angelica"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "2",
    "serves": "Serves 4-6",
    "show": {
        "b05y38pk": "Nigel Slater: Eating Together"
    },
    "steps": [
        "Arrange the Swiss roll slices in the bottom of a large trifle dish. Generously soak the Swiss roll pieces with the sherry.",
        "Prepare the jelly according to the packet instructions, using water to dissolve it. Pour the dissolved jelly over the Swiss rolls, then set aside to cool. Chill in the fridge until the jelly has solidified.",
        "Prepare the powdered custard according to the packet instructions using the milk. Add the chopped bananas and set aside to cool.",
        "When the custard has cooled, pour it on top of the jelly, then set aside to cool. Return to the fridge and chill for 30 minutes, or until needed.",
        "Whisk the double cream until stiff peaks form when the whisk is removed, then slather it on top of the custard.",
        "Toast the flaked almonds in a dry frying pan over a medium heat until just lightly coloured. Scatter them on top of the trifle.",
        "Decorate the top of the trifle with the sliced glacé cherries and candied angelica just before serving."
    ],
    "tips": [
        
    ],
    "title": "Dad’s banana custard trifle",
    "videos": "[]"
}