{
    "author": {
        "mike_robinson": "Mike Robinson"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "These creamy, garlicky potatoes make a fabulous side dish for any Sunday roast. Equipment and preparation: You will need a large gratin dish.",
    "dishes": [
        "dauphinoise_potatoes",
        "gratin",
        "oven-baked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/dauphinoisepotatoes_90205_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 kg/2lb 4oz baking potatoes, peeled and placed in a bowl of cold water to prevent them from browning (use floury potatoes such as Russet, King Edward, Maris Piper or Desiree)",
            "3-4 cloves garlic",
            "500ml/17½fl oz double cream (you may need a bit extra)",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "133",
    "serves": "Serves 6",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 160C/320F/Gas 2.",
        "Slice the potatoes into thin slices, about 3mm/⅛in thick. Place the slices into a bowl as you cut them.",
        "Trim the ends off the garlic cloves but don't peel. Grate the cloves on a grater. The flesh will go through the fine holes and the skins will be left behind. Scrape the grated garlic flesh into the bowl with the potatoes.",
        "Season the potatoes, to taste, with salt and freshly ground black pepper.",
        "Pour the cream over the potatoes and mix well again.",
        "Place the potato slices into the gratin dish. They should come to just below the top of the dish. Press the potato down with the back of a spoon or your hands so it forms a solid layer. The cream should come to just below the top layer of potato (top up with more double cream if necessary).",
        "Place the potatoes in the oven and bake for 1-1½ hours, or until the potatoes are completely tender. (If the cream looks like it's splitting, your oven is too hot, so turn it down a bit.)",
        "Serve the dauphinoise as a side dish to roasted meat or poultry."
    ],
    "tips": [
        
    ],
    "title": "Dauphinoise potatoes",
    "videos": "[]"
}