{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "",
    "dishes": [
        "cake",
        "icing",
        "oven-baked_dishes",
        "sandwich"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling and topping": [
            "75g/3oz butter, softened",
            "250g/8oz icing sugar, sifted",
            "2 tbsp orange juice",
            "finely grated rind of 1 orange"
        ],
        "Tins": [
            "2 loose bottomed 20cm/8in sandwich tins, 4cm deep"
        ],
        "To garnish": [
            "spiralled orange zests"
        ],
        "default": [
            "225g/8oz butter or margarine, softened",
            "225g/8oz caster sugar",
            "4 eggs",
            "220g/7¾oz self-raising flour",
            "2 tsp baking powder",
            "1 orange, zest only"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "11",
    "serves": "Serves 8",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Lightly grease the tins and line the bases with non-stick baking parchment. Pre-heat the oven to 180C/350F/Gas 4.",
        "Measure the butter or margarine, sugar, eggs, flour, baking powder and orange zest into a large bowl and beat for about two minutes, until just blended; an electric mixer is best for this, but of course you can also beat by hand with a wooden spoon.",
        "Divide the mixture evenly between the prepared tins and level the surface with the back of a spoon or a plastic spatula.",
        "Bake for about 25 minutes, until well risen and golden. The tops of the cakes should spring back when pressed lightly with a finger. Leave the cakes to cool in the tins for a few minutes, then run a small palette knife or blunt knife around the edge of the tins to fee the sides of the cakes. Turn the cakes out on to a wire rack, peel off the paper and leave to cool completely.",
        "Choose the cake with the best top, then put the other cake top downwards on to a serving plate.",
        "Beat together the filling ingredients and spread on one side of the cake, put the other cake on top (top upwards) and spread the rest of the orange cream on top. Decorate with spiralled orange zests."
    ],
    "tips": [
        
    ],
    "title": "Definitive orange cake",
    "videos": "[]"
}