{
    "title": "Dry curry of cabbage, carrot and coconut (Thoran)",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "18",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/dry_curry_of_cabbage_71527_16x9.jpg"
    ],
    "description": "Thoran is a dry vegetable curry from Kerala made from whatever fresh vegetables are around – snake beans, unripe jack fruit, sag (leafy vegetables), even green tomatoes. This meal, if served as six portions, provides 156kcal, 3g protein, 4g carbohydrate (of which 3.5g sugars), 13g fat (of which 10g saturates), 5g fibre and 0.9 salt.",
    "author": {
        "rick_stein": "Rick Stein"
    },
    "show": {
        "b033rhzh": "Rick Stein's India"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "3 tbsp coconut oil or vegetable oil",
            "2 tsp black mustard seeds",
            "2 tbsp chopped fresh curry leaves",
            "1 tsp cumin seeds",
            "2 dried Kashmiri chillies, each broken into 3 or 4 pieces",
            "30g/1oz (or 6cm/2½in) fresh root ginger, finely grated into a paste",
            "½ tsp ground turmeric",
            "1 tsp salt",
            "½ tsp coarsely ground black pepper",
            "250g/9oz hispi or pointed spring cabbage (or spring greens), shredded into 5mm pieces",
            "2 carrots, diced",
            "2 fresh green chillies, sliced into thin rounds, with seeds",
            "100g/3½oz fresh or frozen coconut flesh, blended in a food processor or grated"
        ],
        "To serve": [
            "boiled basmati rice",
            "poppadoms"
        ]
    },
    "steps": [
        "Heat the oil in a heavy-based saucepan or karahi set over a medium heat, and, when hot, add the mustard seeds followed by the curry leaves, cumin seeds and dried chillies. Stir for about 30 seconds, then add the ginger paste, turmeric, salt and black pepper and fry for 30 seconds.",
        "Stir in the cabbage and carrots and cook, covered, over a medium heat for 5-7 minutes, or until the vegetables are tender, adding a splash of water if they start to stick to the pan.",
        "Stir in the green chillies and coconut, heat through for a minute and serve. Serve with rice and poppadoms."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}