{
    "title": "Duck breast with honey and sansho pepper, mango, shiso and daikon",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "nic_watt": "Nic Watt"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the duck": [
            "75g/3oz clear honey",
            "1 tbsp umeboshi paste/plum paste (available from specialist Japanese grocers)",
            "½ tsp fresh ginger, finely chopped",
            "¼ tsp sansho pepper (available from specialist Japanese grocers)",
            "¼ tsp mild curry powder",
            "¼ tsp five spice powder",
            "¼ tsp ground ginger",
            "4 x 175g/6oz duck breasts"
        ],
        "To serve": [
            "110g/4oz daikon radish, finely julienned",
            "1 mango, peeled, stone removed, finely sliced",
            "50g/2oz lotus root, finely sliced and deep fried until crisp (available from Asian grocers)",
            "75g/3oz watercress",
            "1 punnet shiso leaves (also called perilla leaves)",
            "1 shallot, finely sliced",
            "½ lemon, juice only"
        ]
    },
    "steps": [
        "Preheat the oven to 160C/320F/Gas 2.",
        "Place the honey into a bowl along with the umeboshi paste and fresh ginger and mix well.",
        "Add the sansho pepper, curry powder, five spice powder and ground ginger and stir well.",
        "Heat an ovenproof frying pan until warm and add the duck breast, skin-side down, and cook gently for 3-4 minutes to render the fat out.",
        "Turn the duck over and baste with the honey and spice mixture, then transfer to the oven to roast for 5-6 minutes, or until cooked to your liking.",
        "Remove the duck from the oven, baste with the honey and spice mixture and allow to rest.",
        "To serve, roll a small handful of daikon into a ball. Repeat to create 28 such balls of daikon and place seven around the edge each of four plates.",
        "Place two thin slices of mango on top of each ball of daikon.",
        "Slice the duck into very thin slices and place two pieces on top of each pile of daikon and mango.",
        "Place a piece of fried lotus root to the side of each pile.",
        "Place any remaining daikon, the watercress, shiso leaves, shallot and lemon juice into a bowl and mix well. Place a small handful of this salad into the centre of each plate and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}