{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "1 to 2 hours",
    "description": "The pickled beetroot leaves are best made a day ahead, but can be done in an hour if you're pressed for time.",
    "dishes": [
        "bun",
        "gravy",
        "jam",
        "oven-baked_dishes",
        "pickle",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the apple purée": [
            "2 cooking apples (preferably Bramley), peeled, cored and chopped",
            "50g/1¾oz butter",
            "2-4 tbsp caster sugar, to taste"
        ],
        "For the beetroot purée": [
            "600g/1lb 5oz raw beetroot, peeled, cut into chunks",
            "1 onion, roughly chopped",
            "½ garlic clove, roughly chopped",
            "2 sprigs fresh thyme, leaves only"
        ],
        "For the duck": [
            "4 tbsp olive oil",
            "4 duck breasts, trimmed"
        ],
        "For the red cabbage": [
            "100g/3½oz unsalted butter",
            "1 red onion, finely chopped",
            "½ red cabbage, cored and finely sliced",
            "200ml/7fl oz red wine vinegar",
            "50g/1¾oz clear honey",
            "100g/3½oz demerara sugar",
            "1 bay leaf",
            "2 star anise",
            "1 cinnamon stick",
            "salt"
        ],
        "For the roasted beetroot": [
            "½ bunch baby heritage beetroots, cleaned and trimmed, leaves reserved",
            "200ml/7fl oz white wine vinegar",
            "75g/2½oz caster sugar",
            "1 tsp salt",
            "½ tsp black peppercorns",
            "75g/2½oz unsalted butter"
        ],
        "To serve": [
            "curly kale, wilted and buttered",
            "jus or gravy"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the roasted beetroot, put the baby beetroot in a large saucepan of boiling water and cook for 15-20 minutes. Drain and leave to cool slightly. Carefully peel the beetroots and cut them in half.",
        "Heat the white wine vinegar, sugar, salt and peppercorns in a pan over a medium heat until the sugar is dissolved. Put the reserved beetroot leaves in a bowl and pour over the hot vinegar mixture. Mix together, coating the leaves. Set aside to pickle for at least an hour, but preferably 24 hours.",
        "For the braised red cabbage, heat a large frying pan and add the butter. Once hot, add the onion and cook for 2-3 minutes, then add the cabbage and cook for 2 minutes. Stir in the vinegar, honey, sugar and spices and season with salt. Turn down the heat and cook for 30-40 minutes, or until the cabbage is very tender.",
        "For the beetroot purée, place all of the ingredients into a food processor and blend to a purée.",
        "Transfer the purée to a frying pan set over a low heat. Cook for 30-40 minutes, stirring occasionally. Season with salt and pepper.",
        "For the apple purée, put the cooking apples, butter and 2-3 tbsp water in a saucepan. Cover and cook for 4-5 minutes, or until the apples have broken down. Stir and season with the sugar and a little salt. Set aside and keep warm.",
        "For the duck, preheat the oven to 200C/180C Fan/Gas 6.",
        "Heat an ovenproof frying pan until very hot and add the oil. Add the duck breasts fat-side down and cook for 3-4 minutes, or until golden-brown. Turn over and cook for a further 1-2 minutes. Transfer to the oven for 8-10 minutes. Remove from the oven and set the duck aside to rest for 5 minutes.",
        "Meanwhile to finish the roasted beetroot, melt the butter in a frying pan and add the beetroots. Cook for 2-3 minutes, or until slightly golden-brown.",
        "To serve, dress the plates with the beetroot and apple purée. Place the red cabbage on the plates with the duck breast, roasted beetroot, kale, beetroot leaves and drizzle with jus or gravy."
    ],
    "tips": [
        
    ],
    "title": "Duck breasts with beetroot, apple and braised red cabbage",
    "videos": "[]"
}