{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "over 2 hours",
    "description": "Try a deliciously different recipe for brownies and swirl in dulce de leche for marbled decadence.",
    "dishes": [
        "cake",
        "chocolate_brownies",
        "oven-baked_dishes",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/dulce_de_leche_brownies_81814_16x9.jpg"
    ],
    "ingredients": {
        "To serve": [
            "chocolate sauce",
            "double cream"
        ],
        "default": [
            "125g/4½oz condensed milk",
            "150g/5½oz dark chocolate",
            "115g/4oz unsalted butter, cubed",
            "25g/1oz cocoa powder",
            "3 free-range eggs",
            "200g/7oz caster sugar",
            "140g/5oz plain flour"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "13",
    "serves": "Serves 6-8",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "To make the dulche de leche, fill a saucepan with water and boil the tin of condensed milk for four hours. Take care to ensure the water does not boil down completely. Carefully remove the tin from the water and set aside to cool.",
        "Preheat the oven to 175C/325F/Gas 3. Grease and line a 20cm/8in square cake tin.",
        "Place the chocolate and butter into a heatproof bowl and suspend it over a pan of simmering water. Once melted, remove the bowl from the heat and whisk in the cocoa powder, eggs and sugar before quickly folding in the flour.",
        "Pour half of the batter into the cake tin and drop dollops of the dulche de leche over the mixture. Using a spoon, swirl the dulce de leche into the batter to create a marbled effect.",
        "Add the rest of the batter on top and repeat Step 4.",
        "Place the cake into the oven and bake for 30-40 minutes, or until cooked through. Test by pushing a skewer into the centre of the cake. If the skewer comes out clean, the cake is ready. Set aside to cool.",
        "Cut the cake into 7.5-10cm/3-4in squares and serve with chocolate sauce and cream."
    ],
    "tips": [
        
    ],
    "title": "Dulce de leche brownies",
    "videos": "[]"
}