{
    "title": "Easter simnel truffles",
    "cookTime": "less than 10 mins",
    "prepTime": "1-2 hours",
    "serves": "Makes approximately 30 truffles",
    "recommendations": "1",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/easter_simnel_truffles_05358_16x9.jpg"
    ],
    "description": "Chocolate truffles are a decadent treat at any time but this Easter version is irresistible.",
    "author": {
        "paul_a_young": "Paul A Young"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the ganache": [
            "200ml/7fl oz full-fat milk or double cream",
            "1 cinnamon stick, crushed",
            "half a nutmeg, grated",
            "75g/2¾oz muscovado sugar",
            "300g/10½oz dark chocolate (preferably with 62% or more cocoa solids), finely chopped",
            "5 tsp brandy",
            "100g/3½oz marzipan"
        ],
        "For the coating": [
            "100g/3½oz cocoa powder",
            "100g/3½oz icing sugar",
            "25g/1oz ground cinnamon",
            "10g/¼oz ground nutmeg",
            "400g/14oz dark chocolate, melted and tempered"
        ]
    },
    "steps": [
        "For the ganache, put the milk or cream, spices and sugar into a saucepan and bring to a simmer. Place the chopped chocolate in a heatproof bowl. Remove the spiced milk from the heat and strain through a fine sieve onto the chopped chocolate. Whisk until smooth, then add the brandy and whisk again. Pour into a plastic container and refrigerate for an hour, or until set.",
        "Roll the marzipan into small balls the size of a hazelnut. Coat the marzipan balls in the set ganache and place on a tray.",
        "For the coating, place the cocoa powder, icing sugar, cinnamon and ground nutmeg into a bowl.",
        "Melt and temper the dark chocolate by breaking the chocolate into small, even pieces and gently melting it in a bowl over a saucepan of hot, not boiling, water. Place a cook’s thermometer into the chocolate and continue to heat until it reaches 43C/110F. Remove from the heat and cool to 35C/95F. Now it is ready to use.",
        "Using your fingers, dip each truffle in the melted, tempered chocolate and drop into the cocoa powder mixture, rolling until the truffle is completely coated. Set aside to cool on a plate.",
        "Eat the truffles at room temperature, so they are very soft inside."
    ],
    "howTos": [
        "how_to_temper_chocolate"
    ],
    "videos": "[]"
}