{
    "title": "Paul Hollywood's ciabatta",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "over 2 hours",
    "serves": "Makes 4 small loaves",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "Ciabatta dough is extremely wet, so difficult to make by hand, but if you have a freestanding mixer it's simple. Don't be tempted to add more flour or rush the prove as it will spoil the the texture of the finished loaf. Equipment and preparation: for this recipe you will need a freestanding mixer with a dough hook attachment and a 3 litre/5¼pint square plastic container with a lid.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2oz strong white bread flour, plus extra for dusting",
            "10g/⅓oz salt",
            "10g/⅓oz instant yeast",
            "fine semolina, for dusting"
        ]
    },
    "steps": [
        "Put the flour, salt and yeast with 330ml/11fl oz cold water into a freestanding mixer fitted with a dough hook (don’t put the salt directly on top of the yeast). Begin mixing on a slow speed.",
        "As the dough starts to come together, with the motor running, slowly add another 110ml/3⅓fl oz of cold water, drip by drip. Mix for a further 5-8 minutes on a medium speed until the dough is smooth and stretchy.",
        "Lightly oil a 3 litre/5¼pint square plastic container with a lid. (It’s important to use a square tub as it helps shape the dough).",
        "Tip the dough into the oiled container and seal with the lid. Leave for 1½ to 1¾ hours at room temperature, or until at least doubled, even trebled in size (it's important the dough proves slowly, otherwise it will collapse and your loaves will be flat).",
        "Dust two large baking trays with flour and semolina.",
        "Dust your work surface heavily with flour and semolina and carefully tip out the dough (it will be very wet) - trying to retain a rough square shape.",
        "Rather than knocking it back, handle it gently so you can keep as much air in the dough as possible. Coat the top of the dough with more flour and/or semolina.",
        "Cut the dough lengthways, dividing into four equally-sized loaves. Stretch each piece of dough lengthways a little and place on the prepared baking trays. Leave the ciabatta to rest for a further 30-45 minutes.",
        "Preheat the oven to 220C/425F/Gas 8 (200C fan) and bake for 25 minutes, or until the loaves are golden-brown and sound hollow when tapped on the base. Leave to cool completely on a wire rack before serving."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}