{
    "title": "Eggs in pots (oeufs en cocotte)",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "43",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/eggs_in_pots_93154_16x9.jpg"
    ],
    "description": "Eggs and crème fraîche are all you need for this super-simple yet very tasty dish. You can also throw in almost anything savoury you find in your fridge. Try serving it with plenty of crusty bread.",
    "author": {
        "rachel_khoo": "Rachel Khoo"
    },
    "show": {
        "b01dy7yt": "The Little Paris Kitchen: Cooking with Rachel Khoo"
    },
    "tips": [
        "The crème fraîche can be replaced with béchamel or mornay sauce. If you like, you can add chopped mushrooms, ham, smoked salmon or cherry tomatoes after the crème fraîche, or a spoonful of pipérade. Try swapping the dill for parsley, basil or coriander, or spice things up with a dash of Tabasco or chilli sauce."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "150g/5½oz crème fraîche",
            "salt and freshly ground black pepper",
            "pinch nutmeg",
            "handful of chopped dill",
            "4 free-range eggs"
        ],
        "To garnish": [
            "red lumpfish roe",
            "small sprigs of dill"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Season the crème fraîche with salt, freshly ground pepper and a pinch of nutmeg.",
        "Place a heaped tablespoon of crème fraîche in the bottom of a ramekin, followed by a little dill.",
        "Crack an egg on top, add a second tablespoon of crème fraîche and sprinkle with a pinch each of salt, pepper and nutmeg. Repeat with three more ramekins.",
        "Place the ramekins in a baking dish and pour enough lukewarm water into the dish to come halfway up the sides of the ramekins.",
        "Bake for 15 minutes or until the egg yolks are set to your liking.",
        "If you like, finish each serving with a teaspoon of red lumpfish roe and a sprig or two of dill."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}