{
    "title": "Estonian lamb shanks",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "This warming Estonian dish delivers meltingly tender lamb and has wonderful hints of citrus flavours.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b069hr3q": "The Hairy Bikers' Northern Exposure"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "4 small lamb shanks",
            "2 tbsp plain flour",
            "2 tbsp vegetable oil",
            "2 small onions, finely chopped",
            "1 tbsp juniper berries, lightly crushed",
            "2 unwaxed lemons, zest only",
            "strip of orange zest",
            "4 bay leaves",
            "small bunch of parsley",
            "2 large potatoes, diced",
            "4 carrots, cut into 1cm/½in slices on the diagonal",
            "800ml/1½ pint lamb or chicken stock",
            "1 orange, juice only",
            "2 tbsp soured cream",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "400g/14oz ready-made gnocchi, cooked according to packet instructions (optional)"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "Put the lamb shanks in a large bag and add the flour. Close and shake, so the flour completely coats the lamb.",
        "Heat 1 tablespoon of the oil in a large, heavy-bottomed frying pan. Sear the lamb shanks on all sides until well browned and slightly crisp.",
        "Meanwhile heat the remaining oil in a large lidded casserole, add the onions and sauté for several minutes until soft. Add the juniper berries, lemon and orange zests, bay leaves and 2 large sprigs of parsley. Stir for a minute or two, then add the lamb shanks, on their sides if possible. Add the potatoes and carrots.",
        "De-glaze the frying pan used to brown the lamb with a little stock and add to the casserole dish, then pour in the remaining stock and bring to the boil. Add the orange juice and season with salt and pepper. Cover and transfer to the oven. Cook for an hour and half, then remove the lid and cook for a further 30 minutes.",
        "Return the casserole to the hob and remove the lamb shanks, parsley sprigs and bay leaves. Add the sour cream and stir until well combined. Finely chop the leaves from the remaining parsley and stir in. Return the shanks to the casserole and serve with the gnocchi."
    ],
    "howTos": [
        
    ],
    "videos": "[p031llq0:p031llq7]"
}