{
    "title": "Coriander, chilli and cumin-crusted lamb served with spiced risotto and mint and chilli oil",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "lesley_waters": "Lesley Waters"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the crusted lamb": [
            "¼ tsp coriander seeds",
            "¼ tsp cumin seeds",
            "¼ tsp coarsely ground black pepper",
            "¼ tsp chilli flakes",
            "1 orange, zest and juice",
            "1 slice bread",
            "1 lamb leg steak",
            "1 tbsp olive oil",
            "salt and freshly ground black pepper"
        ],
        "For the risotto": [
            "1 tbsp olive oil",
            "½ onion, chopped",
            "1 tsp ground turmeric",
            "150g/5½oz basmati rice, washed and drained",
            "100ml/3½fl oz double cream",
            "small handful fresh coriander leaves, roughly chopped",
            "salt and freshly ground black pepper"
        ],
        "For the mint and chilli oil": [
            "small bunch each fresh mint, coriander, flatleaf parsley and chives",
            "½ tsp chilli flakes",
            "3 tbsp olive oil",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the crusted lamb, place the spices, orange zest and bread into a food processor and pulse unti broken into crumbs. Add a squeeze of orange juice to bind if necessary.",
        "Rub the lamb with olive oil and season with salt and freshly ground black pepper.",
        "Heat an ovenproof frying pan and fry the lamb for two minutes on each side.",
        "Carefully press the breadcrumb mixture onto the top side of the lamb and transfer the pan to the oven for a further 4-6 minutes, or until cooked to your liking. Set aside to rest for five minutes.",
        "For the risotto, heat the olive oil in another non-stick frying pan and add the onion and turmeric. Sauté the onion until soft but not coloured.",
        "Add the basmati rice to the pan and fry for two minutes, stirring continuously.",
        "Add the double cream to the rice and gently bring to the boil, stirring regularly.",
        "Reduce the heat and simmer for 8-10 minutes, or until the rice is tender.",
        "Stir in the fresh coriander and season with salt and freshly ground black pepper.",
        "For the mint and chilli oil, place all the ingredients into a small food processor and blend to combine.",
        "To serve, place the risotto onto a plate, top with the lamb and drizzle over the mint and chilli oil."
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}