{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This is the perfect combination of potatoes and vegetables all cooked in one dish for a hearty dinner party or Sunday lunch. It is so tasty I could eat it as a supper on its own! You will need a shallow 2.4 litre/4 pint oven proof dish, about 23x30cm/9x13in.",
    "dishes": [
        "gratin",
        "oven-baked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/fennel_and_potato_gratin_29963_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "50g/1¾oz butter, plus extra for greasing",
            "3 large bulbs fennel",
            "3 onions",
            "600g/1lb 6oz large potatoes, peeled",
            "2 garlic cloves, crushed",
            "50g/1¾oz parmesan cheese, grated (or vegetarian equivalent)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "28",
    "serves": "Serves 4-6",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6 (180 fan). Butter the serving dish.",
        "Trim the tops from the fennel and cut each bulb in half through the root, then cut each half lengthways into three wedges. Cut the onions into six wedges too in a similar way.",
        "Cut the potatoes into wedges the same size as the fennel wedges.",
        "Boil the fennel and onions in a large pan of salted water for about five minutes, then add the potatoes and boil for a further five minutes, or until the potatoes and fennel are just tender. Drain well.",
        "Put the 50g/1¾oz butter and the garlic in the same large pan set over a low heat until just melted. Return the potatoes and fennel to the butter, toss until coated then tip into the ovenproof dish. Sprinkle with the parmesan. Bake for 30-40 minutes, or until piping hot."
    ],
    "tips": [
        "Assemble the dish up to 12 hours ahead and chill in the fridge. It is essential to pre-cook the potatoes and fennel, otherwise they absorb too much butter and you would have to use more, giving an over-rich result and the fennel could be tougher."
    ],
    "title": "Fennel and potato gratin",
    "videos": "[]"
}