{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Thai_and_South-East_Asian",
    "description": "Korean red chilli paste and red chilli powder add an unusual dimension to this spicy octopus dish. Source them online or from an Asian supermarket.",
    "dishes": [
        "pie",
        "prepare-ahead_desserts",
        "sauce",
        "seafood"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the spice paste": [
            "10g fresh root ginger (about the size of a £2 coin)",
            "3 garlic cloves, grated or chopped",
            "2 tsp gochujang (Korean red chilli paste)",
            "1 tsp soy sauce",
            "2 tsp gochugaru (Korean red chilli powder)",
            "½ tsp golden syrup",
            "1 tsp mirin"
        ],
        "default": [
            "300g/10½oz baby octopus (fresh or frozen, if frozen defrost thoroughly)",
            "½ tbsp vegetable oil",
            "½ small onion, sliced",
            "5 shiitake mushrooms, stalks removed, sliced thinly",
            "2 spring onions, cut in half lengthways",
            "1 small red chilli, thinly sliced on a slant",
            "1 tsp sesame oil",
            "sprinkle of sesame seeds"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 2",
    "show": {
        "b03vp3tt": "The Hairy Bikers' Asian Adventure"
    },
    "steps": [
        "Clean and rinse the octopus in cold water and remove the beak (you can get your fishmonger to prepare it for you).",
        "For the spice paste, peel and grate the ginger and put it in a medium bowl with the garlic, chilli paste, soy sauce, chilli powder, golden syrup and mirin. Mix well and then set aside.",
        "Heat a medium pan of boiling water, add the octopus to the boiling water and blanch for 1½ minutes, then drain. Put the octopus into a bowl of ice-cold water and drain again once cool. Remove the skin from the octopus. Cut into quarters or just remove the tentacles if very small. Cut into bite-sized pieces.",
        "Heat a frying pan or wok, add the oil and fry the onion for a couple of minutes. Add the octopus and paste to the onions and cook for a minute. Add the mushrooms, cook for another minute and then add the spring onions, chillies and sesame oil. Sprinkle sesame seeds into and over and serve."
    ],
    "tips": [
        
    ],
    "title": "Fiery octopus (Ojingeo bokkeum)",
    "videos": "[p01tlp4x:p01tlp4z]"
}