{
    "title": "Fish soup with gruyere straws and rouille",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "ed_baines": "Ed Baines"
    },
    "show": {
        "b00dznhb": "Put Your Money Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the gruyère straws": [
            "1 sheet ready-made puff pastry, cut into long strips",
            "50g/1¾oz gruyère cheese, finely grated"
        ],
        "For the rouille": [
            "2 garlic cloves",
            "1 free-range egg yolk",
            "½ red chilli",
            "pinch saffron",
            "about 100-150ml olive oil"
        ],
        "For the soup": [
            "25g/1oz unsalted butter",
            "1 onion, peeled and chopped",
            "2 sticks celery, sliced",
            "2 garlic cloves, peeled and chopped",
            "½ bulb fennel, sliced",
            "1 tbsp plain flour",
            "1 tsp tomato purée",
            "25ml/1fl oz pastis",
            "400ml/14¼fl oz white wine",
            "1 litre/1 pint 15¼fl oz fish stock",
            "small handful flatleaf parsley, chopped",
            "1 whole star anise",
            "300g/10½oz skinless white fish fillet",
            "500g/1lb 1½oz live mussels, cleaned and de-bearded (discard any mussels that don't close when tapped firmly)",
            "100ml/3½fl oz double cream",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/355F/Gas 4.",
        "Twist each of the pastry strips twice to form straw shapes and lay on baking parchment on a baking tray. Sprinkle with the grated cheese and bake in the preheated oven for 10 minutes, or until golden-brown. Remove from the tray and allow to cool.",
        "To make the rouille, put the garlic, egg yolk, red chilli and saffron into a food processor and blend to a paste. With the motor running, slowly, pour enough oil to bring the mixture together to a thick mayonnaise-like consistency.",
        "For the soup, melt the butter in a large saucepan and fry the onion, celery, garlic and fennel until soft, but not coloured. Stir in the flour and cook for two minutes. Add the tomato purée, pastis, white wine, fish stock, parsley and star anise. Simmer for one hour.",
        "Add the fish to the pan and cook for five minutes, then remove the star anise and discard. Gently remove the fish from the stock and set aside.",
        "Add the mussels to the hot stock and cover the pan. Cook for 5-10 minutes, or until the mussels are fully open and cooked through.",
        "Stir the cream into the soup and return the fish to the stock. Season with salt and freshly ground black pepper, to taste.",
        "Serve the soup in bowls at once with the rouille and gruyère straws."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}