{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "Don't be tempted to rush frying the onions - giving them time to caramelise is what gives the soup its delicious flavour.",
    "dishes": [
        "baguette",
        "bread",
        "caramel",
        "jam",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "3 tbsp olive oil",
            "3 large onions, finely sliced",
            "2 sprigs thyme, leaves picked",
            "1 tbsp soft brown sugar",
            "2 garlic cloves, finely sliced",
            "200ml/7fl oz white wine",
            "1 heaped tbsp plain flour",
            "50ml/2fl oz brandy",
            "50ml/2fl oz dry sherry",
            "1 litre/1¾pints fresh dark beef stock",
            "1 baguette, sliced thickly",
            "110g/4oz Gruyère cheese, grated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "9",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Heat a large frying pan or sauté pan until hot, add two tablespoons of olive oil, the onions, thyme and soft brown sugar. Fry for 10-15 minutes over a medium-low heat, or until softened and golden-brown, stirring occasionally so it doesn’t catch on the bottom.",
        "Add the garlic and cook for a minute, then add the white wine and cook until the volume of liquid has reduced by half. Stir in the flour and cook for two minutes.",
        "Add the brandy and sherry, then pour in the stock and bring to the boil. Reduce the heat slightly and cook gently for about 10-15 minutes.",
        "While the soup simmers, heat a griddle until hot. Drizzle the remaining tablespoon of olive oil over the bread and toast on one side. Set aside.",
        "Check the seasoning of the soup, adding plenty of salt, a little black pepper, and more sugar or alcohol if necessary to suit your own taste.",
        "Preheat the grill to high.",
        "Ladle the soup into bowls and top with the toasted bread. Add the cheese on top of the bread and grill until bubbling and golden-brown."
    ],
    "tips": [
        "Any remaining soup can be placed in a freezer bag when cool and stored in the freezer for up to four weeks."
    ],
    "title": "French onion soup with Gruyère croûtons",
    "videos": "[p01tnpk7:p01tnpkn]"
}