{
    "author": {
        "hugh_fearnley-whittingstall": "Hugh Fearnley-Whittingstall"
    },
    "cookTime": "less than 10 mins",
    "description": "Hugh Fearnley-Whittingstall counts the ways to enjoy this classic Italian treat. Use tomatoes at the peak of ripeness.",
    "dishes": [
        "bread",
        "bruschetta",
        "ciabatta",
        "salad",
        "salsa"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "chopping_vegetables"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/freshtomatosalsawith_8881_16x9.jpg"
    ],
    "ingredients": {
        "For the bruschetta variations": [
            "ciabatta",
            "garlic",
            "olive oil",
            "black olives",
            "anchovies",
            "fresh basil leaves"
        ],
        "default": [
            "500g/1lb2oz ripe, full-flavoured tomatoes (such as Sungold or Gardener's Delight)",
            "2 tbsp extra virgin olive oil",
            "1 medium shallot or small red onion, finely chopped",
            "a squeeze of lemon or 1 tbsp white wine vinegar",
            "salt and fresh ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "7",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Pour boiling water over the tomatoes and remove them after 30 seconds. Peel them with a sharp knife and cut into quarters, scoop out the seeds with a thumbnail.",
        "You are left with skinless, seedless, delectably sweet tomato flesh. This can be left in quarters (for a chunky, salady version) or more finely chopped (if you are tending towards the salsa). Either way, toss with the remaining ingredients and it is ready to serve.",
        "For the bruschetta variations, grill slices of ciabatta or pugliese bread, rub with garlic and drizzle with olive oil. Mix the tomato salsa (chunky version) with a few chopped black olives, and/or a couple of chopped anchovies and/or a few torn fresh basil leaves. Pile on to the bread and serve as a starter, either on its own or with other antipasti."
    ],
    "tips": [
        
    ],
    "title": "Fresh tomato salsa (with bruschetta variations)",
    "videos": "[]"
}