{
    "author": {
        "simon_hopkinson": "Simon Hopkinson"
    },
    "cookTime": "10 to 30 mins",
    "description": "Gruyère works well in this recipe as it has a lovely melting quality, but you can use another cheese if preferred.",
    "dishes": [
        "bread",
        "ham",
        "sandwich",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/fried_ham_and_cheese_34474_16x9.jpg"
    ],
    "ingredients": {
        "For the sandwich": [
            "4 slices thin white bread (square)",
            "4 thin slices cooked ham",
            "olive oil"
        ],
        "For the sandwich filling": [
            "250g/9oz gruyère cheese, grated",
            "2 free-range egg yolks",
            "1 tbsp Worcestershire sauce",
            "1 tsp mustard powder",
            "2 pinches cayenne pepper",
            "dash cream (if mixture is too thick to spread)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "39",
    "serves": "Serves 2",
    "show": {
        "b012gg69": "The Good Cook"
    },
    "steps": [
        "Put all the sandwich filling ingredients (except the cream) into a food processor and blend until smooth (the mixtuer should spread easily, but add a little cream if needed.)",
        "Cover four slices of bread with a thin layer of cheese mixture almost to the edge, place a slice of ham over that and then finally place another slice of bread on to the ham. Press down firmly and then repeat the process for the second sandwich. Cut off the crusts and liberally brush (or spray) each side of the sandwiches with olive oil.",
        "Cut each sandwich in half to give four rectangles. Heat a large, non-stick frying pan until medium-hot and fry the sandwiches in the dry pan until gorgeously golden-brown and crusted on each side - about two minutes per side."
    ],
    "tips": [
        "Add a shake of Tabasco sauce to the filling for an extra kick. You can also spread a little mustard on the other slice of bread if desired."
    ],
    "title": "Fried ham and cheese sandwich",
    "videos": "[]"
}