{
    "author": {
        "raymond_blanc": "Raymond Blanc"
    },
    "cookTime": "no cooking required",
    "description": "A new dish is always an exciting and rewarding moment for any cook, but there is a lot of trial and error to get it just right. After countless re-working, I think this recipe is the perfect iced tart. It’s a little bit demanding but worth the challenge – both in terms of appearance and flavour. Equipment and preparation: for this recipe you will need: 4 x 7.5cm/3in pastry rings and 4 x 6cm/2½in pastry rings; a 25x5cm/10x2in piece of acetate to line the insides of the frame; and a squeezy plastic bottle.",
    "dishes": [
        "fruit_tart",
        "jam",
        "meringue",
        "pastry",
        "pie",
        "sorbet",
        "tarts",
        "upside-down_cake"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the crème Chantilly": [
            "100g/3½oz whipping cream",
            "large pinch of stevia powder",
            "½ tsp vanilla purée or good-quality vanilla extract"
        ],
        "For the sorbet": [
            "450g/14oz strawberries (my favourites are Buddy, Gariguette, Royal Sovereign or Mara des Bois), stalks removed",
            "1 tsp stevia powder",
            "dash of lemon juice"
        ],
        "For the tart filling": [
            "200g/7oz strawberries (Buddy, Gariguette, Royal Sovereign or Mara des Bois), cut into small dice",
            "large pinch of stevia powder"
        ],
        "To serve": [
            "50g/1¾oz miniature meringues, crush 4–6 of them",
            "100g/3½oz low-sugar strawberry jam",
            "4 mint sprigs",
            "6 strawberries, halved"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b05n91p4": "Kew on a Plate"
    },
    "steps": [
        "Take four 7.5cm/3in pastry rings and tightly stretch cling film over the top of each one, then turn them upside down; these will become the frames for the tarts. Line a tray with greaseproof paper, place the pastry rings on the tray with the cling film on the bottom, line the insides with the acetate plastic and transfer to the freezer.",
        "For the sorbet, in a large bowl macerate the strawberries with the stevia and lemon juice for 30 minutes. Macerating the strawberries will give the sorbet much more flavour.",
        "Blend the strawberries to a purée. Set aside 150g/5oz of the purée and pour the remainder into a squeezy plastic bottle. Squeeze the purée into the bottom of each frozen pastry ring until you have 5mm layer covering the bottom. Return the tray to the freezer and freeze for 30 minutes, or until frozen solid.",
        "Remove from the freezer and place a 6cm/2½in pastry ring centrally on top of each circle of frozen purée. Gently press it down so that it just indents the base. Squeeze more purée into the gap between the two rings, to create a wall 2cm/¾in high.",
        "Place back in the freezer and leave to freeze for at least 2 hours, or until solid. (The steps up to this stage can be done a few days in advance.) Place 4 serving plates in the freezer 1 hour prior to serving.",
        "For the tart filling, in a bowl macerate the strawberries with the stevia for 30 minutes.",
        "Meanwhile, make the crème Chantilly by whipping the cream with the stevia and vanilla purée or extract, until firm peaks form when the whisk is removed. (Beware, if you over-whip the cream, it will separate and you will create butter!)",
        "Mix 100g/3½oz of the reserved purée with the macerated strawberries. Fold half the macerated strawberries through the Chantilly cream. Reserve the other half for decorating.",
        "Take one sorbet out of the freezer. Remove the inner pastry ring by rubbing your fingers around the inside to soften the sorbet behind it slightly and enable you to gently lift off the ring. Now lift off the outer pastry ring and gently peel away the acetate surrounding the sorbet. Return each sorbet case to a baking tray in the freezer as you repeat this process for the remaining sorbets.",
        "When ready to serve, remove the plates from the freezer and place a small amount of the crushed meringue in the centre of each plate to stop the tarts from sliding around, then cover with a frozen sorbet case.",
        "Place a spoonful of the jam in the bottom of each sorbet case, followed by the strawberry and Chantilly cream mix. Finish each tart with a spoonful of the reserved macerated strawberries, followed by a few whole meringues and mint leaves. Drizzle the remaining reserved purée around each tart, place a few halved strawberries on the plates and serve immediately."
    ],
    "tips": [
        "You will notice that I’ve replaced sugar with stevia. Actually at one stage I believed I’d discovered stevia. Seven years ago I tasted a very sweet plant and thought that it was completely unique; it tasted at least 20 times sweeter than sugar. Then when I started to read about stevia, I discovered it had no calories and didn’t raise your blood sugar level. I spent days trying to make the herb into syrups and to crystallise it. Except that… I went to my local retailer and there it was on the shelf, transformed into a sweetener that is actually 250 times sweeter than sugar! Many people claim that stevia has got a particular flavour that interferes with cooking; I generally disagree. It takes a very special palate to tell the difference and I’ve tried it on many people. If you use stevia, ensure that you don’t mistake it for ‘truvia’ which is stevia mixed with quite a large amount of sugar. Of course, stevia doesn’t have the same properties as sugar so what stevia can’t do is recreate the beauty of a whipped meringue!"
    ],
    "title": "Frozen strawberry tartlets with vanilla whipped cream and meringue",
    "videos": "[]"
}