{
    "title": "Fruit tarts",
    "cookTime": "10 to 30 mins",
    "prepTime": "1-2 hours",
    "serves": "Makes 12",
    "recommendations": "13",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/fruit_tarts_45402_16x9.jpg"
    ],
    "description": "These light sweet pastry and crème pâtissière tarts are simple to make and look stunning. Use your own favourite fruits.",
    "author": {
        "richard_bertinet": "Richard Bertinet"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        "You'll need 12 x 8cm/3in loose-bottomed tart tins. If you're short of time forgo making your own pastry and buy ready-made pastry cases (available from most supermarkets)."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the sweet pastry": [
            "350g/12oz plain flour",
            "pinch salt",
            "125g/4½oz unsalted butter, flattened out in between two sheets of greaseproof paper to 1cm/½in thick, chilled in the fridge",
            "125g/4½oz caster sugar",
            "2 free-range eggs, whole and 1 egg, yolk only",
            "1 egg, yolk only, beaten for egg-wash"
        ],
        "For crème pâtissière": [
            "500ml/18fl oz full fat milk",
            "2 vanilla pods, seeds removed and pods retained",
            "6 free-range eggs, yolks only",
            "120g/4½oz caster sugar",
            "50g/2oz plain flour",
            "4 tbsp kirsch"
        ],
        "Ingredients for the toppings": [
            "400g/14oz strawberries",
            "100g/3½oz redcurrants",
            "100g/3½oz whitecurrants",
            "100g/3½oz blackberries"
        ],
        "To serve": [
            "4 tbsp clear apricot jam",
            "75g/2¾oz mint tips",
            "50g/2oz icing sugar",
            "100g/3½oz green shelled pistachios, roughly chopped"
        ]
    },
    "steps": [
        "For the sweet pastry, preheat the oven to 190C/350F/Gas 5.",
        "Lightly grease and flour 12 x 8cm/3¼in loose bottomed tins.",
        "Stir the flour and salt together in a large mixing bowl. Add the flattened butter straight from the fridge into the flour and rub in the mixture.",
        "Add the sugar, mix together the eggs and egg yolk, and to the mixture. Gently mix with a dough scraper, or spatula, until the dough comes together in a ball.",
        "Lightly flour a work surface, tip the pastry ball out onto it, and knead until you have a smooth soft dough. Shape the pastry into a square, to make it easier to roll out.",
        "Place the dough the fridge to chill for an hour minimum, preferably overnight.",
        "Remove the pastry from the fridge and lightly flour a work surface. Roll out the pastry 2-3mm thick and line the 12 tins, leaving an overhang of pastry. Place some greaseproof paper over the top and fill with baking beans. Rest in the fridge for 30 minutes.",
        "Once chilled, place the pastry tart cases on a baking sheet and cook for 15 minutes. Lift out the paper and beans, brush with beaten egg yolk, and place back in the oven for 8 minutes.",
        "Remove from the oven and allow to cool for 15 minutes. Then trim the edges and lift out onto a cooling rack.",
        "For the crème patissière, place the milk, vanilla seeds and pods into a large saucepan and warm though.",
        "Place the eggs, sugar and flour in a large mixing bowl and whisk until the colour changes and becomes pale. Gradually add the warm milk and vanilla to the egg mixture, whisk together, then return the mixture to the pan. Cook on a low heat until it the mixture thickens, then pour into a clean bowl. Place a circle of greaseproof paper on the mixture, to stop a skin forming.",
        "If you would like to flavour the crème with kirsch, add it to the crème once it is cold.",
        "To make up the fruit tarts, spoon the crème patissière in a piping bag, and pipe into the pastry cases. Top the tarts with the strawberries, redcurrants or whitecurrants and blackberries.",
        "Put the apricot jam and 1-2 tablespoons of water in a small sauce pan and warm it through, so it loosens up and becomes more liquid. Lightly brush the fruit to glaze.",
        "To serve, place the tarts on a cake stand and dust with icing sugar, and garnish with mint tips or pistachios."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}