{
    "title": "Galaktoboureko with orange syrup",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/galaktoboureko_with_27774_16x9.jpg"
    ],
    "description": "The Greeks love their sweets, and this one is almost as central to their cooking culture as baklava or rice pudding. It is quite common to add an orange sauce to galaktoboureko. I made this one typically sweet and sticky.",
    "author": {
        "rick_stein": "Rick Stein"
    },
    "show": {
        "b0667qf6": "Rick Stein: From Venice to Istanbul"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the custard pastry": [
            "100g/3½oz unsalted butter, melted, plus extra for greasing",
            "3 free-range eggs, separated",
            "125g/4½oz golden caster sugar",
            "½ tsp vanilla extract",
            "90g/3¼oz semolina",
            "1 litre/1¾ pint full-fat milk, warmed",
            "7 sheets filo pastry"
        ],
        "For the oranges in syrup": [
            "3 oranges",
            "440g/15½oz caster sugar",
            "2 tbsp lemon juice"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4. Lightly grease a 20cm/8in springform cake tin.",
        "In a large bowl, whisk together the egg yolks, golden caster sugar and vanilla extract with an electric whisk until pale and creamy. Gradually beat in the semolina and the warmed milk. Put this mixture into a clean pan and cook over a low heat for up to 10 minutes until thickened, stirring constantly.",
        "In a clean bowl, whisk the egg whites using an electric whisk until stiff but not dry peaks form when the whisk is removed. Loosen the semolina custard with a spoonful of the egg whites, then fold in the rest.",
        "Brush each sheet of filo pastry with the melted butter and lay in the springform tin, alternating the direction the excess will drape over the sides (don’t trim it off), until you’ve used 6 sheets.",
        "Pour the custard mixture into the pastry-lined tin and fold the overhanging sheets over the top, tucking in the ends. Place the final sheet of filo, buttered and folded in half, on top. Tuck in the sides and butter the top.",
        "Bake for 45–50 minutes until the custard mixture has set. Check after 30 minutes and cover with foil if the top is getting too brown.",
        "Zest the oranges, then peel them and cut the fruit across into thin slices, removing excess pith.",
        "Heat the caster sugar and 190ml/6¾fl oz water in a pan. When the sugar has dissolved, add the orange zest and lemon juice and simmer for 8–10 minutes until you have a thick syrup. Add the orange slices to the syrup, then set aside.",
        "Allow the pie to cool to room temperature before releasing from the tin. Cut into slices using a serrated knife and serve with the oranges in syrup."
    ],
    "howTos": [
        "whisking_egg_whites"
    ],
    "videos": "[]"
}