{
    "author": {
        "james_tanner": "James Tanner"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "jam",
        "oven-baked_dishes",
        "pie"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the ostrich": [
            "1 tbsp olive oil",
            "100g/3½oz ostrich steak",
            "salt and freshly ground black pepper",
            "2 garlic cloves, lightly crushed with the flat of a knife",
            "3 sprigs fresh rosemary"
        ],
        "For the potatoes": [
            "100g/3½oz new potatoes",
            "2 tbsp olive oil",
            "2 garlic cloves, lightly crushed with the flat of a knife",
            "salt and freshly ground black pepper"
        ],
        "For the roasted vine tomatoes": [
            "2 tbsp olive oil",
            "150g/5½oz vine tomatoes",
            "2 sprigs fresh thyme",
            "2 sprigs fresh rosemary",
            "2 tsp balsamic vinegar",
            "50g/2oz green beans, blanched, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the ostrich, heat the oil in an ovenproof frying pan and season the steak well with salt and freshly ground black pepper. Place into the pan with the garlic and rosemary and sear on all sides. Transfer to the oven to continue cooking for about 6-8 minutes, or until cooked to your liking.",
        "For the sautéed potatoes, cut the potatoes into 1cm/½in thick slices. Heat the oil in an ovenproof frying pan and add the potatoes, garlic and salt and freshly ground black pepper. Fry until the potatoes begin to colour. Transfer to the oven to continue cooking for about five minutes, until tender.",
        "For the roast tomatoes, heat the oil in an ovenproof frying pan. Add the tomatoes and herbs to the pan and sear on all sides. Sprinkle over the balsamic vinegar and transfer to the oven to cook for about six minutes, or until soft.",
        "To serve, cut the ostrich into three pieces and place onto a serving plate with the sautéed potatoes, green beans and roasted tomatoes."
    ],
    "tips": [
        
    ],
    "title": "Garlic and rosemary roasted ostrich with sautéed potatoes and vine tomatoes",
    "videos": "[]"
}