{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Spanish",
    "description": "Easy to throw together, refreshingly moreish and cheap as chips, this chilled soup has everything going for it.",
    "dishes": [
        "canape",
        "chips",
        "soup",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/gazpacho_hispaniola_04615_16x9.jpg"
    ],
    "ingredients": {
        "For the gazpacho": [
            "1 litre/1.7 pints eight vegetable-based juice, such as V8 (available from larger supermarkets)",
            "4 spring onions, trimmed, sliced",
            "2 garlic cloves, peeled, crushed",
            "½ cucumber, peeled, chopped",
            "1 small red onion, peeled, chopped",
            "½ red pepper, stalk and seeds removed, chopped",
            "½ green pepper, stalk and seeds removed, chopped",
            "2 tbsp sherry vinegar",
            "salt and white pepper",
            "4 tbsp extra virgin olive oil, plus extra to serve"
        ],
        "To serve": [
            "8-10 quails' eggs (optional)",
            "handful small basil leaves, finely shredded",
            "small bag lightly toasted croûtons (optional)"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "4",
    "serves": "Serves 4",
    "show": {
        "b01qkkjj": "Hairy Bikers Everyday Gourmets"
    },
    "steps": [
        "For the gazpacho, blend all of the gazpacho ingredients to a smooth purée in a blender or food processor and chill in the fridge overnight.",
        "Just before serving, bring a pan of water to the boil and hard-boil the quails’ eggs for three minutes (if using). Run the quails’ eggs under cold water. When cool, peel away the shells and chop the eggs (or just cut them in half).",
        "Stir the basil into the gazpacho.",
        "To serve, pour the gazpacho into bowls and sprinkle over the croûtons, if using. Garnish with the quails’ egg and a drizzle of olive oil."
    ],
    "tips": [
        "This dish can be served as a canapé or amuse bouche. Pour it into shot glasses or espresso cups and garnish with chopped boiled quails’ eggs, a drizzle of olive oil and a small basil leaf. The quantities in this recipe will serve 8-10 people in this way."
    ],
    "title": "Gazpacho Hispaniola",
    "videos": "[]"
}