{
    "title": "Gingerbread cupcakes with salted caramel icing",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 15 cupcakes",
    "recommendations": "54",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/gingerbread_cupcakes_24180_16x9.jpg"
    ],
    "description": "These ginger and nutmeg-spiced cupcakes are a delicious alternative to vanilla.",
    "author": {
        
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "140g/5oz unsalted butter",
            "200g/7oz golden caster sugar",
            "60g/2¼oz black treacle",
            "60g/2¼oz golden syrup",
            "2 free-range eggs, plus 2 free-range egg yolks",
            "300g/10½oz plain flour",
            "1 tsp ground ginger",
            "1 tsp ground nutmeg",
            "2 tsp baking powder",
            "1 tsp salt",
            "240ml/8½fl oz milk, warmed"
        ],
        "For the salted caramel buttercream": [
            "125g/4½oz white caster sugar",
            "80ml/2½fl oz double cream",
            "½ tsp salt (or to taste)",
            "1 tsp vanilla extract",
            "160g/5¾oz salted butter, softened",
            "200g/7oz icing sugar"
        ]
    },
    "steps": [
        "Preheat the oven to 190C/375F/Gas 5. Line two 12-hole muffin tray with 15 paper cases.",
        "Beat the butter and sugar together in a bowl until light and creamy. Beat in the treacle, syrup, eggs and egg yolks until well combined.",
        "Sift together the flour, ginger, nutmeg, baking powder and salt. Add half of the flour mixture to the butter mixture, then beat in half of the warm milk. Add the remaining flour mixture and the remaining milk and beat until well combined.",
        "Spoon the mixture into the muffin cases and bake for 20-25 minutes, or until well risen and lightly firm to the touch. Remove the cakes from the tin and set aside to cool on a cooling rack.",
        "For the salted caramel buttercream, heat the caster sugar and four tablespoons of water in a saucepan over a gentle heat until the sugar has dissolved, then increase the heat and cook the caramel for 2-3 minutes, or until golden and slightly thickened. Remove the pan from the heat immediately and stir in the cream. (CAUTION: the caramel may splutter a little when you add the cream.) Stir in the salt and vanilla and set aside to cool completely.",
        "Cream the butter and icing sugar together for at least 4- 5 minutes, then beat in the caramel. When combined pipe or spread the icing over the cup cakes and sprinkle with a little extra sea salt.",
        "Decorate the cupcakes with the buttercream."
    ],
    "howTos": [
        "ice_cupcakes"
    ],
    "videos": "[]"
}