{
    "author": {
        "kitty_hope_and_mark_greenwood": "Kitty Hope and Mark Greenwood"
    },
    "cookTime": "10 to 30 mins",
    "description": "The comfort and spice of gingerbread, folded into a smooth fudge along with cream and coffee, then decorated with a frothy marbled topping.",
    "dishes": [
        "cake",
        "fudge",
        "gingerbread",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/gingerbread_latte_fudge_68292_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "50g/1¾oz unsalted butter, plus extra for greasing",
            "75g/2½oz sticky ginger cake, thinly sliced",
            "500g/1lb 2oz caster sugar",
            "150ml/5fl oz double cream",
            "135ml/4½fl oz full-fat milk",
            "1 tsp ground ginger",
            "2 tsp ground espresso coffee"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "",
    "serves": "Makes about 50 pieces of fudge",
    "show": {
        "b04d9lns": "Sweets Made Simple"
    },
    "steps": [
        "Butter a 17cm/7in square tin and line it with baking parchment. Preheat the grill to medium.",
        "Lay the ginger cake slices on a baking sheet. Grill until toasted, turning over once one side is done. Allow to cool and then chop it up roughly.",
        "Now put the sugar, cream, milk and 50ml/2fl oz boiling water in the centre of a large, deep pan (24cm/9½ in diameter). Heat gently over a very low heat for about 15 minutes, or until the butter has melted and the sugar has dissolved. Check by giving the mixture a stir with a wooden spoon, remove the spoon and examine the back of it - any remaining granules should be visible.",
        "Put a sugar thermometer into the pan and turn up the heat until the mixture starts to bubble. Hold it at this simmering point, adjusting the heat accordingly, and cook until the mixture reaches 116C/241F. If you don’t have a thermometer, cook at this steady pace for about 15 minutes. (CAUTION: boiling sugar is extremely hot. Handle very carefully and do not leave unattended.)",
        "As soon as the temperature has been reached, pour about a quarter of the mixture into a metal bowl.",
        "Add the ginger and coffee to the mixture still in the pan and beat it in for about a minute.",
        "Next, stir in the chopped ginger cake and beat well for a few minutes more until the mixture has cooled a little and it starts to thicken round the edge. It’ll be coming away from the edges of the pan by this stage.",
        "Pour into the prepared tin. Give the reserved plain fudge mixture in the bowl a quick beat and spoon dollops over the top. Use a skewer to marble the two layers – it should look fluffy like a latte on top. Allow to cool at room temperature for a couple of hours, or refrigerate for 30 minutes. Cut into squares and eat."
    ],
    "tips": [
        
    ],
    "title": "Gingerbread latte fudge",
    "videos": "[]"
}