{
    "title": "Goats' cheese and onion tarts",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "15",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/goats_cheese_and_onion_51943_16x9.jpg"
    ],
    "description": "Served with a lemony rocket salad, these delicious tarts make a great summer dish. Equipment and preparation: For this recipe you will need 4 x 10cm/4in loose-bottomed tart tins.",
    "author": {
        "lisa_faulkner": "Lisa Faulkner"
    },
    "show": {
        "b007mtf0": "Celebrity MasterChef"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pastry": [
            "small sprig fresh thyme, leaves only",
            "100g/4oz plain flour",
            "25g/1oz butter",
            "25g/1oz lard"
        ],
        "For the red onion jam": [
            "2 red onions, finely sliced",
            "25g/1oz butter",
            "25g/1oz soft brown sugar",
            "1 tbsp balsamic vinegar",
            "1-2 tbsp cassis",
            "salt and freshly ground black pepper"
        ],
        "For the goats’ cheese": [
            "175g/6oz goats’ cheese",
            "1 free-range egg yolk",
            "1-2 tbsp double cream"
        ],
        "For the salad": [
            "2 tbsp olive oil",
            "2 tsp lemon juice",
            "handful rocket leaves"
        ]
    },
    "steps": [
        "For the pastry, put the thyme leaves, flour, butter and lard into a food processor and mix on pulse setting until the mixture resembles breadcrumbs. Gradually add enough cold water (about 2-3 tablespoons) to form a soft dough. Wrap in cling film and leave in the fridge to chill for 30 minutes.",
        "For the red onion jam, cook all the ingredients over a very low heat in a frying pan, stirring occasionally so that they don't clump together.",
        "Preheat the oven to 200C/390F/Gas 6 and place a sturdy baking tray in the oven.",
        "Divide the pastry into four. Using a rolling pin, roll it out and line 4 x 10cm/4in loose-bottomed tart tins. Line the tins with greaseproof paper and baking beans.",
        "Place the tins on the heated baking tray and cook for 10 minutes. Remove the beans and lining paper and return to the oven for five minutes. Leave to cool for few minutes.",
        "For the goats’ cheese, trim away any rind and crumble the cheese into a bowl. Mix with the egg yolk and a splash of cream. Season with salt and freshly ground black pepper.",
        "Divide the red onion jam among the tartlets and spoon the goats’ cheese mixture on top. Return to the oven for 7-8 minutes, or until the top is bubbling and tinged with brown.",
        "Pour oil and lemon juice into a bowl and season with plenty of salt and freshly ground black pepper. Add the leaves and toss gently to coat.",
        "To serve, carefully remove the tarts from their tins and place on a serving plate. Top with the rocket salad and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}