{
    "author": {
        "emma_crowhurst": "Emma Crowhurst"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "",
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "folding"
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "450g/1lb green gooseberries topped and tailed",
            "4 tbsp water",
            "10 heads elderflower",
            "4 tbsp granulated sugar",
            "1 thick strip of lemon rind",
            "290ml/½ pint crème fraîche",
            "sprigs of lemon balm, mint or elderflower",
            "muslin to make the elderflower infusion"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4-6",
    "show": {
        "p0077hw4": "Food and Drink"
    },
    "steps": [
        "Place the gooseberries in a large pan with the water and bring to the boil. Cook gently until the gooseberries begin to soften and release their juices.",
        "Wrap the elderflower heads in muslin, tie and push into the gooseberries. Allow to simmer gently for 15 minutes.",
        "Roughly mash the gooseberry mixture with a fork or potato masher, or lightly pulse in a food processor. Tip into a bowl and set aside to cool.",
        "Remove the elderflower infusion from the gooseberries and squeeze all the juices back into the bowl. Discard the muslin bag. Spoon a quarter of the gooseberry pureé into a small bowl and set aside.",
        "Add the crème fraîche to the remaining gooseberry pureé and gently fold it in.",
        "Spoon the reserved gooseberry pureé between the serving glasses. Layer the fool mixture on top of that and place the glasses in the fridge to chill until they are needed.",
        "To serve each fool decorate with sprigs of lemon balm, mint or elderflower berries and serve with sponge fingers, if liked."
    ],
    "tips": [
        
    ],
    "title": "Gooseberry and elderflower fool",
    "videos": "[]"
}