{
    "title": "Teriyaki chicken with leek and pepper stir-fry",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "11",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/grilledteriakichicke_80048_16x9.jpg"
    ],
    "description": "Chicken thighs are more flavourful than breasts and a lot cheaper, perfect if you're solo cooking on a budget. Each serving provides 404kcal, 23g protein, 20g carbohydrate (of which 20g sugars), 25g fat (of which 4g saturates), 2.6g fibre and 2.3g salt.",
    "author": {
        "brian_turner": "Brian Turner"
    },
    "show": {
        
    },
    "tips": [
        "You may not think of honey as a store cupboard ingredient but it is great for helping to get a sweet and sour balance in Asian cooking."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the chicken": [
            "1 tbsp sesame oil",
            "1 tbsp honey",
            "1 tbsp soy sauce",
            "100g/3½oz chicken thigh meat, scored with a sharp knife"
        ],
        "For the stir-fry": [
            "1 tbsp olive oil",
            "1 garlic clove, thinly sliced",
            "¼ leek, sliced into long thin strips",
            "¼ red pepper, sliced into long thin strips"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "For the chicken, mix the sesame oil, honey and soy sauce together in a large bowl. Cover the chicken in the marinade and leave for 5 minutes.",
        "Heat a frying pan until hot. Remove the chicken from the marinade, reserve the marinade mixture. Fry the chicken for 2-3 minutes on each side. Transfer the chicken to the oven and roast for 5 minutes, or until cooked through.",
        "To make the stir-fry, heat the oil in a small frying pan. Add the garlic, leeks and pepper and cook until soft. Pour in the marinade mixture and bring to a simmer, continue to cook until the mixture is thick.",
        "Spoon the stir fried vegetables into the centre of a plate, put the chicken on top and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}