{
    "author": {
        "george_calombaris": "George Calombaris"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "What could be better than crisp squid and watermelon on a hot summer's day? Serve it with a glass of something cold when you have friends round.",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "salad",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "¼ small watermelon, skin removed and reserved",
            "100ml/3½fl oz sherry vinegar",
            "100g/3½oz clear honey",
            "50g/1¾oz vine leaves in brine, dried out in a low oven",
            "2 tbsp extra virgin olive oil, plus extra to garnish",
            "500g/1lb 2oz squid, cleaned, scored and cut into bite-sized pieces, tentacles reserved",
            "200g/7oz green olives",
            "200g/7oz goats’ curd, broken into small pieces",
            "salt flakes and cracked black pepper",
            "flat leaf parsley, to garnish"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Cut the watermelon flesh into rectangles about 15x5cm/6x2in. Store in the fridge until needed. Cut out circles from the skin using a 2-3cm cutter.",
        "Place the sherry vinegar and honey in a small saucepan and heat for 2-3 minutes. Remove from the heat and add the cut skin of the watermelon. Set aside.",
        "Meanwhile, heat a griddle pan until hot. Drizzle the olive oil over the squid and season with salt and pepper. Grill the squid and tentacles until lightly charred and the flesh is no longer transparent.",
        "Arrange the watermelon, olives and goat’s curd on serving plates. Put the calamari and crisp vine leaves on top and finish with parsley leaves, a drizzle of olive oil and a final grinding of salt and pepper. Finish with the circles of melon rind."
    ],
    "tips": [
        
    ],
    "title": "Grilled calamari, watermelon, olives, goats’ curd and crisp vine leaves",
    "videos": "[]"
}