{
    "title": "Grilled skate with spring lamb shoulder ragoût and salt-crust Jersey Royals",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "If you can get hold of it, sea purslane seaweed adds tremendous depth to fish dishes. It also works surprisingly well in meat stews - as demonstrated in this impressive dinner party recipe.",
    "author": {
        "shaun_rankin": "Shaun Rankin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the spring lamb shoulder ragoût": [
            "2 tbsp vegetable oil",
            "500g/1lb 2oz diced lamb shoulder",
            "60g/2¼oz diced shallot",
            "10 sprigs picked thyme",
            "25g/1oz garlic",
            "25g/1oz tomato purée",
            "250g/9oz peeled tomatoes",
            "150g/5½oz brown chicken stock",
            "200g/7oz cooked barley",
            "30g/1oz sea purslane",
            "50g/2oz garden peas",
            "50g/2oz fresh broad beans, blanched"
        ],
        "For the salt-crust Jersey Royals": [
            "800g/1lb 12oz plain flour",
            "7-8 free-range egg whites",
            "350g/12oz table salt",
            "10 medium-sized Jersey Royal potatoes",
            "5 sprigs fresh mint",
            "50g/1¾oz fresh edible seaweed"
        ],
        "For the grilled skate": [
            "¼ skate wing (about 50g/2oz), skin off",
            "50g/1¾oz butter",
            "1 tbsp olive oil",
            "¼ lemon, juice only"
        ]
    },
    "steps": [
        "For the spring lamb shoulder ragoût, heat two tablespoon of vegetable oil in a medium-sized pan and brown small batches of the lamb shoulder in the pan. Once browned, place the meat into a fine metal sieve to drain.",
        "Add the shallot and thyme to the same pan you used to brown the meat. After two minutes, add the garlic.",
        "Add the tomato purée and cook for two minutes.",
        "Stir in the fresh peeled tomatoes and chicken stock.",
        "Simmer for one hour, or until the meat is tender.",
        "Once the lamb is cooked, remove it from the cooking liquor with a slotted spoon and use a fork to break the meat up. If the cooking liquor looks like it needs to be thickened more to be a sauce consistency, continue to simmer until thickened. Set aside the cooking liquor and lamb.",
        "For the salt-crust Jersey Royals, preheat the oven to 180C/350F/Gas 4. Make the salt crust by mixing the flour, 175ml/6fl oz water, egg whites and salt until they form a wet pastry.",
        "Clean the Jersey Royals under a cold tab with a sponge to remove the bitter outer skin.",
        "Once the potatoes are cleaned, dry them with kitchen paper.",
        "Cut the pastry into two and roll out to a 3cm/1¼in thickness.",
        "Place one piece of pastry onto a tray lined with greaseproof paper.",
        "Place the Jersey Royals on top with the mint and seaweed covering them",
        "Place the second layer of the pastry on top and seal with a little water at the edges",
        "Cook the potatoes for 30-45 minutes in the oven.",
        "For the grilled skate, preheat the grill to hot. Place the skate wing onto a baking tray. Spread the butter onto the skate, drizzle over the olive oil and squeeze over the lemon juice. Place under the grill for around four minutes, or until cooked.",
        "To finish the ragoût, place the lamb and enough of the liquor to cover into a pan, add the cooked barley, sea purslane, garden peas and broad beans and warm through.",
        "To serve, spoon the lamb ragoût onto each of four plates. Carefully remove the meat from the skate wing and place on top of the ragoût.",
        "Serve with the salt-baked Jersey Royals."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}