{
    "author": {
        
    },
    "cookTime": "no cooking required",
    "description": "This puff-pastry smoked fish parcel is perfect for little pirates to make and enjoy.",
    "dishes": [
        "oven-baked_dishes",
        "pastry",
        "pie",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "50g/2oz fresh skinless boneless smoked haddock",
            "1 tbsp crème fraiche",
            "pinch of ground black pepper",
            "handful watercress",
            "125g/4½oz puff pastry"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        
    },
    "steps": [
        "Before cooking, wash your hands and put on an apron. Weigh or measure all the ingredients. Ask a grown-up to preheat the oven to 220C/425F/Gas 8.",
        "Ask a grown-up to help you to use the scissors to cut up the haddock into bite-sized pieces, double checking for bones as you go. Put the fish into a mixing bowl and then add the crème fraiche. Add a pinch of ground black pepper.",
        "Wash the watercress and dry it off on a tea towel. Tear the leaves off the stalks and put in the mixing bowl with the crème fraiche and fish. Stir and put the bowl to one side.",
        "Flour your work surface. Roll out the pastry on the floured surface into a rectangle, about 5mm thick and about 15mm x 21mm/6in x 8in (roughly the size of a sheet of A5 paper).",
        "With the pastry positioned with the short edge closest to you, place the fish mixture onto the bottom half of the rectangle, leaving a 1cm/½in border around the edges. Brush the edges of the pastry with a little water - this will help them stick together. Bring the top half of the pastry down to cover the mixture like an envelope. Fold and press the edges together firmly with your fingers. Trim the edges with a table knife and make a small slit in the top to let the steam out.",
        "Ask a grown-up to put the parcel on a baking sheet with some baking paper and bake for 25–30 minutes or until golden-brown. Serve with carrot batons and cherry tomatoes."
    ],
    "tips": [
        
    ],
    "title": "Haddock puff",
    "videos": "[]"
}