{
    "author": {
        "jos_pizarro": "José Pizarro"
    },
    "cookTime": "10 to 30 mins",
    "description": "Great flavours combined into a winning weekend meal – fish in batter served with rich lentils and homemade mayo.",
    "dishes": [
        "jam",
        "mayonnaise",
        "pie",
        "sauce",
        "seafood",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the fish": [
            "olive oil, for frying",
            "4 x 170g/6oz hake portions",
            "100g/3½oz plain flour, for coating",
            "2 large free-range eggs, beaten",
            "sea salt and freshly ground black pepper"
        ],
        "For the mayonnaise": [
            "1 large free-range egg yolk, at room temperature",
            "1 tbsp lemon juice",
            "½ tsp Dijon mustard",
            "sea salt flakes",
            "75ml/2½fl oz extra virgin olive oil",
            "75ml/2½fl oz sunflower oil",
            "2 tbsp chopped parsley"
        ],
        "For the sautéed lentils": [
            "1 tbsp extra-virgin olive oil",
            "1 shallot, finely chopped",
            "1 carrot, finely chopped",
            "1 bay leaf",
            "150g/5½oz dried small green lentils",
            "500ml/18fl oz chicken stock, cold",
            "sea salt and freshly ground black pepper",
            "40g/1½oz baby spinach",
            "50g/1¾oz jamón iberico, cut into1cm/½in cubes"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "To make the sautéed lentils, heat the oil in a saucepan and fry the shallot, carrot and bay leaf until they begin to turn golden-brown. Add the lentils and the cold chicken stock, give everything a good stir, and leave to cook for 20-25 minutes, or until the stock has reduced in volume. Remove the bay leaf and season with salt and pepper. Keep warm.",
        "For the mayonnaise, put the egg yolk, lemon juice, mustard and sea salt into a mixing bowl and lightly blend together. Gradually whisk in the oils, a little at a time, until you have produced a thick and silky smooth mayonnaise. Mix in the parsley.",
        "For the fish, pour 1cm/½in of olive oil into a large non-stick frying pan, placed over a medium heat, or you can also use a deep-fat fryer heated to 170C/340F (Caution: hot oil can be dangerous. Do not leave unattended).",
        "Coat the pieces of hake in flour, knock off the excess and then coat well in the beaten egg. Place into the hot oil and fry for about four minutes on each site, depending on the thickness of the fish, until golden-brown. Lift onto kitchen paper, and leave to drain.",
        "Finally, add the spinach to the lentils and allow it to wilt for a minute or so.",
        "To serve, divide the lentils among the serving plates. Place the hake on top. Add a tablespoon of lemon mayonnaise on top of the fish, and finally some of the jamón pieces."
    ],
    "tips": [
        
    ],
    "title": "Hake a la romana, sautéed lentils and jamón iberico, lemon and olive oil mayonnaise",
    "videos": "[]"
}