{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "less than 10 mins",
    "description": "There is something so compelling about this squeaky cheese, and my fridge is stocked with it at all times. Most regularly I treat it as vegetarian bacon, dry-fried in a hot pan then dolloped with a peeled, soft-boiled egg. But the idea for this recipe came to me one evening when I felt the need to counter the siren call of the halloumi’s saltiness with some sweet-and-heat.",
    "dishes": [
        "pie",
        "quick_snacks",
        "salad",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "To serve": [
            "salad leaves of your choice",
            "extra-virgin olive oil to taste"
        ],
        "default": [
            "3 fresh red chillies",
            "2 tbsp runny honey",
            "1 lime, halved",
            "225g/8oz block halloumi cheese, sliced into 8 pieces"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "steps": [
        "Slice 2 of the chillies, leaving the seeds in, then de-seed the third and chop it into fine dice (this is for full-on fieriness; you may de-seed more cautiously if you wish) and add to a small pan – ideally, the sort sold as a butter-melting pan – along with the honey, and squeeze in 1 teaspoon of lime juice from one half of the lime. Put the pan on the smallest ring on the hob and bring to a bubble, then turn the heat down low, and let it foam away for 4 minutes. Stir frequently and do not leave the pan unattended, otherwise it will foam over the hob. Remove from the heat.",
        "Before you turn to the halloumi, arrange a few salad leaves on 2 plates, and pour as much or as little oil over them as you want. Cut the remaining lime half into wedges, and pop one on each plate if so wished.",
        "Heat a cast-iron or heavy-based frying pan. When it’s hot, add the halloumi slices and cook them – without any oil in the pan – for 30–60 seconds until they are tiger-striped underneath, then turn the slices over and cook until the underside is patchily bronzed, too.",
        "Remove the halloumi to the salad-lined plates and spoon the lipstick-red pieces of chilli in their honeyed glaze over the cheese. Eat immediately. Not hard to do."
    ],
    "tips": [
        "I use a copper pixie-pan for the quick sauce – which takes all of 4 minutes – but if you don’t have one, just use a larger pan to make more and keep it afterwards in a sealed jar, heating up what you need on further occasions. It will keep in the fridge for up to 2 weeks."
    ],
    "title": "Halloumi with quick sweet chilli sauce",
    "videos": "[p039zkng:p039zknl]"
}