{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "A fish recipe that is unbelievably easy but so rich in flavour - the nutty brown butter lifts it to another level.",
    "dishes": [
        "bun",
        "jam",
        "oven-baked_dishes",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the beurre noisette and almonds": [
            "110g/4oz unsalted butter",
            "½ lemon, juice only",
            "4 tbsp flaked almonds, toasted",
            "4 tbsp capers, drained",
            "1 tbsp roughly chopped fresh flat leaf parsley",
            "1 tbsp roughly chopped fresh chervil"
        ],
        "For the trout": [
            "4 rainbow trout, cleaned and gutted",
            "salt and freshly ground black pepper",
            "½ bunch fresh chervil",
            "½ bunch fresh thyme",
            "½ bunch fresh rosemary",
            "2 lemons, sliced"
        ],
        "To serve": [
            "3 tbsp olive oil",
            "1 tbsp white wine vinegar",
            "1 tsp Dijon mustard",
            "25g/1oz watercress",
            "4 Baby Gem lettuce"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "For the trout, season the inside of the trout with salt and freshly ground black pepper.",
        "Stuff the trout with the herbs and sliced lemons.",
        "Heat the butter in a frying pan over a medium to high heat. When the butter is foaming, add the trout and fry for 1-2 minutes on each side.",
        "Transfer the trout to a baking tray and bake for another 4-5 minutes, or until cooked through.",
        "Remove and set aside to rest for one minute then peel off the skin, and remove the head.",
        "For the beurre noisette, heat a frying pan until hot, add the butter and heat until it turns a nut-brown colour.",
        "Add the lemon juice, toasted almonds, capers and herbs and a pinch of salt and freshly ground black pepper and then remove from the heat.",
        "In a small bowl whisk together the oil, vinegar and mustard.",
        "Place the salad leaves in a large bowl. Pour the dressing over the salad and mix just before serving.",
        "To serve, place each trout onto a warmed plate and spoon over the beurre noisette. Serve the salad alongside."
    ],
    "tips": [
        
    ],
    "title": "Herb-stuffed rainbow trout with beurre noisette and almonds",
    "videos": "[]"
}