{
    "author": {
        "jon_rotheram": "Jon Rotheram"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Carrots get the star treatment in this autumnal dish that's bursting with flavour and crunch.",
    "dishes": [
        "bun",
        "oven-baked_dishes",
        "pickle",
        "sauce",
        "toffee"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the heritage carrots, oats and hazelnuts": [
            "100g/3½oz oats, sieved",
            "50g/1¾oz blanched hazelnuts, roughly chopped, plus 4 hazelnuts, grated, for garnish",
            "1 tbsp grape seed oil",
            "1 bunch orange heritage carrots, leaves reserved",
            "2 tbsp olive oil",
            "1 tsp salt",
            "1 tbsp chopped fresh thyme leaves",
            "100ml/3½fl oz carrot juice",
            "30g/1oz butter",
            "60g/2¼oz cream"
        ],
        "For the pickled carrots": [
            "100ml/3½fl oz white wine vinegar",
            "50g/1¾oz caster sugar",
            "1 tbsp chopped fresh tarragon leaves",
            "10 coriander seeds",
            "1 star anise",
            "1 bunch yellow heritage carrots"
        ],
        "To serve": [
            "300g/11oz goats’ curd, mixed with a little milk",
            "nasturtium leaves, to garnish"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the pickled carrots, put the vinegar, sugar, tarragon, coriander seeds and star anise in a medium saucepan with 50ml/2fl oz water and heat until the sugar has melted.",
        "Heat a large saucepan of boiling water and blanch the yellow carrots until cooked but still with a little crunch. Place in iced water, drain, then put them into the pickling solution.",
        "For the oats and hazelnuts, preheat the oven to 150C/300F/Gas 2.",
        "Spread the oats and chopped hazelnuts out on a large baking tray and drizzle over the grape seed oil. Roast for 10-15 minutes, or until golden-brown, then set aside.",
        "Increase the oven temperature to 170C/340F/Gas 3½.",
        "Place the orange carrots on a separate baking tray, drizzle with the oil and sprinkle over the salt and thyme. Roast for 20-25 minutes.",
        "Meanwhile, heat the carrot juice in a pan until reduced in volume to a sticky consistency.",
        "Heat the butter and cream in a separate large saucepan and whisk continually. Reduce it in volume and cook until it turns a toffee brown colour. Add it to the reduced carrot juice.",
        "Drain the pickled carrots from the pickling liquid.",
        "Serve the goat’s curd, pickled carrots, roasted carrots, oats, nuts, carrot leaves and nasturtium leaves dressed with the carrot juice and garnished with the grated hazelnuts."
    ],
    "tips": [
        
    ],
    "title": "Heritage carrots, goats’ curd, oats and hazelnuts",
    "videos": "[]"
}