{
    "author": {
        "lesley_waters": "Lesley Waters"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "apple_pie",
        "bread",
        "icing",
        "oven-baked_dishes",
        "pastry",
        "pie"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "kneading",
        "rubbing_in",
        "whipping_cream"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the apple pie": [
            "350g/12oz plain flour, plus extra for dusting",
            "200g/7oz cold butter, cubed",
            "1 free-range egg yolk",
            "2-3 tbsp water, to bind",
            "2 apples, peeled, cored and sliced",
            "2 tbsp caster sugar",
            "½ tsp ground cinnamon"
        ],
        "For the cinnamon cream": [
            "200ml/7fl oz double cream",
            "½ tsp ground cinnamon",
            "1 tbsp icing sugar, plus extra for sprinkling"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the pie, place the flour and 175g/6oz of the butter into a food processor and pulse until the mixture resembles breadcrumbs. Add the egg, then add just enough water, one tablespoon at a time, to bind the mixture. Blend briefly to bring the mixture together as a dough.",
        "Tip the dough out onto a floured work surface and knead gently. Shape into a ball and roll out into a flat circle with the thickness of a pound coin. Place onto a baking sheet lined with greaseproof parchment.",
        "Arrange the sliced apple on the pastry, leaving a 2.5cm/1in gap around the edges, then sprinkle over the caster sugar and cinnamon and dot with the remaining butter. Draw the edges of the pastry up to form a crust and pinch to hold in place. Bake for 8-10 minutes in the oven, or until the pastry is golden-brown and crisp.",
        "For the cinnamon cream, whisk the cream together in a bowl with the cinnamon and icing sugar until soft peaks form when the whisk is removed.",
        "Serve the apple pie with spoonfuls of the cinnamon cream and a sprinkle of icing sugar."
    ],
    "tips": [
        
    ],
    "title": "Homemade open apple pie with cinnamon cream",
    "videos": "[]"
}