{
    "title": "Homemade ricotta with broad bean salad",
    "cookTime": "less than 10 mins",
    "prepTime": "over 2 hours",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "Making ricotta at home is surprisingly easy; it takes a little time but is definitely worth it, especially when served with a delicious seasonal salad.",
    "author": {
        "angela_hartnett": "Angela Hartnett"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "Depending on the size of your lemons you may not need all fo the lemon juice, you just need enough lemon juice to make the milk split."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the ricotta": [
            "3 litres/5¼ pints whole milk",
            "1.5 litres/2½ pints double cream",
            "8 lemons, juice only",
            "2 sprigs thyme",
            "2 sprigs rosemary",
            "2 garlic cloves",
            "salt and freshly ground black pepper",
            "extra virgin olive oil, to serve"
        ],
        "For the broad bean salad": [
            "100g/4oz fresh peas, podded",
            "100g/4oz broad beans, podded",
            "1 bunch asparagus, chopped",
            "½ fennel bulb, shaved",
            "1 punnet pea shoots",
            "salt"
        ],
        "For the dressing": [
            "25ml/1¾fl oz pomace oil or olive oil",
            "25ml/1¾fl oz extra virgin olive oil",
            "1 tbsp sherry vinegar",
            "1 garlic clove, grated",
            "1 tsp Dijon mustard",
            "1 orange, zest only",
            "1 tsp salt"
        ]
    },
    "steps": [
        "For the ricotta, place the milk, cream, thyme, rosemary and garlic in a medium saucepan and heat through to infuse the milk. Pass through a fine sieve.",
        "Place back on the heat in a new saucepan and season with salt. Bring to a simmer and add the lemon juice. Do not whisk. The milk infusion will split on its own. Remove from the heat, set aside for 30 minutes.",
        "Place a sieve over a large bowl and line with muslin. Pour the split milk mixture into the sieve and place in the fridge for 6 hours. Discard the whey and place the curd in the fridge.",
        "For the broad bean salad, heat a large saucepan of boiling water and season with salt. Blanch the peas, broad beans and asparagus for 3-5 minutes, plunge in cold water to cool then drain. Mix the vegetables in a bowl, then add the fennel and pea shoots.",
        "For the dressing, place the ingredients into a bowl and whisk to combine. Pour the dressing over the salad and mix just before serving.",
        "To serve, spoon ricotta onto a plate, dress with some black pepper, sea salt and extra virgin olive oil and place some of the salad alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}