{
    "title": "How to make lamb curry",
    "cookTime": "1 to 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 8",
    "recommendations": "19",
    "images": [
        
    ],
    "description": "The big flavours of this lamb curry belie how easy it is to make. Sure to become a firm favourite.",
    "author": {
        "marcus_bean": "Marcus Bean"
    },
    "show": {
        
    },
    "tips": [
        "If you have time, make this curry a day ahead, then reheat and add the spinach just before serving; the flavours will be even more concentrated."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1.5kg/3lb 5oz lamb shoulder, boned weight, cut into cubes",
            "4 tbsp medium Indian curry paste",
            "2 tbsp vegetable or sunflower oil",
            "generous knob of butter",
            "2 onions, halved then thinly sliced",
            "1 cinnamon stick",
            "6 cardamom pods",
            "400g/14oz can chopped plum tomatoes",
            "1 tbsp tomato purée",
            "300ml/½ pint hot chicken or lamb stock",
            "400g/14oz can chickpeas, drained",
            "125g/4½oz baby leaf spinach, well washed"
        ]
    },
    "steps": [
        "Place the diced lamb shoulder into a bowl or food bag. Mix in three tablespoons of curry paste and leave to marinate for 30 minutes at room temperature, or up to 24 hours in the fridge.",
        "Heat the oil and butter in a large heavy based pan, then add the onions, cinnamon stick, cardamom pods and the remaining tablespoon of curry paste. Fry over a medium heat for 10 minutes, until the onions are softened and starting to turn golden-brown.",
        "Add the marinated lamb, and fry for a couple of minutes until the meat has changed colour - it doesn’t have to be browned.",
        "Stir in the chopped tomatoes, tomato purée and enough stock to cover most of the lamb, with the top pieces just poking clear of the liquid.",
        "Add the chickpeas and bring the mixture up to the boil, then turn the heat down to a simmer, and cook gently for 1 – 1½ hours, until the lamb is very tender and the sauce is rich and thick.",
        "Spoon away the excess fat that will have gathered on the top of the curry, then season with salt and freshly ground black pepper to taste.",
        "Add the spinach, stirring the spinach leaves into the curry until they wilt.",
        "Serve the curry with your favourite rice, breads and chutneys."
    ],
    "howTos": [
        
    ],
    "videos": "[p00yqks7:p00yqksb]"
}