{
    "author": {
        "william_leigh": "William Leigh"
    },
    "cookTime": "less than 10 mins",
    "description": "This is the simple, straight-forward, everyday pancake recipe, great for sweet or savoury pancakes.",
    "dishes": [
        "crepe",
        "pancake"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/how_to_make_pancakes_02824_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "200g/7oz plain flour",
            "350-400ml/12-14fl oz milk, or ½ milk ½ water for a lighter pancake",
            "2 large eggs, lightly whisked",
            "1 tbsp vegetable oil",
            "pinch salt",
            "vegetable oil, for frying"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "62",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Put the flour into a large bowl, make a well in the centre and pour in the milk and eggs. Give the liquid mixture a quick whisk before incorporating the flour. Continue to whisk until you have a smooth batter.",
        "Now add 1 tbsp vegetable oil and whisk thoroughly.",
        "Take a crêpe pan, or large frying pan, dip some kitchen roll in the oil and carefully wipe the inside of the pan. Heat the pan over a medium heat for a minute.",
        "Add just under a ladleful of batter to the pan and immediately start swirling it round the pan to get a nice even layer.",
        "Cook the pancake for approximately 30-40 seconds. Use a palette knife to lift the pancake carefully to look at the underside to check it is golden-brown before turning over. Cook the other side for approx 30-40 seconds and transfer to a serving plate."
    ],
    "tips": [
        "The pancakes can be eaten straight away, or frozen after cooling - stack and wrap them in twos. You can use this batter to make sweet or savoury pancakes. For sweet pancakes you can add a desert spoon of caster sugar and the zest of an orange, this will give the pancakes a great flavour. For savoury pancakes you can add some finely chopped herbs such as dill and parsley, or perhaps some grated Parmesan cheese."
    ],
    "title": "How to make pancakes",
    "videos": "[]"
}