{
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "cookTime": "10 to 30 mins",
    "description": "These tasty vegetarian burgers are easy to make and brilliant for a healthy family dinner. The burgers are freezer friendly so perfect for making ahead. Equipment and preparation: for this recipe you will need a food processor. Each burger provides 423 kcal, 14g protein, 64g carbohydrate (of which 6g sugars), 13g fat (of which 1.5g saturates), 5g fibre and 2.1g salt.",
    "dishes": [
        "beef_burger",
        "bread",
        "canape",
        "hummus",
        "jam",
        "salad",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/hummus_chickpea_burgers_94137_16x9.jpg"
    ],
    "ingredients": {
        "To serve": [
            "8 pitta breads, warmed",
            "mixed green salad",
            "8 tbsp plain yoghurt (optional)",
            "8 tsp chilli sauce"
        ],
        "default": [
            "3-4 tbsp sunflower oil",
            "1 onion, roughly chopped",
            "2 garlic cloves, thinly sliced",
            "1 tsp ground cumin",
            "1 tsp ground coriander",
            "400g tin chickpeas, drained and rinsed",
            "100g/3½oz hummus",
            "50g/2oz plain flour",
            "½ tsp salt",
            "freshly ground black pepper",
            "50g/2oz pine nuts or cashews"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Makes 8",
    "show": {
        
    },
    "steps": [
        "Heat 1 tablespoon of the oil in a non-stick frying pan over a medium heat. Add the onion and garlic and fry gently for 4-5 minutes, or until softened, stirring regularly. Stir in the cumin and coriander and fry for 1-2 minutes, or until fragrant. Remove from the heat and set aside to cool for 5 minutes.",
        "Place in a food processor, add half of the chickpeas and all of the hummus and flour. Season with salt and pepper. Blend to a rough paste.",
        "Add the remaining chickpeas and the pine nuts. Pulse for a few seconds until the chickpeas and pine nuts have broken down but retain some texture. Season to taste.",
        "Divide the chickpea mixture into 8 portions. Roll each into a ball, flatten between your palms into a burger shape approximately 1.5cm/½in thick.",
        "Heat the remaining oil in a large, non-stick frying pan. Add the burgers in batches and fry for 3-4 minutes on each side, or until golden-brown and crisp on both sides and heated through.",
        "Serve the burgers in pitta breads stuffed with salad leaves, with a dollop of yoghurt and chilli sauce alongside."
    ],
    "tips": [
        "These burgers are delicious cold, so they make brilliant packed lunches. Mini versions of the burgers also work well as canapés, topped with a dab of chilli jam and garnished with sprigs of fresh coriander."
    ],
    "title": "Hummus chickpea burgers",
    "videos": "[]"
}