{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Italian",
    "description": "What makes this fantastic for a last-minute, even impromptu, dinner party pud (with interesting Christmas potential) is that you can keep the berries in the deep freeze until needed. I suppose you could, in summer, use fresh berries, though you would lose the contrast between warm rich sauce and sharp icy fruit.",
    "dishes": [
        "cake",
        "quick_desserts",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "250ml/9fl oz double cream",
            "4 tbsp limoncello liqueur",
            "200g/7oz white chocolate, finely chopped",
            "500g/1lb 2oz frozen mixed berries (unthawed)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "19",
    "serves": "Serves 4-6",
    "show": {
        "b01n2y25": "Nigellissima"
    },
    "steps": [
        "Put the double cream and two tablespoons of the limoncello in a milk pan, and heat it until just about to come to the boil, but not actually boiling.",
        "Take the pan off the heat and add the white chocolate, then swirl the pan about so that it is all submerged.",
        "Take the berries out of the freezer and arrange them in a single layer in a dish or plate that has a small lip (so that the sauce doesn’t drip off later). Sprinkle with the remaining two tablespoons of limoncello and leave for five minutes, during which time you can swirl your white chocolate pan about every now and again to help the chocolate melt into the lemony cream.",
        "Using a rubber spatula, gently stir the chocolate-cream mixture, still off the heat, until it’s smooth, then pour it over the berries and serve immediately."
    ],
    "tips": [
        "I love to serve this on a rimmed cake stand, but it could make more sense to make up individual portions in saucers or side plates with a lip. I think it’s important that, however you serve it, you try to keep the berries in a single layer, give or take."
    ],
    "title": "Iced berries with limoncello white chocolate sauce",
    "videos": "[p00z9lc0:p00z9lc2]"
}