{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Thai_and_South-East_Asian",
    "description": "Fragrant fried rice with ginger, chillies, macadamias, lemongrass, nutmeg and lime. Add turkey, chicken or prawns to suit your taste and use up whatever leftovers you have.",
    "dishes": [
        "crackers",
        "fried_rice",
        "pickle",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Balinese spice paste (Base gede)": [
            "¾ tsp black peppercorns",
            "¼ nutmeg, freshly grated",
            "15g/½oz candle nuts, macadamia nuts, cashew nuts or roasted peanuts",
            "½ tsp sesame seeds",
            "30g/1oz shallots, peeled, roughly chopped",
            "15g/½oz fresh root ginger, peeled, roughly chopped",
            "20g/¾oz galangal (or extra ginger), peeled, roughly chopped",
            "7g fresh turmeric, peeled, or ½ tsp ground turmeric",
            "1½ fat lemongrass stalks, hard outer leaves removed, core chopped",
            "10g/¼oz garlic",
            "1 medium-hot red chilli, seeds removed, roughly chopped",
            "2 red bird's-eye chillies, roughly chopped",
            "½ tsp shrimp paste",
            "1½ tsp palm sugar",
            "½ tsp salt",
            "1½ tbsp vegetable oil",
            "¼ lime, juice only"
        ],
        "For the Indonesian stir-fried rice": [
            "vegetable oil, for shallow frying",
            "375g/13¼oz shallots, peeled, thinly sliced",
            "salt, to taste",
            "300g/10½oz long grain rice",
            "520ml/18¾fl oz water",
            "100g/3½oz fine green beans, trimmed, cut into 2.5cm/1in pieces",
            "20g/¾oz garlic, peeled, finely chopped",
            "2 medium-hot red chillies, seeds removed, finely chopped",
            "1 red bird's-eye chilli, thinly sliced",
            "1 medium carrot, peeled, thinly sliced",
            "1 tbsp tomato purée",
            "1 tbsp ketjap manis",
            "250g/9oz cold, cooked leftover turkey, cut into small pieces",
            "1 tbsp light soy sauce",
            "8 spring onions, trimmed, thinly sliced"
        ],
        "To serve": [
            "2 tbsp vegetable oil",
            "4 large free-range eggs",
            "¼ cucumber, sliced",
            "2 medium-sized tomatoes, sliced",
            "ready-made prawn crackers",
            "spiced pickles"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "11",
    "serves": "Serves 4",
    "show": {
        "b00pfv1g": "Rick Stein's Christmas Odyssey"
    },
    "steps": [
        "For the Balinese spice paste, grind the peppercorns, nutmeg, nuts and sesame seeds to a fine powder in a spice grinder. Transfer the mixture to a food processor, then add the remaining Balinese spice paste ingredients and blend to a very smooth paste.",
        "For the Indonesian stir-fried rice, heat enough vegetable oil to reach 1cm/½in up the sides of a large frying pan over a medium-high heat. When the oil is hot, add 175g/6¼oz of the sliced shallots and fry, stirring regularly, until the shallots are crisp and golden-brown. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper. Sprinkle with a little salt, then set aside to cool. When cool, keep in an air-tight container.",
        "Pour the rice into a heavy-based, lidded saucepan 20cm/8in in diameter. Add the water and bring it quickly to the boil. Stir once, then cover the pan with a tight-fitting lid and reduce the heat to low, until the water is barely simmering. Simmer for 10 minutes, then remove the lid and fluff the grains of rice with a fork.",
        "Spread the steamed rice onto a baking tray. Set aside to cool (but do not refrigerate).",
        "Cook the beans in a pan of boiling, salted water for 2-3 minutes, or until just tender. Drain well, then refresh under cold water and set aside.",
        "Heat two tablespoons of vegetable oil in a wok (or large, deep frying pan) over a high heat, until just smoking. Add the remaining sliced shallots, the garlic, chillies and carrot and stir-fry for 2-3 minutes, or until the carrot is just tender.",
        "Stir in the Balinese spice paste and stir-fry for a further minute, then add the tomato purée and ketjap manis and stir-fry for 20-30 seconds.",
        "Add the cold turkey, cooked rice and blanched green beans and stir-fry over a high heat for 2-3 minutes, or until heated through. Add the soy sauce and spring onions and stir until well combined, then remove the pan from the heat. Set aside and keep warm.",
        "Just before serving, heat the oil in a large frying pan, crack in the eggs, one at a time, and fry for 1-2 minutes, or until cooked to your liking, spooning the hot oil over the yolks as they cook.",
        "To serve, spoon the Indonesian stir-fried rice into the centre of four warm serving plates. Sprinkle over the crisp fried shallots. Top each serving with a fried egg. Serve with baskets of prawn crackers and a plate of spiced pickles."
    ],
    "tips": [
        
    ],
    "title": "Indonesian stir-fried rice (Nasi goreng)",
    "videos": "[]"
}