{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "Soufflés have a reputation for being difficult but James Martin shows you the cheat’s way to perfect results every time.",
    "dishes": [
        "caramel",
        "custard",
        "jam",
        "oven-baked_dishes",
        "souffle",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "how_to_fold_egg_whites_into_a_mixture"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the banana soufflé": [
            "50g/1¾oz butter",
            "3 tbsp caster sugar",
            "4 tbsp ready-made custard",
            "4 free-range egg whites",
            "1 tsp banana liqueur"
        ],
        "For the caramelised bananas": [
            "4 small bananas, peeled and cut on a angle",
            "50g/1¾oz butter",
            "75g/2½oz caster sugar",
            "150ml/5fl oz double cream"
        ],
        "To serve": [
            "1 sprig mint, leaves only"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the banana soufflé, preheat the oven to 200C/400F/Gas 6 and grease four ramekins using half of the butter and one tablespoon of caster sugar.",
        "In a large bowl, mix the remaining sugar with the custard.",
        "In a clean, large bowl whisk the egg whites until stiff peaks form when the whisk is removed.",
        "Carefully fold the egg whites into the custard mix, stir in the banana liqueur and spoon into the prepared ramekins. Put on a baking tray and place in the oven for 6-8 minutes.",
        "For the caramelised bananas, heat a frying pan until hot. Add the bananas, cut-side down, and fry for 1-2 minutes, or until caramelised. Remove from the pan and set aside.",
        "Add the butter to the pan and heat until foaming, then add the sugar and cook until the mixture is a caramel colour.",
        "Add the cream, bring to the boil, then reduce the heat until the mixture is simmering. Simmer for 2-3 minutes, or until golden-brown. Return the bananas to the pan and heat through.",
        "To serve, place the soufflés on serving plates and place the caramelised bananas next to them. Garnish with mint leaves."
    ],
    "tips": [
        
    ],
    "title": "Instant soufflé with caramelised bananas",
    "videos": "[]"
}