{
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "cookTime": "10 to 30 mins",
    "description": "This flavourful dish of Italian meatballs has a healthy twist by using courgette ribbons instead of pasta — an easy way to reduce calories. As part of an Intermittent diet plan, 1 serving provides 3 of your 6 daily vegetable portions. This meal provides 219 kcal per portion.",
    "dishes": [
        "meatballs",
        "pasta",
        "prepare-ahead_desserts",
        "sauce",
        "stir-fries",
        "tagliatelle"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/italian_style_meatballs_69955_16x9.jpg"
    ],
    "ingredients": {
        "For the courgette ‘tagliatelle’": [
            "2 medium courgettes, trimmed and deseeded",
            "sea salt and freshly ground black pepper"
        ],
        "For the meatballs": [
            "250g/9oz extra lean beef mince (5% fat or less)",
            "1 small onion, very finely chopped",
            "1 tsp dried mixed herbs",
            "calorie controlled cooking oil spray",
            "1 garlic clove, crushed",
            "227g/8oz can chopped tomatoes",
            "2 heaped tbsp finely shredded fresh basil leaves, plus extra to garnish"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 2",
    "show": {
        
    },
    "steps": [
        "Place the beef, half the onion, half the mixed herbs and a pinch of salt and pepper in a bowl and mix well. Form into 10 small balls.",
        "Spray a medium non-stick frying pan with a little oil and cook the meatballs for 5-7 minutes, turning occasionally until browned on all sides. Transfer to a plate.",
        "For the sauce, put the remaining onion in the same pan and cook over a low heat for three minutes, stirring. Add the garlic and cook for a few seconds.",
        "Stir in the tomatoes, 300ml/10fl oz water, the remaining mixed herbs and shredded basil. Bring to the boil, stirring. Return the meatballs to the pan, reduce the heat to a simmer and cook for 20 minutes, stirring occasionally until the sauce is thick and the meatballs are cooked throughout.",
        "Meanwhile , half-fill a medium pan with water and bring to the boil. Use a vegetable peeler to peel the courgettes into ribbons. Cook the courgette in the boiling water for one minute then drain.",
        "Divide the courgette ribbons between two plates and top with the meatballs and sauce. Garnish with basil leaves."
    ],
    "tips": [
        "You can prepare the meal the night before and then reheat in the microwave at work if you like."
    ],
    "title": "Italian style meatballs with courgette ‘tagliatelle’",
    "videos": "[]"
}