{
    "title": "Jerk chicken with pomegranate rice",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "overnight",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the jerk chicken": [
            "4 part-boned chicken breasts, skin on (substitute boneless chicken breasts if part-boned are not available)",
            "½ large onion, roughly chopped",
            "2 scotch bonnet chillies, roughly chopped",
            "40g/1½oz ginger, peeled and chopped roughly",
            "125ml/4½fl oz malt vinegar",
            "½ tsp ground cloves",
            "½ tsp ground cinnamon",
            "¼ tsp ground nutmeg",
            "½ tsp cracked black pepper",
            "3 garlic cloves, roughly chopped",
            "2 tsp fresh thyme leaves",
            "3 tbsp dark soy sauce"
        ],
        "For the rice": [
            "200g/7oz basmati rice",
            "1 pomegranate, seeds only",
            "1 small bunch chervil leaves",
            "4 tbsp chives, roughly chopped",
            "50g/2oz frisée lettuce, roughly chopped",
            "1 lime, zest and juice",
            "2 tbsp extra virgin olive oil",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "2 limes, cut into wedges"
        ]
    },
    "steps": [
        "For the jerk chicken, using a sharp knife, make deep cuts into the chicken flesh and place into a bowl.",
        "Place the remaining jerk chicken ingredients into a food processor and blend to a purée. Pour the marinade over the chicken and turn to coat all the pieces. Place into the fridge for at least four hours, but preferably overnight.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "Heat a griddle pan until very hot. Add the chicken pieces and sear for 2-3 minutes on each side, then place onto a baking tray.",
        "Spoon the remaining marinade over the chicken and transfer to the oven to cook for 20-25 minutes, or until the chicken is completely cooked through. Remove from the oven and leave to rest for 2-3 minutes before serving.",
        "For the rice, place the rice into a saucepan with 400ml/14fl oz of cold water. Cover with a lid and place over a high heat. Bring to the boil, then reduce the heat and simmer very gently until all of the water has been absorbed and the rice is tender (about 10-15 minutes). Turn off the heat and leave to steam for 5-6 minutes.",
        "Place the rice into a bowl and add all the remaining rice ingredients and mix well to combine. Season, to taste, with salt and freshly ground black pepper.",
        "To serve, spoon a little of the rice onto each plate and top with a piece of jerk chicken. Garnish with a couple of wedges of lime."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}