{
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Spanish",
    "description": "Serve this tortilla on a cake stand and decorated with chive flowers for a stunning spring lunch.",
    "dishes": [
        "bun",
        "cake",
        "omelette",
        "stir-fries",
        "upside-down_cake"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "dash oil, for cooking",
            "1 onion, sliced",
            "100g/3½oz crème fraîche, plus extra to serve",
            "salt and pepper",
            "2 tbsp chopped chives",
            "4 free-range duck eggs, whisked",
            "200g/7oz Jersey Royals, washed and scrubbed (not peeled), pre-cooked and halved",
            "1 bunch spring onions, sliced",
            "70g/2½oz Double Gloucester, grated",
            "30ml/1fl oz first press rapeseed oil",
            "chive flowers"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 2-4",
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "steps": [
        "Heat a dash of oil in a frying pan and fry the onion until softened.",
        "Whisk the crème fraîche and chives together in a bowl. Season with salt and black pepper and set aside.",
        "Put the duck eggs, potatoes, spring onions, cooked onions and cheese in a mixing bowl and season with salt and pepper.",
        "Add the rapeseed oil to a non-stick frying pan, heat and then pour in the tortilla mixture.",
        "With a heatproof spatula, stir the egg mix until you see the egg starting to set, then leave to fully set on the presentation side and lightly colour - draw the sides in around the tortilla to make it as round as possible",
        "Once the tortilla has set, use a cake stand to help turn the tortilla over: put the stand on top of the firm egg mixture, then turn at the same time so that the pan is upside down and the cake stand is upright. Lift the pan off and you should have a lovely looking tortilla. Slide the tortilla back into the pan and finish cooking for 2-4 minutes until cooked to your liking.",
        "To serve, cut the tortilla into portions and then serve with a spoon of the crème fraîche and chive flowers on top."
    ],
    "tips": [
        
    ],
    "title": "Jersey Royal and Double Gloucester tortilla",
    "videos": "[]"
}