{
    "author": {
        "jo_ingleby": "Jo Ingleby"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "This makes a great alternative to traditional crumbles and has the added benefit of being really fun for kids to make. Just choose your fruit and the kids can form the cobbler topping. You can use fresh, frozen or tinned fruit, or a mixture.",
    "dishes": [
        "cobbler",
        "crumble",
        "custard",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "rubbing_in"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/kids_any-fruit_cobbler_81271_16x9.jpg"
    ],
    "ingredients": {
        "For the cobbler topping": [
            "175g/6oz self-raising flour (white or wholemeal)",
            "100g/3½oz unsalted butter, softened",
            "25g/1oz porridge oats",
            "50g/1¾oz soft brown sugar",
            "½ tsp ground cinnamon or mixed spice",
            "4 tbsp yoghurt (natural or flavoured)"
        ],
        "default": [
            "600g/1lb 5oz fresh, tinned (drained weight) or frozen fruit, such as apples, pears, ripe peaches or plums (peeled and cores removed) or berries such as blackberries, raspberries, cherries or blueberries, or a mixture",
            "1 small orange, juice only",
            "2 tbsp soft brown sugar"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "8",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Adults job: preheat the oven to 200C/400F/Gas 6.",
        "Kid’s job: Chop the fruit into chunks. Don’t worry about the size being perfect, it is good to have a variety of chunks! (An adult should supervise this.)",
        "Kid’s job: Place the fruit into an ovenproof dish and pour over the orange juice and the brown sugar.",
        "Kid’s job: Place the flour into a mixing bowl and chop the butter into small lumps. They can then rub in the butter roughly using their fingertips. This doesn’t have to be perfect, a few lumps are fine.",
        "Kid’s job: Stir in the oats, sugar and spices to the cobbler mix and stir it through with a spoon or your hands.",
        "Kid’s job: Add the yoghurt one spoonful at a time. You may need to mix with your hands to form a rough dough.",
        "Kid’s job: Form the cobbler mix into small balls, about the size of a ping pong ball and arrange them over the top of the fruit.",
        "Adult’s job: Place in the oven for 30-40 minutes or until the cobbler is golden-brown on top with the fruit bubbling up around the edges. Leave to cool before serving as the fruit filling will be very hot. Serve warm with ice cream, yoghurt or custard."
    ],
    "tips": [
        
    ],
    "title": "Kids’ any-fruit cobbler",
    "videos": "[]"
}