{
    "title": "Kid’s customised couscous salad",
    "cookTime": "no cooking required",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/kids_customised_couscous_17817_16x9.jpg"
    ],
    "description": "Couscous is easy to prepare and can be used as a base for a healthy salad that can contain whatever veg children choose. Couscous can be served warm as a side dish for stews and curries or cold as a salad - it is perfect cooked the day before for picnics and lunchboxes.",
    "author": {
        "jo_ingleby": "Jo Ingleby"
    },
    "show": {
        
    },
    "tips": [
        "If you are feeling more adventurous you can add a tray of roasted vegetables such as squash, cauliflower, aubergine and peppers. Drizzle with a little oil and roast in a hot oven for 15 minutes before adding to the couscous. Kids can get all of the ingredients ready in the baking tray and rub them with oil before an adult puts them in and out of the oven."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "¼ cucumber",
            "10 cherry tomatoes or 3 larger tomatoes",
            "1 pepper, any colour",
            "2 spring onions",
            "100g/3½oz sweetcorn, frozen or tinned (drained weight)",
            "150g/5½oz couscous",
            "small lemon, juice only (you can also use orange)",
            "1 tbsp olive oil",
            "200ml/7fl oz boiling water"
        ],
        "For the optional extras": [
            "small bunch herbs, such as parsley and coriander",
            "small handful nuts, such as flaked almonds, pine nuts, or pistachios",
            "small handful olives, chopped",
            "small handful dried fruits such as raisins, sultanas, chopped dried apricots"
        ]
    },
    "steps": [
        "Kids job: Chop all of the vegetables into really small pieces. Kids need to be helped with chopping - use a knife which doesn’t have a pointy end. You can buy plastic salad knives for very little money which are ideal for kids to use. They can also use smooth edged table knives (not serrated which cuts fingers easily), but may need help chopping hard vegetables. It is good to chop alongside the kids with a sharp knife so they can see how it is done. Show them how to curl their fingers away from the knife like a claw, keeping your fingernails flat on the vegetable you are chopping.",
        "Kid’s job: Place the couscous in a large heat proof bowl and then squeeze in the lemon or orange juice and a drizzle of olive oil.",
        "Adult’s job: Pour the boiling water onto the couscous, cover with cling film, then set it aside to stand for five minutes.",
        "Kid’s job: Use a fork to stir up the couscous until it looks fluffy.",
        "Kid’s job: Add the chopped vegetables and stir well. If you want to add herbs, nuts, olives or dried fruits, stir these in, too. Serve with falafel, grilled chicken, or a few slices of griddled halloumi."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}