{
    "title": "Kids’ veggie slaw",
    "cookTime": "no cooking required",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/kids_veggie_slaw_73791_16x9.jpg"
    ],
    "description": "Graters are fine for children to use but please do supervise them as graters can be really sharp. This sweet and fruity slaw can be served as a salad or you can add some natural yoghurt or a little mayonnaise for more traditional coleslaw to serve with barbecued burgers or chicken.",
    "author": {
        "jo_ingleby": "Jo Ingleby"
    },
    "show": {
        
    },
    "tips": [
        "Safety first! Graters can be really sharp and can cut small knuckles so make sure you only use larger pieces of vegetable which keep fingers away from the metal blade. Always use graters resting on a chopping board, not held over bowls. You can help by gently holding the vegetable and the child’s hand for the first few grates so they can feel what to do. It is always better to leave the last bit of any vegetable rather than chopping or grating close to the fingers- kids can always eat the leftovers! Rotary graters are safer to use and cost under £10."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "2 carrots",
            "½ celeriac or kohlrabi (these are very strange-looking vegetables that kids love to explore)",
            "2 raw beetroot (this can be very messy but is fun!)",
            "2 apples"
        ],
        "For the dressing": [
            "1 tbsp olive oil",
            "1 orange, juice only (or use lemon juice if you prefer)",
            "freshly ground black pepper",
            "1 tbsp sunflower, sesame or pumpkin seeds, or a mixture",
            "1 spoonful Greek yoghurt and/or a mixture of yoghurt and mayonnaise (optional)",
            "handful fresh herbs such as chives, parsley (optional)"
        ]
    },
    "steps": [
        "Kid’s job: wash the vegetables and then either grate them, with help, or use a grating attachment on a food processor.",
        "Kid’s job: Place all of the grated vegetables in a bowl with the oil and orange juice (or a couple of teaspoons of lemon juice) and stir well so that all of the colours mix together.",
        "Kid’s job: Have a taste -you may like the salad as it is but you can add more orange or lemon juice to taste and also herbs and seeds if you have them.",
        "Kid’s job: If you are using them add the mayonnaise or yoghurt a teaspoon at a time, stirring it in well and tasting until you have a flavour that you like.",
        "Keep the salad in the fridge. It will keep for up to three days in a sealed plastic tub."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}