{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "10 to 30 mins",
    "description": "This lightly spiced kedgeree is perfect for a tasty weekend lunch. This is designed to be a low cost recipe.",
    "dishes": [
        "curry",
        "kedgeree",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "50g/1¾oz butter",
            "1 onion, finely diced",
            "salt and pepper",
            "1 tsp curry powder",
            "300g/10oz rice",
            "500ml/18fl oz vegetable stock, made from a stock cube",
            "4 eggs",
            "160g/5½oz kippers",
            "200g/7oz frozen peas, defrosted"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4",
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "steps": [
        "Melt the butter over a medium heat in a high-sided frying pan with a lid or a wide, shallow saucepan with a lid. Once melted, add the onion along with a pinch of salt and fry gently for 5-6 minutes, or until softened. Stir in the curry powder and cook for 1-2 minutes, or until aromatic.",
        "Add the rice and stir to coat in the onion mixture. Season with a pinch of salt and pepper then add the stock and bring to a simmer. Reduce the heat to the lowest setting and cover with a lid. Cook for 12 minutes, or until the rice is tender.",
        "While the rice is cooking boil the eggs. Heat a pan of water and, once boiling, add the eggs and boil for eight minutes. Once boiled, drain and run them under cold water to cool them down. Peel and slice into quarters lengthways.",
        "Bring some water to the boil in a large shallow pan, add the kippers and cook for four minutes until just cooked. Transfer the fish to a plate and set aside until cool enough to handle, then break the flesh into large flakes discarding the bones and skin.",
        "Once the rice is cooked, stir in the defrosted peas and flaked kippers. Cook gently for 3-4 minutes to warm everything through. Taste and season with salt and pepper to taste. Serve with the egg quarters dotted around the kedgeree. Eat hot."
    ],
    "tips": [
        "In May 2013 this recipe was costed at £2.79 at Asda, £2.79 at Tesco and £3.55 at Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "title": "Kipper kedgeree",
    "videos": "[]"
}