{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Spanish",
    "description": "These soft and tender aubergines filled with lamb ragu and topped with Manchego cheese are really delicious.",
    "dishes": [
        "oven-baked_dishes",
        "ragu",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/lamb-stuffed_aubergines_99219_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "4 aubergines",
            "6 tbsp olive oil",
            "1 onion, chopped",
            "4 garlic cloves, finely chopped",
            "1 large red pepper, seeds removed, chopped",
            "1½ tsp freshly ground cumin seeds",
            "1 tsp ground cinnamon",
            "½ tsp freshly grated nutmeg",
            "1 tsp pimentón dulce (smoked sweet Spanish paprika)",
            "large pinch of crushed dried chillies",
            "500g/1lb 2oz lamb mince",
            "6 tbsp tomato sauce (see Top recipe tip below)",
            "100g/3½oz Manchego cheese, coarsely grated",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "36",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Cut each aubergine lengthways through the stalk, then score the flesh in a tight criss-cross pattern, taking the knife through the flesh down to the skin, but taking care not to cut through the skin. Place them side by side on a baking tray and drizzle each half with half a tablespoon of the oil, season with salt and bake for 30-40 minutes or until the flesh is soft and tender but not browned.",
        "Meanwhile, heat the remaining two tablespoons of oil in a large non-stick frying pan. Add the onion, garlic, red pepper and spices and fry gently for 10 minutes. Add the lamb mince and fry for 3–4 minutes or until all the meat is lightly browned. Stir in the tomato sauce and simmer for five minutes.",
        "Remove the aubergines from the oven and increase the temperature to 220C/425F/Gas 7. Carefully scoop most of the flesh out of the baked aubergine halves, leaving the skins with a layer of flesh about 1cm/½in thick. Stir the scooped-out flesh into the lamb mixture with half a teaspoon of salt and some pepper to taste. Spoon the mixture into each aubergine shell and sprinkle with the grated cheese. Bake in the oven for 8–10 minutes, or until the cheese is bubbling and golden-brown."
    ],
    "tips": [
        "Use Rick Stein's Simple tomato sauce for this recipe."
    ],
    "title": "Lamb-stuffed aubergines with Moorish spices and Manchego cheese",
    "videos": "[]"
}