{
    "author": {
        "reza_mahammad": "Reza Mahammad"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "Indian",
    "description": "",
    "dishes": [
        "bread",
        "casserole",
        "pie",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the marinade": [
            "8 dried figs, soaked in water, to cover",
            "3 tbsp khoya (dried reduced milk), available from ethnic grocers",
            "1 tbsp raisins, soaked in water, to cover",
            "½ tsp saffron strands, soaked in 3 tbsp warm water",
            "150ml/5¼fl oz plain yoghurt",
            "3 onions, sliced and shallow-fried in oil until golden brown",
            "4cm/1¾in piece of fresh root ginger, peeled and grated",
            "6 garlic cloves",
            "2 tsp salt, or to taste",
            "2 tsp red chilli powder",
            "4 tsp garam masala",
            "2 tsp ground cumin",
            "1 tsp freshly ground cardamom seeds",
            "1 tbsp chopped coriander, to garnish"
        ],
        "Specialist equipment": [
            "meat mallet"
        ],
        "To serve": [
            "naan bread, warmed"
        ],
        "default": [
            "500g/17½oz boned leg of lamb",
            "100g/3½oz ghee (clarified butter)",
            "4 cinnamon sticks, each 4cm (1¾in) long",
            "4 black cardamoms",
            "200g/7¼oz flour, approx",
            "50ml/1¾fl oz water, or enough to bind into a slack dough"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Remove all the white membranes from the surface of the meat.",
        "Using a sharp knife, cut the meat into 5cm (2in) squares, about 1cm (½in) thick.",
        "Place these escalopes between sheets of cling film and beat them out with a meat mallet or rolling pin until the lamb has been flattened into thin pieces.",
        "Tip all the marinade ingredients into a food processor and blend until smooth.",
        "Coat the escalopes with the marinade, making sure the meat is completely covered with the masala spice mix. Set aside for at least one hour.",
        "Heat the clarified butter in a heavy-bottomed casserole pan, wide enough to take the meat in one layer.",
        "Add the cinnamon sticks and black cardamoms and let them sizzle for a few seconds before adding the marinated meat with its liquid.",
        "Cover the pan with a tightly-fitting lid and seal the edges with a flour and water paste (this helps to retain all the flavours in the pot as the meat cooks).",
        "Simmer on a very low heat for an hour until the sauce has reduced and the meat is tender.",
        "Remove the lid from the pan. If there's too much liquid, cook the sauce down until there's a thin film of oil on top.",
        "Scatter with chopped coriander and serve straight away with warm naan bread."
    ],
    "tips": [
        
    ],
    "title": "Lamb pasanda",
    "videos": "[]"
}