{
    "author": {
        "antony_worrall_thompson": "Antony Worrall Thompson"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Turkish_and_Middle_Eastern",
    "description": "",
    "dishes": [
        "lamb_kofta",
        "oven-baked_dishes",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the spiced yoghurt": [
            "2 chillies, seeded and finely chopped",
            "1 tsp fresh mint leaves, chopped",
            "1 tsp chives, snipped",
            "1 tsp coriander leaves, finely chopped",
            "1 tsp parsley, finely chopped",
            "1 garlic clove, crushed to a paste in a pestle and mortar",
            "½ tsp ground cumin",
            "250g/9oz Greek-style yoghurt"
        ],
        "To serve": [
            "mixed salad leaves"
        ],
        "default": [
            "75g/3oz bulgar wheat",
            "2 tbsp olive oil",
            "1 chilli, finely chopped",
            "1 medium onion, finely chopped",
            "½ tsp ground coriander",
            "½ tsp ground cumin",
            "500g/1lb 2oz lean leg of lamb, all visible fat removed, cubed",
            "1 egg",
            "40g/1½ oz pine kernels, finely chopped",
            "2 tsp mint, chopped",
            "3 tsp parsley, chopped"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Makes 40",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "First, make the spiced yoghurt. Combine all the yoghurt ingredients in a large bowl. Leave for an hour to allow the flavours to develop.",
        "For the lamb koftas, soak the bulgar wheat in cold water for 30 minutes. Drain and squeeze dry.",
        "Heat half the olive oil in a frying pan, then add the chilli, onion, ground coriander and ground cumin and cook on a low heat for 15 minutes. Allow to cool.",
        "Place the lamb in a food processor along with the egg and the cooled onion mixture. Blend until the mixture has the consistency of a smooth paste.",
        "Remove the lamb mixture and place in a bowl. Add the bulgar wheat along with the pine kernels and the chopped mint and parsley.",
        "Wet your hands and shape 1 tsp of the mixture into a small log-shaped koftas. Repeat with the remaining mixture.",
        "Heat remaining one tablespoon olive oil in a frying pan, then add the koftas in batches, turning regularly until brown and cooked through. This should take approximately 10 minutes.",
        "When cooked, drain the koftas on absorbent kitchen paper and keep warm in the oven.",
        "Serve with spiced yoghurt dip and salad leaves."
    ],
    "tips": [
        
    ],
    "title": "Lamb koftas with spiced yoghurt",
    "videos": "[]"
}