{
    "author": {
        
    },
    "cookTime": "less than 10 mins",
    "description": "Lamb mince isn't the leanest meat so make a little go a long way by bulking these koftas out with healthy wheatgerm.",
    "dishes": [
        "lamb_kofta"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For spiced yoghurt": [
            "1 red chilli, seeds removed and finely chopped",
            "1 tbsp finely chopped fresh mint",
            "1 tbsp finely chopped fresh parsley",
            "1 tbsp finely chopped fresh coriander",
            "1 clove garlic, crushed",
            "½ tsp ground cumin",
            "200g/7oz low-fat Greek-style yoghurt"
        ],
        "For the lamb koftas": [
            "140g/5oz wheatgerm",
            "250g/10½oz lean lamb mince",
            "1 free-range egg",
            "1 onion, finely chopped",
            "1 tbsp pine nuts, finely chopped",
            "2 tbsp finely chopped fresh parsley",
            "1 tsp olive oil, for frying"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "4",
    "serves": "Serves 3",
    "show": {
        
    },
    "steps": [
        "Place the wheat germ into a large bowl and cover with cold water. Leave to stand for ten minutes, then drain and pat dry with kitchen towels to remove excess water.",
        "Place the wheat germ, lamb mince, egg, onion, pine nuts and parsley into a large bowl and mix together well. Roll small lumps of the lamb mixture into small balls, the size of a golf ball and place onto a greased baking sheet, cover with cling film and place into the fridge to chill for 30-45 minutes.",
        "Meanwhile, for the spiced yoghurt, place the chilli, mint, parsley, coriander, garlic, cumin and yoghurt into a clean bowl and mix thoroughly.",
        "Heat a tablespoon of oil in a large frying pan over a medium heat. Add the kofta balls and fry, turning regularly, until browned and cooked all the way through.",
        "To serve, divide the hot kofta balls between three plates and top with a dollop of the spiced yoghurt."
    ],
    "tips": [
        
    ],
    "title": "Lamb koftas with spiced yoghurt",
    "videos": "[]"
}