{
    "title": "Lavender shortbread hearts",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 15",
    "recommendations": "26",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/lavender_shortbread_43952_16x9.jpg"
    ],
    "description": "Avid listeners of The Archers will have heard Camilla, Duchess of Cornwall raving about the lavender shortbread that were baked for her by Ian, the chef at Grey Gables.",
    "author": {
        "mari_williams": "Mari Williams"
    },
    "show": {
        
    },
    "tips": [
        "If you can't find lavender sugar, you can make your own by mixing 1kg/2lb 4 oz caster sugar with two teaspoons of lavender flowers. This can be stored in an airtight jar for up to six months."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "125g/4½oz lavender caster sugar, plus extra for sprinkling (see Top recipe tip below)",
            "225g/8oz unsalted butter, softened",
            "300g/10½oz plain flour, plus extra for dusting",
            "50g/1¾oz ground rice"
        ]
    },
    "steps": [
        "Line two large baking trays with baking paper.",
        "Sieve the sugar into a bowl and reserve the lavender (this stops the lavender seeds getting broken when creaming the butter and sugar). Add the butter and cream the sugar and butter together.",
        "Sift the flour and ground rice into the mixture, add the reserved lavender seeds and mix with a wooden spoon until the mixture resembles breadcrumbs.",
        "Using floured hands, work the mixture together to form a smooth paste.",
        "Tip onto a lightly floured work surface and knead gently until the dough is smooth. Chill the dough in the fridge for 15 minutes.",
        "Roll the dough out to a 5mm/¼in thickness, and cut out biscuits using a heart-shaped cutter. Place the hearts onto the baking trays, and sprinkle with a little extra lavender sugar.",
        "Leave to chill for a further 30 minutes in the fridge.",
        "Meanwhile, preheat the oven to 180C/ 350F/Gas 4.",
        "Bake for 15-20 minutes, or until pale golden-brown. Carefully place the biscuits onto a cooling rack., sprinkle with extra lavender sugar and set aside to cool completely."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}