{
    "title": "Lavender and tea shortbread biscuits",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Makes 18 biscuits",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Lady Grey tea is a less strong, more floral version of Earl Grey. Here the leaves are removed from the bag to flavor a classic shortbread biscuit.",
    "author": {
        "ingrid_oliver": "Ingrid Oliver"
    },
    "show": {
        "b01q9tbm": "The Great Comic Relief Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "200g/7oz unsalted butter",
            "100g/3½oz caster sugar",
            "250g/9oz plain flour, plus extra for dusting",
            "40g/1½oz ground rice",
            "pinch salt",
            "1½ tsp dried lavender, ground (ensure it has been produced specifically for eating)",
            "2 Lady Grey teabags, leaves only (or 1 tsp tea leaves, ground)"
        ]
    },
    "steps": [
        "Preheat the oven to 190C/375F/Gas 5.",
        "In a mixing bowl, cream the butter with a handheld electric mixer until soft and creamy. Add the sugar in a bit at a time until well mixed.",
        "Sift the flour, ground rice and salt into another bowl. Stir the lavender and Lady Grey tea leaves into the flour mixture.",
        "Lightly work the lavender flour into the creamed butter with fingers until the dough just comes together.",
        "Shape the dough into a ball and cover with clingfilm. Set aside in the fridge for 15 minutes.",
        "When the dough is chilled, remove the clingfilm and and roll out onto a floured surface to a thickness of approximately ¾cm/¼in. Cut out heart-shaped biscuits with a cutter.",
        "Place the biscuits onto a baking tray and place in the fridge for 30 minutes.",
        "Bake the biscuits in the oven for 20 minutes or until a very pale gold colour. Allow to cool on the tray for ten minutes before transferring to a wire rack to cool completely."
    ],
    "howTos": [
        "creaming"
    ],
    "videos": "[]"
}