{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "French",
    "description": "",
    "dishes": [
        "custard",
        "oven-baked_dishes",
        "sauce",
        "souffle",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "folding",
        "whisking_egg_whites",
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the raspberry sauce": [
            "100g/3½oz caster sugar",
            "1 tsp rosewater",
            "100ml/3½fl oz water",
            "50ml/2fl oz white wine",
            "200g/7oz raspberries"
        ],
        "For the soufflé": [
            "150ml/5fl oz whole milk",
            "1 vanilla pod, split",
            "1 lemon, zest only",
            "50g/2oz butter, plus extra for greasing",
            "30g/1oz plain flour",
            "100g/3½oz caster sugar (plus extra for sprinkling)",
            "½ lemon, juice only",
            "3 free-range eggs, separated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "Place the milk, vanilla pod, lemon zest and half of the sugar into a pan over a medium heat and bring to near boiling, then remove from the heat.",
        "In a separate pan, melt the butter, then add the flour and stir to combine.",
        "Strain the hot milk mixture then gradually add to the butter and flour mixture, stirring constantly, until thickened.",
        "Meanwhile, using an electric whisk, beat the lemon juice and egg yolks together in a bowl, until very pale and fluffy, about 3-5 minutes.",
        "Add the hot milk mixture and whisk well to combine as a smooth custard.",
        "In a separate bowl, whisk together the whites and other half of the sugar, until stiff peaks form when the whisk is removed.",
        "Fold a spoonful of the egg white mixture into the custard mixture, then gently fold in the remaining egg whites, until just combined.",
        "Grease two ramekins with butter and sprinkle them with a little sugar to coat the insides.",
        "Pour the soufflé mixture into both ramekins so that it comes almost to the top.",
        "Run your thumb, or the handle of a teaspoon, around the edge to make a small indentation (this will help the soufflé to rise).",
        "Place the ramekins onto a baking sheet and place into the oven to bake for 10-12 minutes, or until risen and light golden-brown.",
        "For the sauce, place the sugar, rosewater, water and wine into a pan over a medium heat and bring to the boil. Reduce the heat and simmer for five minutes, or until thickened.",
        "Add the raspberries and stir for one minute.",
        "Blend the sauce with a hand-held blender then pass the sauce through a sieve.",
        "Remove the souffés from the oven and place onto plates. Use a spoon to cut out a small hole in the top of each soufflé and pour in some of the raspberry sauce. Serve immediately."
    ],
    "tips": [
        
    ],
    "title": "Lemon soufflés with raspberry sauce",
    "videos": "[]"
}