{
    "author": {
        "sophie_dahl": "Sophie Dahl"
    },
    "cookTime": "10 to 30 mins",
    "description": "These lemon mousses are a happy ending to any special meal. Try serving them in individual ramekins or Martini glasses.",
    "dishes": [
        "mousse",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "folding",
        "whipping_cream",
        "zesting_citrus_fruit"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/lemonmousse_88962_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "4 medium free-range eggs, separated",
            "250g/8oz caster sugar",
            "3 lemons, zest and juice only",
            "5 tbsp cold water",
            "15g/½oz powdered gelatine",
            "300ml/½ pint double cream",
            "small handful blanched toasted almonds, finely chopped"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "12",
    "serves": "Serves 6-8",
    "show": {
        "b00701fw": "A Taste of My Life"
    },
    "steps": [
        "Using an electric whisk, whisk together the egg yolks, sugar, lemon zest and juice until the sugar has dissolved and the mixture has thickened a little. (If you do not have an electric whisk, whisk by hand in a glass bowl set over a pan of hot water. When the mixture has thickened, remove the bowl from the pan and whisk until cool.)",
        "Place the cold water into a heavy-based saucepan, sprinkle in the gelatine and place over a gentle heat, without stirring, until the gelatine has melted. Remove from the heat and leave to cool slightly.",
        "In a separate bowl, lightly whip the cream until soft peaks form when the whisk is removed. Stir the melted gelatine into the cream and fold into the egg yolk mixture.",
        "Whisk the egg whites in a separate bowl with an electric hand-whisk until soft peaks form when the whisk isremoved.",
        "Place the bowl with the egg yolks inside a bigger bowl filled with ice-cold water. Gently fold the whipped egg whites into the egg yolk mixture with a metal spoon. Stir the mixture until it begins to thicken, then pour into a glass bowl and refrigerate for one hour, or until set.",
        "Sprinkle the toasted chopped almonds over the top of the mousse and serve."
    ],
    "tips": [
        "This recipe makes more lemon mousse than you will need for two people. The remaining mousse can be stored in the fridge for 2-3 days."
    ],
    "title": "Lemon mousse",
    "videos": "[]"
}