{
    "title": "Lemongrass and ginger mussels",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Mussels are cheap, flavoursome and now available all year round. Try them with this delicious Asian-style sauce.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "50g/1¾oz unsalted butter",
            "2 shallots, finely chopped",
            "2 lemongrass stalks, tough outer leaves discarded, soft core finely chopped",
            "2 garlic cloves, finely chopped",
            "10cm/4in piece fresh root ginger, peeled, finely chopped",
            "1-2 red chillies (depending on their heat), finely sliced",
            "200ml/7oz white wine",
            "330ml/11fl oz coconut water",
            "160ml/5½fl oz coconut cream",
            "2kg/4lb 8oz mussels, rinsed, scrubbed, beards removed (discard any mussels that do not close tightly when tapped firmly)",
            "2 tbsp olive oil",
            "1 loaf sourdough bread, thickly sliced",
            "2 tbsp roughly chopped fresh coriander leaves",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Melt the butter in a heavy-based, lidded pan over a medium heat. Add the shallots, lemongrass, garlic, ginger and chilli(es) and fry for 4-5 minutes, or until softened but not coloured.",
        "Increase the heat to high, then pour in the wine, coconut water and coconut cream and bring to the boil. Add the mussels and cover the pan with the lid. Cook for 4-5 minutes, or until the mussels have opened (discard any mussels that do not open during cooking).",
        "Meanwhile, heat a griddle pan over a high heat. When the pan is hot, drizzle the olive oil over the bread slices and grill the bread for 30 seconds on each side, or until chargrill marks appear on both sides.",
        "When the mussels have cooked, stir in the coriander leaves, then season, to taste, with salt and freshly ground black pepper.",
        "To serve, spoon the mussels, and the cooking liquor, into four bowls. Serve the bread alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[p02gx7tx:p02gx7v0]"
}