{
    "title": "Lemon tart",
    "cookTime": "1 to 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 8-10",
    "recommendations": "10",
    "images": [
        
    ],
    "description": "The classic lemon tart served with a glazed top and a dollop of crème fraîche.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the pastry": [
            "250g/9oz plain flour, plus extra for dusting",
            "100g/3½oz cold butter, plus extra for greasing",
            "25g/1oz icing sugar, plus extra for dusting",
            "1 pinch salt",
            "1 free-range egg"
        ],
        "For the tart": [
            "14 free-range eggs, plus 1 beaten egg for glazing",
            "550g/1lb 4oz caster sugar",
            "700ml/1¼ pint double cream",
            "10 large lemons, zest and juice only",
            "500g/1lb 2oz crème fraîche, to serve"
        ]
    },
    "steps": [
        "For the pastry, put the flour, butter, icing sugar and salt in a bowl and rub with the tips of your fingers until it resembles the texture of fine breadcrumbs.",
        "Add the egg and mix together until it forms a dough, then knead lightly on a work surface until smooth.",
        "Roll into a ball then flatten slightly, wrap in cling film and put in the fridge to rest for 30 minutes.",
        "For the tart, preheat the oven to 170C/340F/Gas 3½ and butter a 25cm/10in tart ring (approximately 4.5cm/1¾in deep).",
        "Break the eggs into a bowl, add the sugar, cream, lemon zest and juice and whisk gently to combine. Place in the fridge to chill.",
        "Roll out the pastry on a work surface lightly dusted with flour to about 3mm thick – keep turning the pastry a quarter turn every time you roll it so you end up with a perfect circle of pastry.",
        "Put the buttered tart ring on a flat baking sheet then line it with the pastry, carefully lifting the pastry up then pressing it into the base of the ring, leaving any excess hanging over the edge.",
        "Line with a several sheets of cling film to cover the pastry and hang over by 10cm/4in then fill the tart with flour, raw rice or baking beans. Fold the cling film back over the flour/rice and bake for 15 minutes. Not all cling film is suitable for use in the oven but aluminium foil or baking parchment can be used instead if preferred.",
        "Remove the cling film and flour/rice, brush the inside of the tart with the beaten egg and return to the oven for another 3-4 minutes, or until just golden-brown.",
        "Reduce the oven temperature to 150C/300F/Gas 2.",
        "Skim off any bubbles from the top of the lemon cream and discard.",
        "Pour half the lemon cream into the pastry case, then transfer to the oven before adding the rest of the filling (this prevents any spillage and gives a neat finish).",
        "Bake for an hour, or until the filling is set but still just wobbling in the centre. Leave to cool at room temperature.",
        "To serve, cut the tart into wedges and dust with icing sugar. Glaze either by putting the tart under a hot grill or by using a blow torch. Serve with a quenelle of crème fraîche."
    ],
    "howTos": [
        
    ],
    "videos": "[p01t1qf1:p01t1qfb]"
}