{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "over 2 hours",
    "description": "This delicate, seasonal dish is perfect for a light lunch on a warm day - serve with triangles of buttered bread.",
    "dishes": [
        "bread",
        "bun",
        "jam",
        "mayonnaise",
        "pickle",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the herb oil": [
            "½ bunch fresh parsley, roughly chopped",
            "½ bunch fresh chives, roughly chopped",
            "½ bunch fresh coriander, roughly chopped",
            "200ml/7fl oz oil"
        ],
        "For the mackerel and dressed crab": [
            "2 free-range egg yolks",
            "2 tsp white wine vinegar",
            "1 tsp Dijon mustard",
            "300ml/10½fl oz vegetable oil",
            "150g/5oz white crab meat",
            "2 mackerel fillets, skin on, pin bones removed",
            "2 tbsp chopped fresh wood sorrel, to garnish",
            "salt and freshly ground black pepper"
        ],
        "For the pickled vegetables": [
            "½ bunch baby turnips, trimmed, thinly sliced with a mandoline",
            "½ bunch radishes, preferably Breakfast radishes, trimmed, thinly sliced with a mandoline",
            "¼ cucumber, peeled, thinly sliced with a mandoline",
            "110ml/4fl oz white wine vinegar",
            "1 tsp sugar",
            "1 tsp salt"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Put the vegetables in a heatproof bowl. In a saucepan, heat 110ml/4fl oz of water and all of the white wine vinegar, stirring in the sugar and salt until dissolved. Pour the vinegar mixture over the sliced vegetables and set aside to pickle for 2 hours. Drain the vegetables, discarding the pickling liquid.",
        "Meanwhile, for the herb oil, blend all of the ingredients in a food processor until smooth. Strain through a fine sieve, then set aside.",
        "For the dressed crab, blend the egg yolks, vinegar and mustard in a food processor until pale and creamy. With the motor still running, gradually pour in the oil in a thin stream, until the mixture forms a thick mayonnaise. (You may not need to use all of the oil.)",
        "Put the crab meat in a small glass bowl and cover with the mayonnaise. Season, to taste, with salt and pepper. Chill in the fridge until ready to serve.",
        "Just before serving, lay the mackerel fillets, skin-sides facing upwards, on a baking tray. Heat the skin of the mackerel all over using a chefs' blow torch, until the fish fillets are completely cooked through. Alternatively, preheat the grill to its highest setting and grill the mackerel fillets until cooked through.",
        "Drizzle each serving plate with the herb oil. Place one mackerel fillet in the centre of each plate. Spoon half of the crab mayonnaise on one side of the fish, then spoon the pickled vegetables on the other side. Garnish with the wood sorrel and serve."
    ],
    "tips": [
        
    ],
    "title": "Mackerel fillet with dressed crab, pickled vegetables and herb oil",
    "videos": "[]"
}