{
    "title": "Make-ahead red cabbage",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/make-ahead_red_cabbage_13106_16x9.jpg"
    ],
    "description": "Bring that festive feeling to your kitchen with some red cabbage simmering on the stove. This recipe can be made in advance, perfect if you are planning for a stress-free Christmas. For this recipe you will need a food processor.",
    "author": {
        "deborah_reddihough": "Deborah Reddihough"
    },
    "show": {
        "b0520lz9": "Eat Well for Less?"
    },
    "tips": [
        "The cabbage should be cooked for 15-20 minutes more if it isn’t finely shredded. This dish freezes well. Let the cooked cabbage cool completely, then transfer to a freezer-safe container (it will keep in the freezer for 3 months). Defrost in the microwave or overnight in the fridge. Reheat in a microwave or in a saucepan on the hob."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "knob of butter",
            "2 tbsp olive oil",
            "1 onion, finely sliced or chopped",
            "1 tsp ground cinnamon",
            "½ tsp ground nutmeg (optional)",
            "1 x 600g/1lb 5oz red cabbage, shredded finely using a food processor (white core discarded)",
            "3 tbsp soft brown sugar",
            "3 eating apples, peeled, cored and diced",
            "150ml/5fl oz red wine vinegar",
            "2 tsp redcurrant or cranberry sauce (optional)"
        ]
    },
    "steps": [
        "Heat the butter and oil in a large lidded saucepan. When hot, add the onion and fry gently until softened. Stir in the spices. Add the cabbage and fry for 3-4 minutes, stirring occasionally, until glossy.",
        "Stir in the sugar, apples and red wine vinegar. Cover with a lid and let it cook gently for 30 minutes.",
        "Stir in the redcurrant or cranberry sauce (if using) and cook for a further 10 minutes. If you aren’t using the sauce, taste the cabbage and add a little more sugar if it’s too tart for your taste."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}