{
    "title": "Malaysian-style chicken curry",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-5",
    "recommendations": "4",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/malaysian-style_chicken_98338_16x9.jpg"
    ],
    "description": "This coconut-rich, slow-cooked curry is a doddle to prepare for the family and full of kid-friendly vegetables. Equipment and preparation: For this recipe, you will need a 4.5 litre/8 pint slow-cooker.",
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "show": {
        
    },
    "tips": [
        "Tip 1: If preferred, substitute the green beans with a sliced pepper. Tip 2: It's important to use waxy potatoes because floury potatoes will fall apart during the long cooking time."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the curry paste": [
            "2 onions, quartered",
            "20g/¾oz fresh root ginger, peeled, coarsely grated",
            "6 garlic cloves, peeled",
            "2 tbsp medium curry powder",
            "1 tsp dried chilli flakes",
            "1 tsp ground turmeric",
            "2 tbsp sunflower oil"
        ],
        "For the curry": [
            "8 chicken thighs, boned, skinned, halved",
            "1 cinnamon stick",
            "3 star anise",
            "500g/1lb 2oz large waxy potatoes, peeled, cut into 3cm/1¼in chunks",
            "3 carrots, peeled, sliced into 1.5cm/½in rounds",
            "2 tbsp cornflour",
            "400ml tin coconut milk",
            "150g/5oz green beans, trimmed and cut in half",
            "freshly ground black pepper"
        ]
    },
    "steps": [
        "Put all of the curry paste ingredients in a food processor and blend. You will need to remove the lid and push the mixture down a couple of times using a rubber spatula.",
        "Heat a large, non-stick frying pan over a medium heat. Spoon in the curry paste and cook for 2-3 minutes, stirring constantly, until fragrant.",
        "Season the chicken thighs on all sides with lots of pepper.",
        "Add the chicken thighs, cinnamon and star anise to the pan, stir well and cook for 2-3 minutes, turning the chicken pieces once or twice until they are pale golden-brown.",
        "Stir in 100ml/3½fl oz water and bring the mixture to the boil. Transfer to the slow cooker and add the potatoes and carrots.",
        "In a bowl, whisk 2 tablespoons water with the cornflour to form a thin paste. Stir in the coconut milk and pour over the curry. Stir well to combine.",
        "Cover and cook on high for 3 hours, or until the chicken and vegetables are tender and the sauce has thickened. Just before the end of the cooking time, stir in the green beans.",
        "Serve the curry just as it is, or with small portions of steamed rice."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}