{
    "author": {
        "phil_vickery": "Phil Vickery"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bread",
        "caramel",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "kneading",
        "rubbing_in",
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the butterscotch sauce": [
            "50g/2oz caster sugar",
            "50g/2oz soft brown sugar",
            "100g/3½oz butter",
            "½ orange, juice only",
            "200ml/7fl oz double cream, plus extra, whipped, to serve"
        ],
        "For the filling": [
            "50g/2oz caster sugar",
            "1 mango, peeled and roughly chopped",
            "1 lime, juice and zest"
        ],
        "For the pastry": [
            "100g/3½oz self-raising flour, plus extra for flouring",
            "100g/3½oz unsalted butter, cut into cubes",
            "50g/2oz caster sugar",
            "50ml/2fl oz milk"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 2",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the pastry, place the flour and butter into a food processor and pulse until the mixture resembles breadcrumbs.",
        "Add the caster sugar and pulse again. Add the milk and pulse until the mixture comes together as a dough.",
        "Turn the dough out onto a floured surface and lightly knead. Roll the dough out to ½cm/¼in thick and cut out a circle to fit the size of a small ovenproof frying pan.",
        "For the filling, heat the sugar in the same ovenproof frying pan until melted, then add the mango pieces, lime juice and zest and cook until caramelised.",
        "Place the pastry over the filling mixture in the pan and press down around the edges.",
        "Transfer to the oven and bake for 8-10 minutes, or until golden-brown.",
        "For the butterscotch sauce, heat the sugars and butter in a small pan until the mixture is melted and well combined and turns a caramel colour. Add the orange juice and cream and stir until smooth.",
        "To serve, turn the tarte tatin out onto a plate and pour over the butterscotch sauce. Serve with a dollop of whipped cream."
    ],
    "tips": [
        
    ],
    "title": "Mango and lime tarte tatin with butterscotch sauce",
    "videos": "[]"
}