{
    "title": "Vegetable chilli with peanut butter cabbage and sadza",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "Sadza is Zimbabwe’s staple dish, traditionally made with white cornmeal. Polenta is just another name for cornmeal and could easily be substituted here. The vegetable chilli is just as good served cold.",
    "author": {
        "zimwomen_association": "Zimwomen Association"
    },
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the chilli": [
            "3 tbsp olive oil",
            "1 small onion, chopped",
            "2 carrots, diced",
            "½ red pepper, seeds removed and chopped",
            "½ yellow pepper, seeds removed and chopped",
            "½ green pepper, seeds removed and chopped",
            "100g/3½oz green beans, chopped",
            "2 tomatoes, chopped",
            "3–4 chillies, seeds removed and flesh chopped",
            "salt and freshly ground black pepper"
        ],
        "For the sadza": [
            "375g/13oz white cornmeal (mealie meal)"
        ],
        "For the peanut butter cabbage": [
            "½ small cabbage (or any seasonally vegetable), shredded",
            "1 small onion, chopped",
            "1 tomato, chopped",
            "4 tbsp peanut butter"
        ]
    },
    "steps": [
        "For the chilli, heat the oil in a large pan and gently fry the onion until soft but not brown.",
        "Add the carrots, peppers and green beans, fry briefly then add the tomatoes, and chillies and simmer the stew until the vegetables are tender. Season to taste with salt and freshly ground black pepper.",
        "For the sadza, mix 225g/8oz of the cornmeal with 250ml/9fl oz of water.",
        "Bring 750ml/1¼ pints of water to the boil in a pan, then turn down the heat and add the cornmeal mixture, stirring all the time. Cook for five minutes, then gradually add the remaining cornmeal. Transfer to a bowl or plate and flatten into a round shape with a wooden spoon.",
        "For the peanut butter cabbage, pour about 125ml/4fl oz of water into a pan and bring to the boil. Add the cabbage and cook until slightly softened but still crunchy.",
        "Add the onion and tomato then stir in the peanut butter, adding more water if the mixture seems too thick. Season with salt and freshly ground black pepper. Serve with the sadza and vegetable chilli."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}