{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "A great family favourite as pudding to follow a weekend lunch. I have to admit, the recipe is not economical – just delicious! Ideally use a rectangular dish simply because the bread fits it better. If you are not keen on sultanas, just leave them out.",
    "dishes": [
        "bread",
        "bread_and_butter_pudding",
        "custard",
        "oven-baked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/mary_berrys_mothers_97161_16x9.jpg"
    ],
    "ingredients": {
        "For the custard": [
            "2 free-range eggs",
            "300ml/½ pint double cream",
            "150ml/¼ pint milk",
            "2 tbsp demerara sugar"
        ],
        "default": [
            "150g/5oz mixed sultanas and raisins",
            "75g/3oz caster sugar",
            "1 lemon or orange, finely grated zest",
            "½ tsp mixed spice",
            "8 thin slices white bread, crusts removed",
            "100g/4oz butter, melted"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "43",
    "serves": "Serves 6-8",
    "show": {
        "b01qgf70": "The Mary Berry Story"
    },
    "steps": [
        "You will need an ovenproof dish about 2½-3 pint/1.4-1.7 litres volume (18 x 23 x 5 cm/7 x 9 x 2 in).",
        "Preheat the oven to 180C/350F/Gas 4 and use some of the melted butter to grease the dish.",
        "Combine the dried fruit, sugar, lemon zest and spice together in a bowl and toss to mix well.",
        "Cut each bread slice into three strips. Take sufficient slices to cover the base of the dish and dip one side of each one in melted butter. Lay them in the dish, buttered-side down. Sprinkle with half the dried fruit mixture. Repeat the layering, laying the bread strips buttered-side up. Lay the third and final layer of bread strips on top, buttered-side up.",
        "For the custard, beat together the eggs, cream and milk in a bowl and pour it over the pudding. Sprinkle with demerara sugar, and then leave to stand for about one hour if time allows.",
        "Bake for about 30-40 minutes, or until the top is golden-brown and crisp and the pudding slightly puffed up. Serve hot, or there are some who insist that it is delicious cold!"
    ],
    "tips": [
        
    ],
    "title": "Mary Berry’s mother’s bread and butter pudding",
    "videos": "[]"
}