{
    "author": {
        "lisa_hobson": "Lisa Hobson"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "These little patties are a great way to use up the leftovers from a Sunday roast.",
    "dishes": [
        "bread",
        "cake",
        "gravy",
        "meat_pie",
        "oven-baked_dishes",
        "pastry",
        "pie"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "1 small onion, chopped",
            "1 tbsp oil or butter",
            "1 thick slice bread",
            "125g/4½oz roast beef, or other cooked meat",
            "leftover gravy",
            "sea salt and freshly ground black pepper"
        ],
        "For the pastry": [
            "40g/1½oz lard",
            "40g/1½oz butter",
            "175g/6oz plain flour",
            "pinch of salt",
            "1 free-range egg, beaten with a drop of milk"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Makes 10",
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "steps": [
        "First make the pastry. Rub the fat into the flour, or pulse in a food processor, until the mixture resembles breadcrumbs. Add the salt and mix with enough water to form a dough.",
        "Wrap the dough in cling film and leave it to rest in the fridge while you make the filling.",
        "Heat the oil in a frying pan and fry the onion for 4-5 minutes, or until soft, then leave to cool.",
        "Blend the bread in a food processor to make breadcrumbs, then add the meat and onion and pulse until coarsely chopped.",
        "Tip the mixture into a bowl and add enough gravy to make a soft mixture. Season, to taste, with sea salt and freshly ground black pepper.",
        "Preheat the oven to 200C/400F/Gas 6. Grease a 12-hole patty tin (or fairy cake tin).",
        "Roll out the pastry and cut 10 large circles for the bases of the pies and 10 smaller circles for the lids.",
        "Place the larger pastry rounds in greased patty tins and add a heaped teaspoon of filling to each. Dampen the edges of the patties with water and top with the lids, making sure the edges are well sealed.",
        "Brush the patties with the beaten egg and pierce a hole in each one to allow the steam to escape. Bake the patties in the preheated oven for 20–30 minutes or until golden-brown."
    ],
    "tips": [
        
    ],
    "title": "Meat patties",
    "videos": "[]"
}