{
    "author": {
        "yottam_ottolenghi": "Yotam Ottolenghi"
    },
    "cookTime": "1 to 2 hours",
    "description": "Make quiche extra special with Stilton and membrillo. Serve with roasted Brussels sprouts and zesty pomelo for a flavourful vegetarian meal.",
    "dishes": [
        "crumble",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "quiche",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "how_to_blind_bake_pastry",
        "lining_tin_with_pastry"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Brussels sprouts and pomelo": [
            "100g/3½oz caster sugar",
            "2 cinnamon sticks",
            "5 star anise",
            "3 tbsp lemon juice",
            "1 pomelo (approximately 900g/2lb)",
            "600g/1lb 5oz Brussels sprouts, trimmed",
            "250g/9oz shallots",
            "5 tbsp olive oil",
            "2 tbsp chopped coriander leaves",
            "salt and freshly ground black pepper"
        ],
        "For the quiche": [
            "1 medium butternut squash, peeled, deseeded and cut into small cubes",
            "1½ tbsp olive oil",
            "250g/9oz best-quality shortcrust pastry",
            "plain flour, for dusting",
            "200g/7oz Stilton, crumbled",
            "70g/2½oz membrillo (quince paste), cut into 1cm/½in dice",
            "3 free-range eggs",
            "150ml/5fl oz double cream",
            "150ml/5fl oz crème fraîche",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "11",
    "serves": "Serves 6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "Toss the squash in a bowl with the oil, a pinch of salt and black pepper. Spread out on a baking tray and roast for 30 minutes, or until golden-brown, turning once. Set aside to cool and reduce the oven temperature to 190C/170C Fan/Gas 5.",
        "Roll out the pastry on a floured work surface, roughly 3mm thick, and transfer it to a 24cm/9½in quiche tin. When lining, leave some pastry hanging over the edge. Prick the base of the pastry with a fork and chill in the fridge for 20 minutes.",
        "Line the tin with baking parchment, fill with baking beans and cook for 30 minutes. Remove the beans and paper, and cook for a further 10 minutes, or until the pastry is golden-brown. Set aside to cool.",
        "Spread the squash over the pastry base, dot the stilton between, and sprinkle the membrillo all over.",
        "Place the eggs, cream and crème fraîche in a mixing bowl with a pinch of salt and some black pepper. Whisk together and pour over the squash, leaving some of the filling exposed. Place in the oven for about 40 minutes, or until the egg mixture has set. Leave to rest, then remove from the tin and break off the hanging pastry.",
        "Meanwhile for the pomelo, place the sugar, cinnamon and star anise in a small saucepan with 100ml/3½fl oz of water and bring to a light simmer. Cook for 1 minute, stirring until the sugar dissolves. Remove from the heat, stir in 1 tablespoon of the lemon juice and set aside to cool.",
        "Peel the thick skin off the pomelo. Segment the fruit, making sure to remove all the white membrane. Break into bite sized pieces and put in a shallow bowl. Pour the sugar syrup over the pomelo and leave to marinate for at least an hour, stirring occasionally. Remove the cinnamon and star anise and strain the pomelo reserving the juices.",
        "For the sprouts, increase the oven to 220C/200C Fan/ Gas Mark 7. Bring a large pan of salted water to the boil, add the sprouts and shallots and blanch for 2 minutes. Drain, refresh under cold water and pat dry. When cool, halve the sprouts lenghtways and cut the shallots so that they are similar size to the sprouts. Put in a bowl with 3 tablespoons of the oil, ½ tablespoon of salt and some black pepper. Spread out on a baking tray and roast for about 20 minutes, or until the sprouts are golden brown but still retain a bite. Set aside to cool.",
        "Just before serving, put the shallots, sprouts, pomelo and coriander in a large mixing bowl. Add the remaining olive oil and lemon juice, plus 1 tablespoon of the reserved pomelo marinade juices and ¼ tablespoon of salt. Gently mix, season to taste, you may wish to add another tablespoon of the pomelo marinade.",
        "Slice the quiche and serve alongside the Brussels sprouts."
    ],
    "tips": [
        
    ],
    "title": "Membrillo and Stilton quiche with roasted Brussels sprouts and pomelo",
    "videos": "[]"
}