{
    "author": {
        "sylvia_and_jamie_haselock": "Sylvia & Jamie Haselock"
    },
    "cookTime": "1 to 2 hours",
    "description": "",
    "dishes": [
        "jam",
        "jelly",
        "meringue",
        "oven-baked_dishes",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the butterscotch sauce": [
            "100g/3½oz butter",
            "100g/3½oz soft brown sugar",
            "250ml/8½fl oz double cream, whipped lightly",
            "½ tsp vanilla extract"
        ],
        "For the fruit": [
            "225g/½ lb fresh cherries, stones removed",
            "50ml/1¾fl oz orange juice",
            "2 tbsp redcurrant jelly",
            "1 tbsp pomegranate molasses",
            "2-3 tbsp soft brown sugar",
            "50ml/1¾fl oz sweet dessert wine"
        ],
        "For the meringue nests": [
            "4 large free-range egg whites",
            "250g/8½oz caster sugar"
        ],
        "To serve": [
            "284ml/½ pint double cream"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "6",
    "serves": "Serves 4",
    "show": {
        "b009f3wl": "Recipe for Success"
    },
    "steps": [
        "For the meringue nests, preheat the oven to 150C/300F/Gas 2 and line a baking tray with non-stick greaseproof paper.",
        "Place the egg whites in a mixing bowl and whisk until they form soft peaks when the whisk is removed.",
        "Add the caster sugar, a spoonful at a time, constantly whisking. When the sugar is absorbed, the meringue should look shiny, glossy and stiff.",
        "Using a tablespoon, spoon the mixture onto non-stick baking tray to make little mounds. Place in the oven and bake for 15 minutes.",
        "Lower the oven temperature to 110C/225F/Gas ¼ and cook for a further 1-1½ hours until crisp on the outside and gooey in the middle. Leave to cool.",
        "For the fruit, place the cherries in a pan with the orange juice, redcurrant jelly, pomegranate molasses and soft brown sugar, and simmer for a few minutes. Add the dessert wine.",
        "When the cherries are soft remove them from the pan with a slotted spoon, set them aside and keep warm.",
        "Simmer the sauce until it has reduced to a consistency to lightly coat the back of a spoon. Place the cherries back in the sauce, set aside and keep warm.",
        "For the butterscotch sauce, melt the butter in a pan.",
        "When the butter has melted, add the soft brown sugar. Stir until the sugar has dissolved.",
        "When the sugar has been absorbed into the butter, add the double cream and vanilla. Bring to the boil and beat vigorously. Keep the sauce warm until you are ready to serve.",
        "To serve, decorate the meringue nests with the cream, cherries and butterscotch sauce."
    ],
    "tips": [
        
    ],
    "title": "Meringue nests with fresh cherries and butterscotch sauce",
    "videos": "[]"
}