{
    "author": {
        "michael_caines": "Michael Caines"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Turkish_and_Middle_Eastern",
    "description": "Chicken livers are packed with flavour and a cheap option too. Try them with pitta and salad for a super tasty lunch. This is designed to be a low cost recipe.",
    "dishes": [
        "bread",
        "bun",
        "pie",
        "salad",
        "sandwich",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the parsley salad": [
            "1 bunch parsley, leaves roughly chopped, stalk very finely chopped",
            "½ onion, very finely diced",
            "½ lemon, zest only (juice used above)",
            "2 tbsp olive oil"
        ],
        "default": [
            "50g/1¾oz butter",
            "450g/1lb chicken livers, trimmed of any sinews and fat, drained and patted dry, chopped into bite-sized pieces",
            "1 onion, finely sliced",
            "1 garlic clove, finely sliced",
            "½ tsp chilli flakes",
            "½ lemon, juice only (zest used below)",
            "200g/7oz plain yoghurt",
            "4 pitta breads",
            "salt and pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4",
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "steps": [
        "Heat a frying pan over a medium heat. Add half of the butter and, once melted, and the pan is hot add the chicken livers. Brown on each side until nicely coloured, but not cooked through. Add the onion to the pan and cook for five minutes then add the garlic and chilli flakes and continue to cook for two more minutes.",
        "Squeeze in the lemon juice, starting with a quarter of the lemon and adding more to taste. Add the remaining butter, allow it to melt in the pan and then baste the livers for two minutes over a medium heat so that the sauce is bubbling. The livers should by this point have firmed up with only a hint of pink in the middle. Add the yoghurt and mix through. Taste and season with salt and pepper to taste. Take off the heat and leave to rest while you make the salad.",
        "Mix all the parsley salad ingredients together and season with salt and pepper. Toast the pitta breads and then slit them open along one of the long sides.",
        "Spoon the chicken livers into the pitta pockets, top with the parsley salad and serve."
    ],
    "tips": [
        "In May 2013 this recipe was costed at £3.38 at Asda, £3.31 at Tesco and £3.35 Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "title": "Middle Eastern-style chicken livers with parsley salad and pitta",
    "videos": "[]"
}