{
    "author": {
        "sue_lawrence": "Sue Lawrence"
    },
    "cookTime": "10 to 30 mins",
    "description": "This crumbly, fruity mince pie recipe is a Christmas classic. Serve warm with lashings of brandy butter.",
    "dishes": [
        "bread",
        "icing",
        "mince_pies",
        "mincemeat",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/mincepies_73207_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "350g/12oz high quality mincemeat, preferably homemade",
            "200g/7oz plain flour, sifted",
            "40g/1½oz golden caster sugar",
            "75g/2¾oz ground almonds",
            "125g/4½oz unsalted butter, diced",
            "1 large free-range egg, beaten",
            "milk, to glaze"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "48",
    "serves": "Makes 12 pies",
    "show": {
        
    },
    "steps": [
        "Lightly butter a 12-hole pie or patty tin. Tip the mincemeat into a bowl and stir so that the liquid is evenly distributed.",
        "Place the flour, sugar, almonds and butter in a food processor and process briefly until resembling breadcrumbs, then slowly add the egg through the feeder tube. (Or rub the butter into the dry ingredients by hand and stir in the egg.)",
        "Bring the mixture together with your hands, wrap in clingfilm and chill for an hour or so. Thinly roll out the pastry on a floured surface. Cut out 12 circles with a fluted pastry cutter, large enough to fill the base of the prepared tin. Press gently into each hole, then fill with the mincemeat.",
        "Cut out another 12 slightly smaller discs and use to cover the mincemeat. Press the edges together to seal. Make a small slit in the top of each, then brush lightly with milk. Chill for about 30 minutes. Meanwhile, preheat the oven to 200C/400F/Gas 6.",
        "Bake the pies for 20 minutes until golden brown. Remove to a wire rack and serve warm."
    ],
    "tips": [
        "To create the snowflake pattern, use a festive doily as a template and sprinkle with icing sugar."
    ],
    "title": "Mince pies",
    "videos": "[]"
}