{
    "author": {
        "angela_hartnett": "Angela Hartnett"
    },
    "cookTime": "1 to 2 hours",
    "description": "Make the meringues in advance and let them cool slowly for the perfect texture. Served with a generous dollop of cream and fresh fruit, they're as easy as they are impressive.",
    "dishes": [
        "icing",
        "meringue",
        "oven-baked_dishes",
        "pavlova",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the mini pavlovas": [
            "6 medium free-range egg whites",
            "300g/10½oz caster sugar",
            "1 tsp cornflour",
            "1 tsp white wine vinegar"
        ],
        "For the strawberry sauce": [
            "500g/1lb 2oz strawberries, hulled",
            "1-2 tbsp icing sugar, to taste",
            "1 lemon, juice only"
        ],
        "For the vanilla cream": [
            "400ml/14fl oz double cream",
            "1 vanilla pod, seeds only"
        ],
        "To decorate": [
            "200g/7oz strawberries, hulled and cut into quarters",
            "200g/7oz raspberries",
            "2 sprigs fresh mint, leaves picked",
            "2 tbsp icing sugar"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "",
    "serves": "Serves 4-6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 125C/250F/Gas ½.",
        "For the mini pavlovas, place the egg whites in the bowl of a large food processor with a whisk attachment (make sure the bowl is scrupulously clean). Whisk until soft peaks form when the whisk is removed. Gradually whisk in the sugar until the egg whites are firm. Fold in the cornflour and vinegar.",
        "Spoon the meringue into small nest shapes and place in the oven for 10 minutes. Reduce the heat to 100C/200F/Gas ¼ and cook for an hour. Leave in the oven overnight to cool completely.",
        "For the vanilla cream, place the cream and vanilla seeds in a large bowl and whisk until soft peaks form when the whisk is removed. Set aside.",
        "For the strawberry sauce, place the strawberries into a food processor with the icing sugar and lemon juice. Blend to a purée and then pass through a fine sieve.",
        "To serve, put the quartered strawberries in a bowl and stir in the strawberry sauce. Place the meringue nests onto serving plates and spoon the cream on top. Top with the strawberries in the sauce along with some fresh raspberries. Garnish with mint leaves and a dusting of icing sugar."
    ],
    "tips": [
        "Adding vinegar to the egg whites ensures the meringues will be crunchy on the outside but still delightfully chewy on the inside."
    ],
    "title": "Mini pavlovas with vanilla cream and strawberry sauce",
    "videos": "[]"
}