{
    "title": "Mint lamb chops served with pea purée and roasted shallots",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "brian_turner": "Brian Turner"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the lamb chops": [
            "100g/3½oz breadcrumbs",
            "2 tbsp fresh mint",
            "1 tbsp fresh parsley",
            "2 lamb chops",
            "100g/3½oz flour",
            "1 free-range egg, whisked",
            "1 tbsp olive oil"
        ],
        "For the pea purée 75g/2½oz peas, cooked": [
            "1 tbsp fresh parsley, chopped",
            "1 tbsp white wine vinegar"
        ],
        "For the caramelised shallots": [
            "25g/1oz butter",
            "25g/1oz brown sugar",
            "2 small shallots, peeled"
        ]
    },
    "steps": [
        "To prepare the lamb chops, use a blender to mix the breadcrumbs, mint and parsley until well combined. Place into a bowl.",
        "Coat the lamb chops in the flour then dip in the egg and into the breadcrumbs until well coated. Season with salt and freshly ground black pepper.",
        "Heat a frying pan to a medium heat. Add the oil and place the lamb chops into the pan. Cook for three minutes.",
        "Turn the chops over and cook for a further three minutes.",
        "Remove the chops and allow them to rest for three minutes.",
        "To make the pea purée, place half the peas, the parsley and the white wine vinegar into a small blender and blend until smooth.",
        "Fold the other half of the cooked peas into the pea mixture.",
        "To make the caramelised shallots, in a small frying pan over a hot heat, add the butter and sugar together for one minute.",
        "Add the shallots and cook until golden.",
        "Turn down the heat and cook for a further two minutes.",
        "Serve the lamb chops with the minted peas and the caramelised shallots on the side."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}