{
    "title": "Mixed seafood in a Bengali broth (Macher jhol)",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "Spice up your seafood with this flavourful Bengali fish stew.",
    "author": {
        "vivek_singh": "Vivek Singh"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the seafood": [
            "1 x 300g/10½oz piece of halibut fillet, scaled, pin-boned and cut into 5cm/2in cubes",
            "4 large scallops, cleaned and removed from their shells",
            "4 large prawns, shells removed, deveined",
            "1 lobster, meat removed and cut into 2½cm/1in cubes, reserve 1 claw",
            "1 squid, cleaned and sliced into1cm/½in thick rings",
            "2 small potatoes, peeled, boiled and sliced (about 1cm/½in thick)",
            "2 small aubergines, sliced 1cm/½in thick",
            "8 cherry tomatoes on the vine",
            "1½ tsp salt",
            "3 tbsp vegetable oil",
            "½ tsp sugar",
            "1 tsp ground turmeric",
            "½ tsp red chilli powder",
            "½ tsp fennel seeds",
            "½ tsp nigella seeds",
            "coriander cress, to garnish"
        ],
        "For the broth": [
            "2 tbsp mustard oil",
            "4 green cardamom pods, crushed",
            "10 peppercorns, crushed",
            "2 bay leaves",
            "1 tsp onion seeds",
            "1 tsp fennel seeds",
            "1 large onion, finely chopped",
            "¼ tsp ground turmeric",
            "1 tsp red chilli powder",
            "1½ tsp ground cumin",
            "2 tomatoes, finely chopped",
            "2 hot green chillies, finely chopped",
            "750ml/1¼ pint fish stock",
            "1¼ tsp salt",
            "½ tsp sugar",
            "2 tbsp chopped fresh coriander",
            "1 lemon, juice only",
            "pinch ground cardamom"
        ],
        "To serve": [
            "boiled basmati rice"
        ]
    },
    "steps": [
        "Wash the seafood and pat dry with kitchen paper. Sprinkle the seafood, potatoes, aubergine and tomatoes with salt and vegetable oil. Sprinkle over the sugar and spices, cover and place in the fridge.",
        "Meanwhile for the broth, heat the mustard oil in a large pan over a high heat. Once hot, add the cardamom pods, peppercorns, bay leaves, onion seeds and fennel seeds and let them crackle. Add the onions and cook over a high heat until they are golden-brown, this should take about 10 minutes.",
        "Add the turmeric, chilli powder and cumin and gently fry for 1 minute. Add the tomatoes and chillies and gently fry for 3 minutes. Add the fish stock, salt and sugar. Reduce the heat and simmer for 10 minutes.",
        "Add the coriander and lemon juice and cook for 2 minutes. Pass the broth through a sieve and stir in the ground cardamom. Keep warm.",
        "Heat a large non-stick pan. Add the seafood mixture, except the lobster and squid. Cook over a moderate heat for 2 minutes.",
        "Add the lobster and cook for another minute or so. Add the squid rings and as they colour, turn the mixture over in the pan. Cook the other side for another 2 minutes until the seafood and vegetables are just cooked.",
        "Remove from the pan and place in a large serving bowl. Sprinkle with the coriander cress and pour over the broth. Serve immediately with basmati rice."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}