{
    "author": {
        "nigel_slater": "Nigel Slater"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "North_African",
    "description": "Make a double batch of Nigel's tasty chicken casserole - eat some and freeze the rest. See the top recipe tip below for advice on freezing.",
    "dishes": [
        "casserole",
        "chicken_casserole",
        "pie",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/moroccanstylechicken_92582_16x9.jpg"
    ],
    "ingredients": {
        "For the casserole": [
            "6 large chicken thighs, bone in and skin on",
            "good glug fruity olive oil",
            "2 onions, peeled, roughly chopped",
            "1 lemon, cut in half, thinly sliced",
            "pinch saffron strands",
            "handful green olives, pits removed",
            "small handful fresh coriander, roughly chopped"
        ],
        "For the spice paste": [
            "2-3 large, juicy garlic cloves, peeled, roughly chopped",
            "pinch sea salt flakes",
            "2-3 good pinches smoked paprika",
            "2-3 good pinches ground turmeric",
            "1 tsp cumin seeds",
            "glug olive or groundnut oil"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "168",
    "serves": "Serves 2-3",
    "show": {
        "b00vt10m": "Nigel Slater's Simple Suppers"
    },
    "steps": [
        "For the spice paste, crush the garlic cloves and sea salt with a pestle in a mortar. Add the smoked paprika, turmeric and cumin seeds and grind to a paste. Add just enough olive or groundnut oil to make the paste runny enough to pour, but thick enough to coat the chicken.",
        "For the casserole, place the chicken thighs into a bowl, pour the spice paste over them and toss well to coat all of the meat. Cover with cling film and leave to marinate in the fridge for as long as time allows, overnight if possible.",
        "Heat the olive oil in a large shallow pan, then cook the onions until softened. Add the chicken thighs and cook until coloured lightly on both sides. Add the lemon slices and pour in enough water to come halfway up the chicken pieces. Stir in the saffron, then season well, cover with a lid and simmer for about 25 minutes, until the chicken is cooked through and tender. Add the olives and fresh coriander and serve."
    ],
    "tips": [
        "To freeze: transfer to a freezerproof container and freeze for up to 3 months. Defrost thoroughly at room temperature, or in the fridge for 24 hours, then reheat until piping hot."
    ],
    "title": "Moroccan-style chicken casserole",
    "videos": "[]"
}