{
    "title": "Mushroom biryani",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "Spice up a vegetarian dinner party with this delicious recipe for mushroom biryani. Equipment and preparation: You’ll need 4 x 10cm/4in chef’s rings greased with butter.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the omelettes": [
            "3 free-range eggs",
            "1 tbsp chopped fresh coriander",
            "knob of butter"
        ],
        "For the marinade": [
            "vegetable oil, to fry",
            "500g/1lb 2oz brown cap and button mushrooms",
            "2 garlic cloves, crushed",
            "5cm/2in piece fresh ginger, grated",
            "pinch cayenne pepper",
            "20g/¾oz ground paprika",
            "20g/¾oz ground cumin",
            "salt, to taste",
            "1 litre/1¾ pints natural yoghurt"
        ],
        "For the paste": [
            "2 red chillies",
            "2 garlic cloves, crushed",
            "5cm/2in piece fresh ginger, grated",
            "pinch turmeric",
            "15g/½oz garam masala",
            "pinch salt"
        ],
        "For the rice": [
            "50ml/2fl oz vegetable oil",
            "½ onion, sliced",
            "250g/9oz basmati rice, washed, soaked in water for 30 minutes",
            "300ml/10½fl oz vegetable stock",
            "1 tbsp rosewater",
            "handful chopped fresh mint",
            "1 lemon, juice only",
            "4 bay leaves"
        ],
        "To serve": [
            "1 lime, juice only",
            "200ml/7fl oz medium curry sauce, warmed"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the omelette, whisk the eggs in a bowl with the chopped coriander. Melt the butter in a saucepan and fry the eggs until golden-brown on each side. Remove the omelette from the frying pan and roll it up into a cigar shape. Slice thinly and set aside.",
        "In a separate pan, heat a dash of oil and fry the mushrooms for 2-3 minutes or until golden-brown. Meanwhile, combine the marinade ingredients in a bowl. Add the cooked mushrooms to the bowl and set aside.",
        "For the paste, place the chillies, garlic, ginger, turmeric, garam masala and salt in a food processor and blend until smooth. Set aside.",
        "For the rice, heat the vegetable oil in a heavy-based frying pan and gently fry the onions until soft. Add the paste and cook for five minutes.",
        "Stir the rice into the onion mixture and fry for three minutes. Add just enough stock to cover the rice. Season with salt and freshly ground black pepper and cook for 20 minutes. (Add additional stock if the rice become too dry).",
        "Add one tablespoon of rosewater and mix until well combined. Drain the rice and add the chopped fresh mint and lemon juice. Season with salt and keep warm.",
        "Place the chefs' rings onto a baking tray. Put a bay leaf in the middle of each ring and add a layer of rice. Place a layer of mushrooms on top and finish with a final layer of rice. Cover the ring with aluminium foil and cook in the oven for 10 minutes.",
        "Once cooked, squeeze some lime juice over the rice. Cover with the omelette and drizzle a little of the warmed curry sauce."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}