{
    "title": "Naan bread",
    "cookTime": "less than 10 mins",
    "prepTime": "1-2 hours",
    "serves": "Makes 5",
    "recommendations": "105",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/naan_86626_16x9.jpg"
    ],
    "description": "Anjum Anand’s simple naan breads, flavoured with garlic and fresh coriander, are quick and easy to make.",
    "author": {
        "anjum_anand": "Anjum Anand"
    },
    "show": {
        "b007szxr": "Indian Food Made Easy"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the dough": [
            "250g/9oz plain flour",
            "2 tsp sugar",
            "½ tsp salt",
            "½ tsp baking powder",
            "110-130ml/3½-4½fl oz milk",
            "2 tbsp vegetable oil, plus extra for greasing"
        ],
        "For the topping": [
            "nigella seeds, poppy seeds or sesame seeds, or chopped garlic and fresh coriander",
            "1 tbsp butter, melted, to serve"
        ]
    },
    "steps": [
        "For the dough, sift the flour, sugar, salt and baking powder into a bowl. In another bowl, mix together the milk and oil.",
        "Make a well in the centre of the flour mixture and pour in the liquid mixture. Slowly mix together the dough by working from the centre and incorporating the flour from the edges of the 'well', to make a smooth, soft dough. Knead well for 8-10 minutes, adding a little flour if the dough is too sticky.",
        "Place the dough into an oiled bowl, cover with a damp tea-towel and leave in a warm place for 10-15 minutes. Form the dough into five balls.",
        "Preheat the grill to medium and place a heavy baking sheet on the upper shelf of the grill to heat.",
        "Roll the dough balls out quite thinly, ideally in a teardrop shape, but really this is just aesthetic. Sprinkle over your chosen topping and press into the surface of the dough. Place the naans onto the hot baking sheet and grill for just 1-2 minutes, or until lightly browned. Brush with butter and serve hot."
    ],
    "howTos": [
        "kneading"
    ],
    "videos": "[]"
}