{
    "title": "Nourishing mixed seafood broth",
    "cookTime": "less than 10 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This dish lets the wonderful flavours of seafood shine through in a simple miso-flavoured broth.",
    "author": {
        "ching-he_huang": "Ching-He Huang"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1 tbsp yellow miso paste",
            "2 tbsp grated fresh root ginger",
            "100g/3½oz cooked Somen noodles",
            "2 large handful of baby pak choi (white stem variety), washed, leaves separated",
            "150g/5½oz fresh medium-sized tiger prawns, shelled with head off, tail on, cleaned and deveined",
            "100g/3½oz baby squid, tentacles separated, body sliced to give squid rings",
            "100g/3½oz mussels, preferably Greenland mussels, cleaned and de-bearded (discard any shells that are broken, or open and do not close when tapped sharply on the work surface)",
            "2 tbsp Shaoxing (Chinese rice wine) or dry sherry",
            "2 tsp low-sodium light soy sauce or tamari",
            "salt, to taste",
            "2 pinches ground white pepper",
            "2 small handfuls of coriander, roughly chopped, to garnish"
        ]
    },
    "steps": [
        "Pour 1 litre/1¾pints water into a medium wok and bring to the boil.",
        "Add the miso paste and ginger and cook on a medium heat for 5 minutes.",
        "Add the somen noodles, pak choy and all of the seafood. Cook for 1 minute until the mussel shells have opened. Discard any mussels that remain closed. Season with the rice wine, soy sauce, salt and pepper.",
        "Transfer to deep bowls, garnish with the coriander and eat immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}