{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "These little fairy cakes are filled with orange curd and topped with icing, and are even nicer than cupcakes. Equipment and preparation: you will need a bun tin lined with 12 fairy cake cases.",
    "dishes": [
        "bun",
        "cake",
        "cupcakes",
        "fairy_cakes",
        "icing",
        "muffins",
        "oven-baked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/orange_butterfly_cakes_82059_16x9.jpg"
    ],
    "ingredients": {
        "For the filling": [
            "3 tbsp orange curd"
        ],
        "For the icing": [
            "50g/1¾oz soft butter",
            "100g/3½oz sifted icing sugar"
        ],
        "To finish": [
            "icing sugar, to dust"
        ],
        "default": [
            "100g/3½oz baking spread",
            "100g/3½oz caster sugar",
            "2 large free-range eggs",
            "100g/3½oz self-raising flour",
            "1 level tsp baking powder",
            "1 orange, grated zest only"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "19",
    "serves": "Makes 12",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4 (160C fan).",
        "Put all the cake ingredients into a large bowl and beat well for 2-3 minutes, or until the mixture is well-blended and smooth. Fill each paper case with about 35g/1¼oz of mixture.",
        "Bake in the preheated oven for about 15-20 minutes, or until the cakes are well risen and golden-brown. Lift the paper cases out of the bun tin and cool the cakes on a wire rack.",
        "When cool, cut a disc from the top of each cake leaving a little gap around the edge and cut this slice in half. Spoon half a teaspoonful of orange curd in each.",
        "To make the icing, beat the butter and icing sugar together until well blended. Pipe or spoon a swirl of buttercream on top of the orange curd and place the half slices of cake on top to resemble butterfly wings. Dust the cakes with icing sugar to finish."
    ],
    "tips": [
        "The cakes will keep in a cake tin for up to 3-4 days. The cakes can be frozen for up to one month. Fairy cakes are not as deep as cupcakes or muffins so look for shallower cake trays and make sure you buy the right paper case to fill the tin. You can also make these with lemon zest and lemon curd if preferred."
    ],
    "title": "Orange butterfly cakes",
    "videos": "[]"
}