{
    "author": {
        "claude_bosi": "Claude Bosi"
    },
    "cookTime": "10 to 30 mins",
    "description": "Chickpea pancakes, fish cheeks and mushroom fricassée make for an impressive dinner party dish.",
    "dishes": [
        "fricassee",
        "pancake",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the fricassée": [
            "50ml/1¾fl oz olive oil",
            "100g/3½oz butter, plus another knob for frying ceps",
            "200g/7oz shallots, finely diced",
            "1 whole unpeeled garlic clove, smashed",
            "2 sprigs thyme",
            "100g/3½oz cooked gammon, finely diced",
            "500g/1lb 2oz fresh cep mushrooms, roughly diced",
            "1 tbsp chopped fresh parsley",
            "extra virgin olive oil, for drizzling"
        ],
        "For the monkfish": [
            "12 monkfish cheeks",
            "25g/1oz plain flour",
            "olive oil, for frying"
        ],
        "For the pancakes": [
            "150g/5½oz chickpea flour",
            "salt and freshly ground black pepper",
            "1 tsp thyme leaves",
            "100g/3½oz extra virgin olive oil",
            "olive oil, for frying"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the pancakes, sieve the chickpea flour into a bowl. Season with salt and pepper and add the picked thyme leaves.",
        "Add 500g/1lb 2oz of warm water and the olive oil to the bowl and whisk together to make a batter. Cover and leave to rest in the fridge, ideally for 48 hours, before using.",
        "For the fricassée, heat a large frying pan. Heat the oil and butter and add the shallots, garlic and thyme.",
        "When the shallot and garlic has softened, add the gammon to the shallot mixture. Remove and discard the garlic and thyme. Set the fricassée aside.",
        "For the monkfish, dust the fish in the flour. Heat a dash of oil and fry the fish on both sides until blonde in colour.",
        "For the pancakes, heat a non-stick pan with a little oil and add a ladle of the chickpea batter. Gently fry until crisp on one side, then flip and repeat on the other side. Remove the pancakes and set aside. Repeat to use up all the batter.",
        "To finish the fricassée, heat a little oil and a knob of butter. Fry the ceps until golden-brown. Season with salt and freshly ground black pepper.",
        "To serve, stir the cooked ceps and chopped parsley into the fricassée. Place a pancake onto each of four plates and spoon the fricassée over the pancake. Drizzle some extra virgin olive oil over the top and sit the monkfish cheeks on top."
    ],
    "tips": [
        
    ],
    "title": "Pan-fried monkfish cheeks, ceps ‘paysanne’ and chickpea farinata",
    "videos": "[]"
}