{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "less than 10 mins",
    "description": "The lovely earthiness of beetroot goes brilliantly with oily fish such as mackerel and its beautiful colour is a feast for the eyes, too.",
    "dishes": [
        "jam",
        "pickle",
        "salad",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "4 mackerel, filleted",
            "1 tbsp olive oil",
            "2 tbsp rice wine vinegar",
            "1 tsp caster sugar",
            "pinch salt",
            "2 banana shallots, finely sliced into rings",
            "3 tbsp celery leaves",
            "2 tbsp chervil sprigs (or parsley)",
            "50g/1¾oz baby watercress sprigs",
            "4 tbsp croutons",
            "500g/1lb 2oz cooked beetroot, thinly sliced",
            "1 tbsp French mustard",
            "1 tbsp lemon juice",
            "3 tbsp olive oil",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Heat a frying pan until hot, add the olive oil and the mackerel fillets, skin side down, and cook for two minutes until the flesh changes colour halfway up the fish.",
        "Flip the fillets over and cook for one more minute then remove from the heat and set aside to rest for a couple of minutes.",
        "Heat the rice wine vinegar and sugar together in a saucepan then add the shallot rings and salt. Leave to macerate for a few minutes.",
        "Meanwhile, toss the celery leaves, chervil (or parsley), watercress and croutons together.",
        "Set aside two-thirds of the beetroot.",
        "Place the remaining beetroot into a food processor and blend to make a fine purée then pass it through a sieve into a bowl.",
        "Add the mustard and lemon juice then whisk in the olive oil and season to taste with salt and freshly ground black pepper.",
        "To serve, lay the reserved beetroot onto the plates and top with the pickled shallots.",
        "Toss the salad with a little of the dressing then place on top of the beetroot slices.",
        "Add the mackerel fillets then drizzle over more of the dressing."
    ],
    "tips": [
        
    ],
    "title": "Pan-fried mackerel with beetroot and celery salad",
    "videos": "[]"
}