{
    "author": {
        
    },
    "cookTime": "10 to 30 mins",
    "description": "An easy way to turn pancakes into a delicious dessert fit for any dinner party. It’s better to use smaller berries as they defrost faster.",
    "dishes": [
        "oven-baked_dishes",
        "pancake",
        "pie"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/pancakes_with_berries_54226_16x9.jpg"
    ],
    "ingredients": {
        "For the topping": [
            "100g/3½oz white chocolate, broken into small pieces",
            "200g/7oz mixed frozen berries"
        ],
        "default": [
            "50g/1¾oz plain flour",
            "small pinch salt",
            "1 medium free-range egg",
            "150ml/5fl oz milk",
            "2 tsp vegetable oil or melted butter, plus extra for frying"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Put the flour and salt in a large bowl. Make a well in the centre, pour in the milk and crack in the egg. Using a whisk, gradually incorporate the flour into the wet ingredients until you have a smooth batter. Add the vegetable oil and mix thoroughly.",
        "Heat a large frying pan over a medium heat. Add a little oil and use kitchen paper to smear it all over the base of the pan. Add a small ladleful of batter and swirl it around the pan to create a thin, even layer. Cook for 1-2 minutes, or until the batter is a little darker and set in the middle (to check, lift the edge of the pancake and check the underside is lightly golden-brown). Flip it over and cook the other side for 30-40 seconds. Transfer to a warm plate and cover with a clean tea towel to keep it warm. Cook the remaining batter in the same way to make 3 more pancakes.",
        "For the topping, melt the chocolate in a heatproof bowl set over a pan of gently simmering water. Alternatively, melt the chocolate in short bursts in a microwave.",
        "Put a pancake on each serving plate and divide the frozen berries between them. Drizzle the melted chocolate over the top and serve immediately. The heat of the pancakes and chocolate will thaw the berries quickly, but you want them to be chilled (it’s the contrast of temperatures that makes it so special)."
    ],
    "tips": [
        "Pancakes are best served straight from the pan, but if it’s more convenient to make them in advance, simply stack the cooked pancakes with a piece of baking paper between each one. They can be reheated in a low oven for 10-15 minutes or in short 10-second bursts in a microwave (check them between each burst as they will become rubbery if overheated)."
    ],
    "title": "Pancakes with berries and white chocolate",
    "videos": "[]"
}