{
    "author": {
        "mark_sargeant": "Mark Sargeant"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the dressing": [
            "12 small tomatoes, cut into quarters",
            "12 black olives, pits removed, cut in half",
            "2 tbsp extra virgin olive oil",
            "2 tbsp red wine vinegar",
            "salt and freshly ground black pepper",
            "1 tbsp fresh marjoram leaves"
        ],
        "For the lamb": [
            "12 lamb cutlets, trimmed",
            "salt and freshly ground black pepper",
            "1 tbsp olive oil",
            "2 garlic cloves, lightly crushed",
            "2 sprigs fresh rosemary",
            "6 anchovies, finely chopped"
        ],
        "For the peas": [
            "25g/1oz butter",
            "300g/10½oz fresh peas, blanched",
            "2 tbsp fresh marjoram leaves",
            "2 tbsp crème fraîche"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the lamb, season the lamb cutlets with salt and freshly ground black pepper. Heat a frying pan until hot, add the olive oil, lamb cutlets, garlic, rosemary and two of the chopped anchovies. Fry the lamb for 2-3 minutes on each side, until golden-brown and cooked to your liking. Remove from the pan and set aside to rest in a warm place.",
        "For the dressing, return the pan to the heat and add the tomatoes, olives and remaining chopped anchovies. Sauté gently for 2-3 minutes.",
        "In a small bowl, whisk together the extra virgin olive oil and vinegar. Season, to taste, with a little salt and freshly ground black pepper, then pour into the pan and warm through. Add the marjoram leaves and stir.",
        "For the peas, heat a frying pan, add the butter, peas and marjoram and cook gently for 2-3 minutes, or until the peas are tender and warmed through. Using a potato masher, lightly crush the peas. Stir in the crème fraîche and season, to taste, with salt and freshly ground black pepper.",
        "To serve, pile the peas into the centre of four serving plates and top each one with three lamb cutlets. Spoon the dressing around the edge of the plate and serve."
    ],
    "tips": [
        
    ],
    "title": "Pan-fried lamb cutlets with marjoram crushed peas and tomato and anchovy dressing",
    "videos": "[]"
}