{
    "title": "Pan-fried scallops with sautéed potatoes, roasted cherry tomatoes and mustard and herb dressing",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "richard_phillips": "Richard Phillips"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the sautéed potatoes": [
            "1 tbsp olive oil",
            "½ large potato, peeled and sliced into rounds 1cm/½in thick",
            "salt and freshly ground black pepper"
        ],
        "For the roasted cherry tomatoes": [
            "handful ripe cherry tomatoes",
            "1 tbsp olive oil",
            "salt and freshly ground black pepper"
        ],
        "For the dressing": [
            "1 tbsp tomato ketchup",
            "1 tsp Dijon mustard",
            "½ tsp Tabasco sauce",
            "½ tsp Worcestershire sauce",
            "1 tbsp olive oil",
            "1 tsp chopped fresh tarragon"
        ],
        "For the scallops": [
            "2 tsp olive oil",
            "2 scallops, removed from their shells, cut in half across the middle to form 2 discs"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the sautéed potatoes, heat the olive oil in a non-stick frying pan and fry the potatoes, turning occasionally, until golden-brown and tender. Season, to taste, with salt and freshly ground black pepper and keep warm.",
        "For the roasted cherry tomatoes, place the cherry tomatoes on a baking sheet, drizzle with oil and season, to taste, with salt and freshly ground black pepper.",
        "Roast in the oven for 8-10 minutes, or until they are just starting to collapse.",
        "For the dressing, place the dressing ingredients into a small bowl and whisk together.",
        "For the scallops, heat the oil in a small non-stick frying pan and fry the scallop discs for 30 seconds on each side, or until just cooked through.",
        "To serve, place the potatoes onto a serving plate and top with the scallops and cherry tomatoes. Drizzle over the dressing."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}