{
    "title": "Pan-fried sea bass with Jersey Royals and watercress salsa verde",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "300g/10½oz Jersey Royal potatoes (or similar new potatoes), scrubbed",
            "4 tbsp olive oil",
            "salt and freshly ground black pepper",
            "4 sea bass fillets"
        ],
        "For the watercress salsa verde": [
            "150g/5oz watercress, leaves only",
            "3 tbsp chopped fresh flatleaf parsley",
            "2 large spring onions, roughly chopped",
            "1 garlic clove, roughly chopped",
            "1 lemon, zest only",
            "2 tbsp capers, rinsed and drained",
            "2 tbsp toasted breadcrumbs",
            "3 tbsp extra virgin olive oil",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Place the potatoes into a pan of water and bring to the boil. Cook for 8-10 minutes, until the potatoes are tender. Drain, return to the pan and add two tablespoons of the olive oil, and season well with salt and freshly ground black pepper. Mix well to combine.",
        "Season the sea bass fillets with freshly ground black pepper.",
        "Heat a frying pan until hot, add the remaining two tablespoons of olive oil and the sea bass fillets. Cook on each side for 2-3 minutes, until just cooked through. Remove from the pan and leave to rest for two minutes.",
        "For the watercress salsa verde, bring a small clean pan of salted water to the boil. Add the watercress and cook for one minute. Drain and refresh the watercress in iced water.",
        "Transfer the watercress to a food processor and add the remaining ingredients and process to a purée. Season, to taste, with salt and freshly ground black pepper.",
        "To serve, place equal amounts of potatoes onto each plate. Place a sea bass fillet alongside and serve with a spoonful of salsa verde."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}