{
    "author": {
        "antonio_carluccio": "Antonio Carluccio"
    },
    "cookTime": "over 2 hours",
    "description": "Beetroot goes surprisingly well with the creamy panna cotta and the lime syrup gives a tangy zing.",
    "dishes": [
        "panna_cotta",
        "sauce",
        "stir-fries",
        "upside-down_cake"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the lime syrup": [
            "150g/5½oz sugar",
            "1 tbsp water",
            "1 lime, zest only, cut into very small strips",
            "2 limes, juice only"
        ],
        "For the panna cotta": [
            "3 small gelatine leaves",
            "250ml/9fl oz double cream",
            "50ml/2fl oz milk",
            "150g/5½oz sugar",
            "1 tbsp dark rum",
            "1 tsp vanilla essence",
            "2 golden or red beetroot, cooked, peeled and cut into small cubes"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b016pbs9": "Great British Food Revival"
    },
    "steps": [
        "Put the gelatine leaves into a bowl of cold water to soften. Place the cream and milk into a small saucepan and bring to a boil. Add the sugar and the softened gelatine and stir until both have dissolved. Pour in the rum and vanilla essence and mix until well combined.",
        "Remove the pan from the heat, divide the mixture between four individual ramekins and chill in the fridge for 2 –3 hours.",
        "To make the syrup, heat the sugar and water with the lime zest and juice until the sugar has dissolved and the syrup is transparent. Remove the pan from the heat and set aside to cool.",
        "To loosen the panna cottas, dip each ramekin into hot water for a few seconds then upside down and gently release onto a serving plate.",
        "Decorate each panna cotta with the cooked beetroot cubes and spoon over the lime syrup."
    ],
    "tips": [
        
    ],
    "title": "Panna cotta with beetroot and lime syrup",
    "videos": "[]"
}