{
    "author": {
        "lesley_waters": "Lesley Waters"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "oven-baked_dishes",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the leek and cranberry sauce": [
            "25g/1oz butter",
            "1 tbsp olive oil",
            "1 leek, washed and roughly chopped",
            "1 large handful cranberry",
            "2 tbsp balsamic vinegar",
            "4 tbsp soft brown sugar"
        ],
        "For the roast swede and chestnuts": [
            "½ swede chopped into large chunks",
            "50g/1¾oz butter",
            "1 tbsp olive oil",
            "1 tin cooked, whole chestnuts"
        ],
        "default": [
            "½ goose breast",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Season the goose breast with salt and freshly ground black pepper and place, skin-side down into a hot oven-proof frying pan. Cook for five minutes until golden. Turn and cook for another minute.",
        "Drain the fat from the goose pan and transfer to the preheated oven for ten minutes, or until cooked through. Take out once cooked and leave to rest.",
        "Meanwhile, place the swede into a saucepan of boiling water and cook for eight minutes. Drain and set aside.",
        "In a separate oven-proof frying pan, melt the butter with the oil. Add the chestnuts and cooked swede and transfer to the preheated oven to roast for five minutes, or until golden.",
        "For the leek and cranberry sauce, heat the oil and melt the butter in a saucepan. Add the leeks and cook for five minutes until soft.",
        "Add the cranberries, balsamic vinegar and brown sugar and cook for a further five minutes.",
        "To serve, place the goose breast on a warm plate with the roasted swede and chestnuts. Spoon over the leek and cranberry sauce."
    ],
    "tips": [
        
    ],
    "title": "Pan-roasted goose breast with roast swede and chestnuts and leek and cranberry sauce",
    "videos": "[]"
}