{
    "author": {
        "oliver_rowe": "Oliver Rowe"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "",
    "dishes": [
        "bun",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the cabbage": [
            "1 lemon, juice only",
            "1 garlic clove, crushed",
            "salt and freshly ground black pepper",
            "150ml/5fl oz rapeseed oil",
            "½ hispi cabbage, finely sliced",
            "bunch of fresh dill, roughly chopped"
        ],
        "For the pan-roast chicken": [
            "1 lemon, zest only",
            "2 garlic cloves, crushed",
            "2 sprigs fresh thyme",
            "75ml/2½fl oz white wine",
            "2 tbsp rapeseed oil",
            "4 chicken legs, bones removed, skin on",
            "2 chicken breasts, wing bone on, skin on"
        ],
        "For the sauce": [
            "1 tbsp olive oil",
            "2 shallots, finely chopped",
            "100ml/3½fl oz white wine",
            "350ml/12oz crème fraîche"
        ],
        "For the spätzle": [
            "250g/9oz plain flour",
            "½ tsp celery seeds",
            "½ tsp salt",
            "pinch freshly ground black pepper",
            "7 large free-range eggs",
            "3 tsp rapeseed oil"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the chicken, place the lemon zest, garlic, thyme and wine into a bowl and mix well.",
        "Smear the marinade mixture over the flesh of the chicken to cover, then place flesh-side down in a dish and place in the fridge to marinate for at least one hour, preferably overnight.",
        "Preheat the oven to 230C/445F/Gas 8.",
        "Place a large, ovenproof frying pan over a medium heat. When hot, add the rapeseed oil and the chicken pieces skin-side down. Fry for 3-4 minutes, until golden-brown, then turn the chicken over and transfer to the oven to roast for 8-10 minutes, until cooked through and tender.",
        "To make the spätzle, place the flour, celery seed, salt, pepper and eggs into a food processor and blend until combined into a smooth, thick batter.",
        "Bring a large saucepan of salted water to the boil. Add a teaspoon of the oil to the water.",
        "Spoon the batter mixture into a thin-nozzled piping bag and drizzle the batter across the boiling water. Boil for 2-3 minutes, until cooked through.",
        "Place a frying pan over a medium heat. When hot add the remaining two teaspoons of rapeseed oil.",
        "Drain the spätzle and place straight into the hot frying pan. Fry the spätzle for 1-2 minutes, until just coloured, then remove and set aside in a bowl.",
        "To make the sauce, heat a small frying pan over a low heat. When warm add the olive oil and shallots and fry for 4-5 minutes, until softened.",
        "Add the wine, bring to the boil and reduce the liquid volume by a third.",
        "Add the crème fraîche, reduce the heat and warm the sauce through.",
        "Spoon half of the sauce over the spätzle and stir to combine.",
        "For the cabbage, whisk the lemon and garlic together in a bowl and season with salt and freshly ground black pepper. Add the oil and whisk again.",
        "Pour the dressing over the cabbage, add the dill and stir.",
        "To serve, carve the chicken into several pieces, place onto warmed plates with a spoonful each of spätzle and cabbage. Drizzle over the remaining sauce to taste."
    ],
    "tips": [
        
    ],
    "title": "Pan-roast chicken with crème fraîche spatzle",
    "videos": "[]"
}