{
    "author": {
        "allegra_mcevedy": "Allegra McEvedy"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This rich meat pasta recipe is perfect for bringing a bit of luxury to your mid-week meals.",
    "dishes": [
        "pappardelle",
        "pasta",
        "salsa",
        "sauce",
        "slow-cooked_dishes",
        "stew",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/pappardellewithslowc_92023_16x9.jpg"
    ],
    "ingredients": {
        "For the tomato salsa": [
            "400g/14oz vine-ripened tomatoes, each cut into eight wedges",
            "handful chopped fresh basil leaves",
            "handful chopped fresh flatleaf parsley leaves",
            "1½ tsp red wine vinegar",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "250g/9oz dried egg pappardelle, cooked according to packet instructions, drained, to serve",
            "1 heaped tbsp butter, softened",
            "40g/1½oz freshly grated parmesan"
        ],
        "default": [
            "2 tbsp olive oil",
            "400g/14oz stewing beef, cubed",
            "700ml/1¼ pints hot water or beef stock",
            "300g/10½oz mixed mushrooms (such as oyster, button or shiitake), washed thoroughly, roughly sliced",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "20",
    "serves": "4",
    "show": {
        "b00m1c34": "Economy Gastronomy"
    },
    "steps": [
        "Heat the oil in a heavy-based pan. Add the beef and brown all over, stirring regularly.",
        "Add the mushrooms and pour over the water or beef stock. Bring the mixture to a simmer. Half-cover the pan with a lid and continue to cook the mixture over a high heat, stirring regularly, for 30-45 minutes, or until the volume of liquid has reduced, the sauce has thickened and the meat is tender enough to break down using a wooden spoon.",
        "For the tomato salsa, in a bowl, mix together all of the tomato salsa ingredients until well combined.",
        "Add the cooked, drained pasta, softened butter and half of the grated parmesan to the slow-cooked beef and mushrooms, stirring well until the pasta is coated in the sauce and the butter has melted.",
        "Divide the pappardelle with slow-cooked beef and mushrooms equally among four serving bowls. Spoon over the tomato salsa and sprinkle over the remaining parmesan."
    ],
    "tips": [
        
    ],
    "title": "Pappardelle with slow-cooked beef and mushrooms",
    "videos": "[]"
}