{
    "title": "Parmesan roast parsnips and carrots",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 7-8",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Jazz up roast carrot and parsnips with a sprinkle of Parmesan. This recipe is perfect for prepping in advance giving you more room in your oven on Christmas day. Find out how to make ahead in the tips section.",
    "author": {
        "deborah_reddihough": "Deborah Reddihough"
    },
    "show": {
        "b0520lz9": "Eat Well for Less?"
    },
    "tips": [
        "To make ahead, simply remove the vegetables from the oven 5 minutes before the end of the cooking time. Leave to cool, then transfer to the freezer. To reheat, tip the frozen vegetables into a roasting tray and roast for 10-15 minutes, or until piping hot. Make the process easier by using disposable foil roasting tins which can also be frozen."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "7-8 carrots, peeled and trimmed",
            "7-8 parsnips, peeled and trimmed",
            "3 tbsp olive oil",
            "30g/1oz Parmesan, grated",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "Cut the carrots and parsnips in half lengthways and cut any particularly large pieces in half again. Bring a large saucepan of water to the boil and add the vegetables. Boil for 3 minutes, or until the vegetables are just beginning to soften (you want them to keep their shape while roasting).",
        "Drain well and divide between 2 roasting trays (if the tray is crowded the vegetables won’t crisp up as well). Add the oil and mix to coat the vegetables. Season with salt and pepper and top with the Parmesan.",
        "Roast for 25 minutes or until the carrots and parsnips are golden-brown at the edges."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}