{
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "cookTime": "less than 10 mins",
    "description": "Put away those toasted nuts and crisps says Lorraine Pascale... Canapés have reached a whole new dimension! Equipment and preparation: You will need 10 white round lollipop sticks, a round 9cm/3½in chefs’ ring or cookie cutter and two baking trays.",
    "dishes": [
        "canape",
        "oven-baked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/parmesan_and_poppy_seed_44968_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "butter, for greasing",
            "80g/3oz parmesan, finely grated (or similar alternative vegetarian hard cheese)",
            "1 tsp poppy seeds",
            "1 tsp sesame seeds"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "17",
    "serves": "Makes 10",
    "show": {
        "b00xnbkv": "Baking Made Easy"
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7, line two large baking trays with baking paper and grease them with butter.",
        "Toss the cheese and seeds together in a small bowl. Sit a 9cm/3½in chefs’ ring or cookie cutter on one of the baking trays and sprinkle a small handful of the cheese mixture into it, in a thin layer. Carefully lift the ring off to reveal a neat-edged disc of parmesan and lay a lollipop stick on top, with the tip of the stick touching the middle of the disc.",
        "Repeat with the remaining cheese and sticks to make 10 in total (leaving about 3cm/1¼in spaces between them to allow for any spreading during cooking).",
        "You should have a little parmesan left over, so use it to cover up the part of the lollipop stick resting on the disc.",
        "Bake in the oven for five minutes, swapping the lollipops to a different shelf halfway through. The cheese should be lightly golden-brown and bubbling.",
        "Remove from the oven and slide the paper off the baking trays and onto a rack to help speed up cooling. Leave to cool for 1–2 minutes, or until the lollipops have become crisp. Very carefully remove each one with a palette knife. I like to serve these stuck upright into a box with holes in the top."
    ],
    "tips": [
        
    ],
    "title": "Parmesan and poppy seed lollipops",
    "videos": "[]"
}