{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Spanish",
    "description": "Patatas bravas as they should be: crisp, olive oil-fried potatoes topped with a tomato sauce, well-flavoured with hot pimentón and sharpened with a little vinegar.",
    "dishes": [
        "pie",
        "salsa",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/patatas_bravas_72566_16x9.jpg"
    ],
    "ingredients": {
        "For the potatoes": [
            "1.5kg/3lb 5oz floury potatoes, such as Maris Piper or King Edwards, peeled",
            "180ml/6fl oz olive oil, for shallow frying",
            "salt"
        ],
        "For the salsa brava": [
            "3 tbsp olive oil",
            "1 tsp pimentón picante (smoked hot Spanish paprika), plus extra for serving",
            "½ tsp crushed dried chilli flakes",
            "½ tsp Tabasco sauce",
            "1 tbsp red wine vinegar",
            "125ml/4fl oz tomato sauce (see Top recipe tip below)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "24",
    "serves": "Serves 8–10 as a tapas",
    "show": {
        "b012m947": "Rick Stein's Spain"
    },
    "steps": [
        "For the salsa brava, heat the olive oil over a low heat, add the pimentón, chilli flakes, Tabasco and vinegar and mix together well. Stir in the tomato sauce and season to taste with salt and freshly ground black pepper (thin the mixture with a little water if necessary).",
        "Cut the potatoes into small, even-sized pieces. Drop into a large pan of well-salted water and cook for 6-7 minutes, or until just tender. Drain well.",
        "Heat the olive oil in two large, non-stick frying pans, divide the potatoes between them and shallow-fry in a single layer for 10–12 minutes, turning them regularly, until crisp, golden-brown all over and sandy in texture.",
        "Spoon the potatoes into one large or small individual serving plates, drizzle over the sauce, sprinkle with a pinch of pimentón and serve with some toothpicks and napkins."
    ],
    "tips": [
        "Use Rick Stein's Simple tomato sauce for this recipe."
    ],
    "title": "Patatas bravas",
    "videos": "[]"
}