{
    "title": "Pea and goats’ cheese risotto",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "7",
    "images": [
        
    ],
    "description": "A warm risotto is lovely on a cold day - and rice and peas is a nutritious combo too. If you’re not a fan of goats’ cheese then swap it for another type. This is designed to be a low cost recipe.",
    "author": {
        "marcus_wareing": "Marcus Wareing"
    },
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "tips": [
        "In May 2013 this recipe was costed at £3.30 at Asda, £2.96 at Tesco and £3.61 at Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1 litre vegetable stock (made with a stock cube)",
            "50g/1¾oz butter",
            "1 onion, finely diced",
            "300g/10oz risotto rice",
            "200g/7oz frozen peas, defrosted",
            "125g/4½oz soft goats’ cheese",
            "salt and black pepper"
        ]
    },
    "steps": [
        "Keep the stock warm in a pan over a low heat while you prepare the rest of the risotto.",
        "Heat a large heavy-based saucepan over a medium heat. Add the butter and, once melted, add the onion along with a pinch of salt. Cook gently until the onion is softened and translucent. Turn up the heat a little and stir in the risotto rice, making sure each grain is coated in the melted butter. Cook the rice for 1-2 minutes, or until the grains become translucent at the outer edges.",
        "Pour in a ladleful of stock and stir to mix into the rice. Reduce the heat slightly to medium. Once the stock is absorbed add another ladleful and repeat, waiting for the stock to absorb before adding more. Stir continuously.",
        "Once three quarters of the stock has been incorporated, taste and check the rice. It should be soft but retaining a slight bite. Continue to add the remaining stock if it’s not quite cooked. Once ready, stir in the defrosted peas and reduce the heat to low. Mix well and leave to stand for 2-3 minutes to warm the peas through. Taste and adjust the seasoning as necessary.",
        "Just before serving, dot the risotto with three quarters of the goats’ cheese giving it a stir to slightly mix the cheese through. Serve hot with the remaining goats’ cheese dotted over the top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}