{
    "author": {
        "monica_galetti": "Monica Galetti"
    },
    "cookTime": "10 to 30 mins",
    "description": "How can you make a chocolate fondant even better? Add peanut butter, that’s how. Monica Galetti’s fondants are surprisingly easy to make and fabulously indulgent. Serve with cheat’s banana ice cream for a dessert that is bound to impress. Equipment and preparation: For this recipe you will need a piping bag and 4 silver cooking rings (7cm/2¾in diameter and 5cm/2in deep).",
    "dishes": [
        "chocolate_fondant",
        "oven-baked_dishes",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the banana ice cream": [
            "4 bananas, peeled, chopped and frozen",
            "100g/3½oz crème fraîche"
        ],
        "For the fondants": [
            "40g/1½oz butter",
            "65g/2¼oz smooth peanut butter",
            "45g/1¾oz good-quality dark chocolate, minimum 65% cocoa solids",
            "100g/3½oz caster sugar",
            "2 medium free-range eggs",
            "35g/1¼oz plain flour"
        ],
        "To serve": [
            "75g/2¾oz toasted peanuts, chopped"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "9",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas Mark 4.",
        "Melt the butter, peanut butter and chocolate in a medium saucepan. Remove from the heat and whisk in the sugar, eggs and flour.",
        "Transfer the mixture to a bowl and leave to cool. Place in the fridge to rest for 10 minutes.",
        "Meanwhile, line 4 silver rings (7cm/2¾in diameter and 5cm/2in deep) with baking paper and place on a lined baking tray.",
        "Pour the fondant mixture into a large piping bag and pipe the mixture into the rings (alternatively spoon in). Bake for 8-10 minutes.",
        "Meanwhile, for the ice cream, put the bananas in a blender and blitz until smooth. Add the crème fraîche and blend until smooth.",
        "Carefully transfer the fondants to serving plates using a spatula, then remove the rings and paper. Serve with a good dollop of the ice cream alongside and scatter over the toasted peanuts."
    ],
    "tips": [
        "If you don't have silver rings, the fondants can be made with ramekins greased with butter and dusted with flour."
    ],
    "title": "Peanut butter fondants with cheat's banana ice cream",
    "videos": "[]"
}