{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "",
    "dishes": [
        "jam",
        "oven-baked_dishes",
        "pastry",
        "pate",
        "stir-fries",
        "stuffing"
    ],
    "flags": [
        
    ],
    "howTos": [
        "trimming_pastry_case"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the duxelles (chopped mushrooms cooked in butter with shallots)": [
            "25g/1oz unsalted butter",
            "1 shallot, finely chopped",
            "1 clove garlic, crushed",
            "225g/8oz mushrooms, finely chopped",
            "good pinch of each chopped parsley and thyme",
            "salt and freshly ground black pepper"
        ],
        "For the venison": [
            "350g-450g/12-16oz ready-made puff pastry",
            "450g-675g/1lb-1lb 6oz venison loin",
            "salt and freshly ground black pepper",
            "50g/2oz unsalted butter, plus extra for greasing",
            "2 tbsp black peppercorns, crushed in a pestle and mortar",
            "200g/7oz pâté",
            "1 free-range egg, beaten",
            "roasted carrots and parsnips and braised red cabbage, to serve"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "p007b4jc": "Stately Suppers"
    },
    "steps": [
        "To make the duxelle, melt the butter in a frying pan and sauté the shallot and garlic until soft but not browned.",
        "Add the mushrooms and continue to cook for a further 2-3 minutes. Stir in the herbs. Season well with salt and freshly ground black pepper. Set aside.",
        "For the venison, roll out the pastry until large enough to wrap around the venison. Leave to rest in the fridge.",
        "Season the venison with salt and freshly ground black pepper. Heat the butter in a large frying pan and, when foaming, add the venison. Sear until coloured on all sides but not cooked. Roll in crushed black pepper and leave to cool.",
        "To make the wellington, spread the pâté along the centre of the pastry and cover with the duxelle mixture. Place the fillet on top. Brush the edges of the pastry with the beaten egg and fold over to enclose the meat and stuffing. Trim off any excess pastry and turn the parcel onto a buttered roasting tray. Leave to rest in the fridge for 30 minutes. Preheat the oven to 220C/425F/Gas 7.",
        "Brush the pastry with a little more beaten egg and cook in the oven for 20-25 minutes until golden.",
        "Serve with roasted carrots and parsnips and braised red cabbage."
    ],
    "tips": [
        
    ],
    "title": "Peppered fillet of venison Wellington",
    "videos": "[]"
}