{
    "author": {
        
    },
    "cookTime": "less than 10 mins",
    "description": "This is a speedy supper, perfect for a busy evening. Horseradish sauce adds a kick to the salad dressing. As part of an Intermittent diet plan, 1 serving provides 1 of your 6 daily vegetable portions and 148 kcal. If eating it as part of a daily Intermittent diet menu, also enjoy a piece of fruit with this meal (about 70 calories).",
    "dishes": [
        "pie",
        "salad",
        "sauce",
        "warm_salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/peppered_beef_with_salad_27535_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "2 thick-cut sirloin steaks, about 175g/6oz in total, fat trimmed",
            "1 tsp coloured peppercorns, coarsely crushed",
            "coarse salt flakes",
            "60g/2¼oz natural yoghurt",
            "½ tsp horseradish sauce (to taste)",
            "½ garlic clove, crushed",
            "50g/2oz mixed green salad leaves",
            "30g/1¼oz button mushrooms, sliced",
            "½ red onion, thinly sliced",
            "1 tsp olive oil",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 2",
    "show": {
        
    },
    "steps": [
        "Rub the steaks with the crushed peppercorns and salt flakes.",
        "Mix together the yoghurt, horseradish sauce and garlic and season to taste with salt and freshly ground black pepper. Add the salad leaves, mushrooms and most of the red onion and toss gently.",
        "Heat the oil in a frying pan, add the steaks and cook over a high heat for 2 minutes, or until browned. Turn over and cook for a further 2 minutes for medium rare, 3-4 minutes for medium or 5 minutes for well done. Place the steak on a warm plate and allow to rest for a few minutes.",
        "Spoon the salad leaves into the centre of 2 serving plates. Thinly slice the steaks and arrange the pieces on top. Garnish with the remaining red onion."
    ],
    "tips": [
        
    ],
    "title": "Peppered beef with salad leaves",
    "videos": "[]"
}