{
    "author": {
        "ching-he_huang": "Ching-He Huang"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "Give tarte tatin a tropical twist by swapping apple for pineapple.",
    "dishes": [
        "caramel",
        "oven-baked_dishes",
        "pastry",
        "sauce",
        "tarte_tatin",
        "upside-down_cake"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the syrup": [
            "4 tbsp maple syrup",
            "4 tsp coconut rum",
            "4 tsp freshly squeezed lime juice"
        ],
        "For the tarts": [
            "8 slices tinned pineapple, reserve the tinned syrup",
            "320g/11½oz ready rolled puff pastry",
            "1 free-range egg, beaten"
        ],
        "To garnish": [
            "1 lime, zest only"
        ],
        "To serve": [
            "vanilla ice cream"
        ],
        "default": [
            "100g/3½oz demerara sugar"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6. Line 4 crumpet rings (8cm/3¼in in diameter) with greaseproof paper.",
        "Heat a pan, melt the sugar in the pan then remove from the heat",
        "Meanwhile put the lined tins in the oven for 5 minutes. Then remove from the oven and pour in the hot caramel. Place 2 pineapple slices on top of the caramel in each ring.",
        "Cut 4 circles from the puff pastry big enough to cover the ring. Cover the pineapple slices with the pastry, pushing the pastry right to the bottom of the pineapple, touching the caramel sauce.",
        "Place the 4 rings on a baking tray lined with greaseproof paper. Brush the tops of the pastry with some beaten egg.",
        "Place them in the oven and cook for 20 minutes until the pastry is golden-brown.",
        "Meanwhile, for the syrup, in a small bowl, mix together the maple syrup, rum, lime juice, and 4 tablespoons of the reserved pineapple syrup.",
        "Tip the tart upside down and remove the greaseproof paper. Place on a plate and serve with a scoop of vanilla ice cream over the top drizzle with some of the syrup. Garnish with lime zest and serve."
    ],
    "tips": [
        
    ],
    "title": "Pineapple tarte tatin with rum syrup",
    "videos": "[]"
}