{
    "title": "Popcorn espresso macchiato balls",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 18 popcorn balls",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/popcorn_espresso_84427_16x9.jpg"
    ],
    "description": "Stonkingly moreish, these popcorn balls are squidged together with marshmallow and blessed with a liberal sprinkling of crunchy, ground espresso coffee.",
    "author": {
        "kitty_hope_and_mark_greenwood": "Kitty Hope and Mark Greenwood"
    },
    "show": {
        "b04d9lns": "Sweets Made Simple"
    },
    "tips": [
        "These are best eaten on the day of making."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1 tbsp oil",
            "50g/1¾oz popcorn kernels",
            "100g/3½oz mini marshmallows",
            "30g/1oz unsalted butter",
            "50g/1¾oz white chocolate, grated",
            "¾ tsp ground coffee beans"
        ]
    },
    "steps": [
        "Heat the oil gently in a heavy-based pan and add the popcorn. Cover with a lid and allow to cook on a low heat. After about five minutes you’ll hear the corn start to pop. Once the corn has finished popping take it off the heat.",
        "While the popcorn is cooking, heat the marshmallows in a pan with the butter to melt the two together, stirring occasionally. Turn off the heat when melted.",
        "Once the popcorn has finished popping, pour the marshmallow mixture into the popcorn pan and add the grated white chocolate. Sprinkle over the ground coffee and stir everything together. Set aside for about five minutes until it’s cool enough to handle.",
        "Take a large tablespoon of the mixture. Butter your hands, then roll and squeeze the popcorn into a round ball (you can wear gloves for this if you don’t want to get messy). Set aside on a baking sheet to cool completely."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}