{
    "title": "Porcini (cep) lasagne",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "",
    "author": {
        "hugh_fearnley-whittingstall": "Hugh Fearnley-Whittingstall"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "at least 500g/1lb 2oz fresh porcini, or other boletus (ideally twice that quantity)",
            "275g/10oz parma ham, sliced very finely",
            "white lasagne sheets, ideally fresh, but dried can be used (enough to make at least 3 layers in an 20cmx25cm/8x10in baking tray)",
            "at least 250g/9oz fresh parmesan",
            "truffle oil (optional)",
            "butter"
        ],
        "For the béchamel": [
            "500ml/17fl oz hot milk",
            "50g/2oz butter",
            "50g/2oz plain flour",
            "pinch nutmeg",
            "salt",
            "freshly ground black pepper"
        ]
    },
    "steps": [
        "To make the bé chamel sauce, mix the flour with the melted butter in the pan and cook it for a few minutes. Add the hot milk by degrees and stir to thicken. Bring to the boil and allow to simmer for just a minute. Season with nutmeg, salt and pepper.",
        "Grate half the parmesan and stir into the bé chamel. The finished bechemel should be a thick pouring consistency. Add a little more hot milk if necessary.",
        "To prepare the rest of the ingredients, slice the whole boletus into large but very thin slices. If you are using dried lasagne of the kind that requires pre-cooking, then cook according to the instructions. Scrape the rest of the parmesan into shavings with a large knife blade or potato peeler.",
        "Pour a small amount of the bé amel onto the bottom of an ovenproof dish. Put a layer of white lasagne on top followed by a layer of thinly-sliced ceps, a layer of parma ham and a layer of slivers of parmesan. Season with a few drops of truffle oil.",
        "Then pour over a layer of béamel and repeat the layers. You can make as many layers as you have ingredients, or space for, but finish with a layer of béamel sauce, some grated parmesan and a few knobs of butter.",
        "Bake for around 20-30 minutes in a fairly hot oven (190C/375F/Gas 5) until nicely browned on top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}