{
    "title": "Pork with Christmas polenta",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 6-8",
    "recommendations": "",
    "images": [
        
    ],
    "description": "A stuffed loin of is pork wrapped in pancetta and foil to roast it. The loin semi-steams in its little parcel, the pancetta sticks to the outside of the pork, and the whole thing unwrapped looks beautiful, is moist and delicious.",
    "author": {
        "john_torode": "John Torode"
    },
    "show": {
        "b03lsr84": "Christmas Kitchen with James Martin"
    },
    "tips": [
        "The pancetta can be substituted with streaky bacon or cured ham. I have given a recipe for 6-8 but a small piece of pork will do for two people. Have your butcher prepare the pork for you - it will save time and all the hassle."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the stuffed pork": [
            "2kg/4lb 8oz loin of pork, skin removed",
            "salt and pepper",
            "handful sage",
            "handful oregano",
            "handful parsley",
            "handful fresh white breadcrumbs",
            "1 lemon, zest only",
            "2 tbsp olive oil",
            "12-16 slices pancetta",
            "100ml/3½fl oz vegetable oil"
        ],
        "For the polenta": [
            "300ml/10½ fl oz milk",
            "½ tsp salt",
            "¼ tsp pepper",
            "1 garlic clove, chopped",
            "100g/3½oz instant polenta",
            "120ml/4fl oz double cream",
            "20g/¾oz grated parmesan",
            "70g/2½oz mascarpone"
        ]
    },
    "steps": [
        "For the stuffed pork, lay the pork flesh-side up on a chopping board with the belly flap away from you. With a sharp knife make an incision in the meat half way down running parallel to the board, cut almost all the way through. Open the loin up and season with salt and pepper.",
        "Chop the herbs roughly and place in a mixing bowl with the lemon zest and olive oil. Mix well.",
        "Rub the herb mixture on to the pork, being quite forceful. This will help to get the flavour and the seasoning evenly distributed. Roll up tightly and leave to sit for 20 minutes.",
        "In the meantime, cut a piece of foil large enough to wrap the pork. Lay the pancetta two pieces long on the foil, over lapping slightly. Place the pork on top and roll. Bring the pancetta up to the edge covering the pork and then roll the foil around. Twist the ends so that the parcel is very tight like a sausage.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the polenta, in a large pan bring 200ml/7fl oz water, the milk, salt, pepper and garlic to a rolling boil. Add the polenta, stirring all the time, until it returns to the boil and then cook for 45 minutes on a very low heat.",
        "For the stuffed pork, place the roasting dish over a high heat and add the vegetable oil. Put the foil parcel in the dish and cook, turning every two minutes, so all parts of the parcel have had contact with the heat. This will seal the outside and colour the outer layer of the meat. Transfer to the oven and roast for 35- 40 minutes.",
        "Remove the pork from the oven and test it is cooked by inserting a skewer through the foil and into the centre of the meat, if the juices run clear the pork is cooked. Leave to rest for five minutes.",
        "For the polenta, add the cream and parmesan. Cook until dissolved. Remove from heat and add the mascarpone.",
        "Gently unwrap the pork and cut into slices. Serve with the polenta."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}