{
    "title": "Pork skin sandwich",
    "cookTime": "over 2 hours",
    "prepTime": "overnight",
    "serves": "Makes 1 sandwich",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "An intricate recipe of crisp pork skin filled with Marmite glazed cabbage leaves, lemon verbena and apple slices. Equipment and preparation: for this recipe you will need a steam oven, two pairs of sharp tweezers and a vacuum-pack bag.",
    "author": {
        "ren_redzepi": "René Redzepi"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pork skins": [
            "2 pieces pork skin (each approximately 3x7cm/1¼x2¾in)",
            "1 tbsp brown butter",
            "oil, for frying",
            "salt",
            "1 lemon, zest only"
        ],
        "For the Marmite glaze": [
            "50g/1¾oz Marmite",
            "50g/1¾oz butter",
            "lemon juice"
        ],
        "For the white cabbage": [
            "7 large white cabbage leaves",
            "Marmite glaze (from above)",
            "oil, for basting"
        ],
        "For the seasoning": [
            "6 slices of a tart apple, such as Granny Smith",
            "1 lemon, juice only",
            "8 lemon verbena leaves (each about 5cm/2in long)"
        ],
        "To serve": [
            "sour pickles"
        ]
    },
    "steps": [
        "For the pork skins, remove all the fat from the skins and place in a vacuum-pack bag with the brown butter and seal the bag. Cook in a steam oven at 80C/175F steam for 10 hours.",
        "After 10 hours, reduce the oven temperature to 65C/150F and the moisture to 10%. Alternatively heat your oven to the lowest possible temperature and place a roasting tin half filled with boiling water on the bottom shelf.",
        "Line a baking tray with baking parchment, remove the pork skin from the vacuum-pack bag and spread it on the lined baking tray. Cook for another 8-10 hours, or until completely dry. Store in an airtight container if not using immediately.",
        "Heat the oil to 190-200C/375-400F in a large heavy-based pan (CAUTION: hot oil can be dangerous. Do not leave unattended.). Add the dried pork skins for approximately 15 seconds until they puff up. While cooking, use two pairs of tweezers to prevent the pork skins from curling (CAUTION: wear oven gloves and take great care not burn yourself while using the tweezers. Alternatively use cooking tongs). Place on kitchen towels to allow any excess oil to drain off. Season the pork skins with salt and lemon zest.",
        "For the Marmite glaze, add the butter, Marmite and 25g/1oz water to a large pan. Pulse with an immersion blender until lightly emulsified and season with a little lemon juice, to taste.",
        "For the white cabbage, brush the cabbage leaves lightly with oil and grill on a very hot barbecue until caramelized on both sides (alternatively place under a hot grill). Cut them to the approximate shape and size of the pork skins and warm through in the Marmite glaze.",
        "To serve, place a piece of cabbage on one of the puffed pork skins, followed by three apple slices, a little lemon juice, four lemon verbena leaves and a little salt.",
        "Layer the next five cabbage leaves, then the remaining apple slices, lemon verbena and a touch of lemon juice. Top with the last cabbage leaf and the second piece of puffed pork skin. Serve with a small bowl of sour pickles."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}