{
    "title": "Pork and prawn dumplings",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 8-10",
    "recommendations": "11",
    "images": [
        
    ],
    "description": "These homemade dim sum are easier to make than you think - and so delicious that you'll want to make them every Sunday.",
    "author": {
        "ching-he_huang": "Ching-He Huang"
    },
    "show": {
        "b00cjxzp": "Chinese Food Made Easy"
    },
    "tips": [
        "Ensure you pinch the wrapper around the filling firmly. To help, you can brush the wonton wrapper with water to prevent the wrappers from opening up and separating from the filling once cooked."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the filling": [
            "125g/4oz minced pork",
            "125g/4oz raw tiger prawns, shelled, de-veined and roughly chopped",
            "1 large spring onion, finely chopped",
            "1 tbsp grated fresh root ginger",
            "1 tbsp light soy sauce",
            "1 tbsp Shaoxing rice wine or dry sherry",
            "1 tsp toasted sesame oil",
            "2 tsp cornflour",
            "sea salt and freshly ground black pepper",
            "8-10 goji berries (optional)"
        ],
        "For the dumplings": [
            "10 ready-made wonton wrappers (available from Asian grocers)",
            "groundnut oil, for greasing"
        ],
        "To serve": [
            "1 tbsp chilli sauce",
            "2 tbsp light soy sauce"
        ]
    },
    "steps": [
        "For the filling, mix all of the filling ingredients together in a bowl.",
        "For the dumplings, place two teaspoons of the filling mixture into the centre of one of the wanton wrappers. Gather up the sides of the wonton wrapper and mould around the filling into a ball shape, leaving the filling in the centre exposed. Repeat with the remaining wrappers, until the filling is used up. Top each with a goji berry, if using.",
        "Oil the bottom of a bamboo steamer and line with greaseproof paper. Place the dumplings in the steamer, cover with a lid and place over a pan of boiling water (making sure the water does not touch the base of the steamer). Steam the dumplings for 6-8 minutes, or until cooked through.",
        "Combine the chilli and soy sauce in a bowl and serve with the dumplings."
    ],
    "howTos": [
        
    ],
    "videos": "[p019r406:p019r40b]"
}