{
    "title": "Portuguese custard tarts",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 12",
    "recommendations": "27",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/portuguesecustardtar_91040_16x9.jpg"
    ],
    "description": "These little beauties are easier and quicker than a trip to the bakery. They're almost too easy.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "butter, for greasing",
            "3 free-range egg yolks",
            "125g/4½ oz caster sugar",
            "30g/1oz cornflour",
            "1 vanilla pod, split, seeds scraped out",
            "175ml/6fl oz full-fat milk",
            "225ml/8fl oz double cream",
            "300g/10½ oz ready-rolled puff pastry",
            "plain flour, for dusting",
            "icing sugar, for dusting"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Grease the wells of a 12-hole muffin tray with butter.",
        "In a pan, heat the egg yolks, sugar and cornflour over a low to medium heat, whisking continuously until thickened and well combined.",
        "Add the vanilla seeds, then add the milk and cream in a thin stream, whisking continuously, until the mixture is thick, smooth and well combined.",
        "Continue to stir the custard mixture until it comes to the boil, then remove from the heat and cover the surface with cling film. (This prevents a skin from forming on the custard.)",
        "Roll out the puff pastry onto a clean work surface lightly dusted with flour and icing sugar. Cut the pastry in half and place one sheet on top of the other. Roll the pastry sheets up like a Swiss roll and cut the roll into twelve slices.",
        "Lay each of the rolled pastry slices flat onto the work surface and roll out into 10cm/4in discs using a rolling pin.",
        "Press a pastry disc into each of the wells of the prepared muffin tray. Divide the cooled custard equally among the pastry cases.",
        "Transfer the muffin tray to the oven and bake the tarts for 18-20 minutes, or until the custard has set and is pale golden-brown and the pastry is crisp and golden-brown. Allow to cool in the tin."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}