{
    "author": {
        "glynn_purnell": "Glynn Purnell"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A delicious mixture of minced pork, spices, apricot and nuts is baked in pastry and served with braised cabbage with apple and tamarind sauce. A meal in itself, or it can be served alongside the turkey as part of the Christmas dinner!",
    "dishes": [
        "bread",
        "chutney",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "salad",
        "sauce",
        "sausage",
        "sausage_roll"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the sausage roll": [
            "1 medium onion, chopped",
            "2 garlic cloves, chopped",
            "6 slices smoked streaky bacon, diced",
            "75ml/2½fl oz Calvados",
            "600g/1lb 5oz minced pork",
            "200g/7oz sausage meat",
            "4 sage leaves, chopped",
            "2 tbsp chopped parsley",
            "pinch ground ginger",
            "pinch nutmeg",
            "50g/1¾oz of toasted pistachios, chopped",
            "20 dried apricots, diced",
            "salt and freshly ground black pepper",
            "2 large free-range eggs, beaten",
            "50g/1¾oz of bread crumbs",
            "1 sheet all-butter puff pastry rolled to a 1cm/½in thickness, 50cm/20in length and 25cm/10in width"
        ],
        "For the winter cabbage salad": [
            "butter, for frying",
            "1 medium onion, chopped",
            "2 large pears apple, peeled and diced",
            "1 medium Savoy cabbage",
            "½ large pomegranate, seeds only",
            "squeeze of lime juice",
            "salt and freshly ground black pepper",
            "pear sliced on a mandoline, to garnish",
            "chutney, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "30",
    "serves": "Serves 6-8",
    "show": {
        "b03mzc66": "Food & Drink"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "In a frying pan, gently fry the onion, garlic and bacon. Add the Calvados to flambé the pan - take care to avoid the flames. Scrape any cooked-on food from the bottom of the pan. Place the mixture into a bowl and leave to cool.",
        "Place the minced pork and sausage meat into a large bowl. Add the sage, parsley, ginger, nutmeg, pistachios and apricots, and season with salt and pepper. Add the onion mixture to the bowl along with two of the eggs and the breadcrumbs. Mix together to create your filling.",
        "Dust a surface with flour and lay out the rolled pastry. Place the filling onto the pastry and make a sausage shape off-centre. Brush the edges of the pastry with the remaining egg. Fold the pastry over to create the sausage roll. Seal around the edges and brush with the egg. Using a sharp knife, slash the top of the sausage roll to create lines in the pastry. Finish with a grind of black pepper.",
        "Place in the oven and cook for 10 minutes at 200C/400F/Gas 6, then turn the oven down to 170C/340F/Gas 3½ and cook for a further 10-15 minutes.",
        "For the winter cabbage salad, in a frying pan, melt a knob of butter and gently fry the onion until soft. Add the pear and cook until soft.",
        "Blanch the Savoy leaves in a large pan of boiling water for two minutes. Remove the leaves and refresh in iced water. When the leaves are cool, remove the stems and shred.",
        "Add the cabbage to the onion and pear and fry gently until soft. Add the pomegranate seeds and juice and squeeze of lime juice. Season with salt and pepper to taste. Remove from the heat.",
        "To serve, place a spoonful of the winter cabbage salad onto the plate. Carve the hot sausage roll and place a piece next the cabbage. Garnish with slices of pear and serve with chutney."
    ],
    "tips": [
        
    ],
    "title": "Posh sausage roll",
    "videos": "[p01nkfy4:p01nkfy7]"
}