{
    "title": "Posh mushrooms with garlic and parsley on toast",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Mushrooms on toast is a great favourite of mine. If wild garlic is out of season you can use sorrel or spinach instead.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        
    },
    "tips": [
        "The parmesan has a wonderful dairy acidity that cuts through the richness of this dish, but vegetarians can use similar vegetarian hard cheeses."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "4 slices sourdough bread",
            "75g/2½oz butter",
            "rapeseed oil, for cooking",
            "1 banana shallot, chopped",
            "4 garlic cloves, grated",
            "400g/14oz seasonal mushrooms (such as St George’s, wild or button mushrooms), larger mushrooms halved",
            "100ml/3½fl oz double cream",
            "truffle oil, to taste (optional)",
            "½ bunch chives, chopped (or one spring onion, finely chopped)",
            "3 tbsp chopped parsley",
            "100g/3½oz wild garlic leaves",
            "salt and pepper",
            "lemon juice, to taste",
            "100g/3½oz parmesan (or a similar vegetarian hard cheese), grated"
        ]
    },
    "steps": [
        "I like to cook my sourdough on a griddle for that ‘burnt’ bar marked flavour, but you can just grill it if you don’t have a griddle.",
        "In a large frying pan, heat the butter and a little rapeseed oil. Add the shallot and grated garlic and gently fry until soft. Add the mushrooms.",
        "Fry over a high heat until just cooked. Add the double cream and a splash of truffle oil and cook until the volume of liquid has reduced and the mushrooms are glazed and creamy.",
        "Stir in the chives, parsley and wild garlic. Season, to taste, with salt and pepper. Add lemon juice, to taste.",
        "Serve the mushrooms on the toast with the grated parmesan on top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}