{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "over 2 hours",
    "cusine": "East_European",
    "description": "I guess you could call this the national dish of Croatia. The key is the balance of sweet from the fruit, in this case prunes, and the red wine and balsamic vinegar.",
    "dishes": [
        "beef_stew",
        "casserole",
        "gnocchi",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stew"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1.5–2kg/3lb 5oz-4lb 8oz silverside beef joint",
            "4 garlic cloves, sliced lengthways",
            "50g/1¾oz smoked bacon lardons",
            "4 tbsp balsamic vinegar",
            "125ml/4fl oz olive oil",
            "3 medium onions, quartered",
            "3 sticks celery, sliced",
            "3 carrots, sliced",
            "750ml/1¼ pint red wine",
            "2 apples, peeled, cut into eighths",
            "8 prunes",
            "3 tomatoes, chopped",
            "1 tsp sugar",
            "1 thyme sprig",
            "2 bay leaves",
            "1 small sprig rosemary",
            "gnocchi, cooked",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "",
    "serves": "Serves 6-8",
    "show": {
        "b0667qf6": "Rick Stein: From Venice to Istanbul"
    },
    "steps": [
        "Pierce the meat with the point of a sharp knife and insert the garlic slivers and bacon lardons into the slits. Put the beef in a dish, pour the vinegar all over it, cover and leave for an hour or two in the fridge.",
        "Preheat the oven to 160C/140C Fan/Gas 3.",
        "When ready to cook, season the beef with salt and pepper. Heat a couple of tablespoons of the olive oil in a flameproof lidded casserole pan over a high heat, add the beef and brown it all over.",
        "Add the remaining olive oil, the onions, celery, carrots and red wine. Bring to the boil. Cover and transfer to the oven and cook for about an hour.",
        "Remove from the oven and add the apples, prunes, tomatoes, sugar and herbs, and a little water if it is looking at all dry. Return to the oven to cook for a further hour with the lid on, or until the meat and vegetables are tender.",
        "Remove the meat, vegetables and fruit from the sauce and keep warm. Heat the sauce to reduce in volume to thicken it, if necessary. Taste and check the seasoning.",
        "Carve the meat into 1cm/½in thick slices and serve with the sauce and gnocchi."
    ],
    "tips": [
        
    ],
    "title": "Pot-roasted beef with red wine, prunes and bacon (pašticada)",
    "videos": "[]"
}