{
    "title": "Potato pancakes with smoked trout, horseradish cream and pickled beetroot",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2 (or 4 as a starter)",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Potato blinis topped with char-grilled trout, homemade horseradish cream and pickled beetroot.",
    "author": {
        "john_torode": "John Torode"
    },
    "show": {
        "b006t1k5": "MasterChef"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the horseradish cream": [
            "25g/1oz fresh horseradish, grated",
            "2 tsp white wine vinegar",
            "pinch salt",
            "100ml/3½fl oz crème fraîche"
        ],
        "For the pickled beetroot": [
            "3 tbsp olive oil",
            "2 tsp maple syrup",
            "2 tsp malt vinegar",
            "4 tsp lemon juice",
            "small piece fresh root ginger, grated",
            "pinch allspice",
            "2 beetroot, cooked and peeled",
            "beetroot leaves, shredded"
        ],
        "For the potato pancakes": [
            "500g/1lb 2oz potatoes, peeled",
            "50ml/2fl oz milk",
            "60g/2¼oz potato flour",
            "3 free-range eggs",
            "3 free-range egg whites",
            "½ tbsp double cream",
            "salt and freshly ground black pepper",
            "butter, for frying"
        ],
        "For the trout": [
            "1 whole smoked trout",
            "1 lemon, juice only",
            "handful fresh dill",
            "few drops olive oil"
        ]
    },
    "steps": [
        "For the horseradish cream, add the horseradish to a bowl and sprinkle with the vinegar and salt. Leave to sit for 10 minutes and then mix with the crème fraîche. Set aside until ready to serve.",
        "For the pickled beetroot, in a food processor combine the olive oil, maple syrup, vinegar, lemon juice, ginger and allspice. Pulse until completely amalgamated.",
        "Chop the cooked beetroot into 1cm/½in cubes and mix with the dressing and beetroot leaves. Set aside until ready to serve.",
        "For the potato pancakes, fill a pan with boiling salted water. Add the potatoes and cook until soft.",
        "Meanwhile for the trout, heat a griddle pan until hot. Char-grill the whole trout on both sides until cooked through.",
        "Remove from the heat. When cool enough to handle, peel away the skin and remove the bones. Pull the flesh into shards and mix with the lemon juice, dill and olive oil. Set aside until ready to serve.",
        "For the potato pancakes, drain the cooked potatoes and return to the pan. Add the milk and mash until smooth.",
        "Stir in the potato flour and gradually add the eggs, followed by the egg whites. Beat in the cream and season to taste with salt and freshly ground black pepper.",
        "Warm a frying pan over a medium heat and grease with a little butter. Pour a ladle of the potato mixture into the pan and cook for five minutes until well coloured around the edges. Turn over and cook for a further three minutes, or until cooked through and golden-brown. Repeat with the remaining potato mix.",
        "To serve, place a potato pancake on each plate. Top with a spoonful of horseradish cream and the flaked trout. Spoon the dressed beetroot around the edge."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}