{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "These delectable röstis are a fantastic brunch option - or serve them as a side dish with pulled pork. For this recipe you will need 4 x 7.5cm/3in chefs’ rings.",
    "dishes": [
        "jam",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "4 medium potatoes, peeled",
            "2 tart green apples, such as Granny Smith, peeled, cored",
            "75g/2½oz crème fraîche",
            "4 free-range eggs, plus 4 free-range egg yolks",
            "2 tbsp vegetable oil",
            "50g/1¾oz butter",
            "12 thick slices smoked back bacon",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b06s5h9c": "Home Comforts at Christmas"
    },
    "steps": [
        "Preheat the grill to its highest setting.",
        "Grate the potatoes onto a clean tea towel. Grate the apples on top. Wrap them in the tea towel and wring out any excess water.",
        "Tip the potato and apple mixture into a large bowl and stir in the crème fraîche and egg yolks until well combined. Season, to taste, with salt and freshly ground black pepper.",
        "Heat 1 tablespoon of oil and a knob of butter in a large frying pan over a medium heat. Place four 7.5cm/3in metal chefs’ rings into the pan.",
        "Spoon the rösti mixture inside the rings and press down well with the back of the spoon, then fry for 2-3 minutes, or until golden-brown, pressing down occasionally.",
        "Remove the chefs’ rings, then flip the röstis over and fry on the other side until golden-brown and cooked through, about 4-5 minutes. Remove from the pan and keep warm.",
        "Meanwhile, grill the bacon on a baking tray for 3-4 minutes, or until crisp, golden-brown and cooked through.",
        "Add the remaining oil and butter to the frying pan used to cook the röstis. Return the chefs’ rings to the pan. Crack one egg into each ring and fry for 1 minute, then carefully remove the rings. Baste the eggs with the buttery oil in the pan and fry for a further 1-2 minutes, or until cooked to your liking.",
        "To serve, place one rösti onto each serving plate and top with the bacon rashers and one fried egg."
    ],
    "tips": [
        
    ],
    "title": "Potato and apple rösti",
    "videos": "[p03c0j9g:p03c0j9j]"
}