{
    "author": {
        "clarissa_hyman": "Clarissa Hyman"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "East_European",
    "description": "Latkes can be made with any variety of vegetable, but for most people, the potato will always be at the heart of things.",
    "dishes": [
        "pancake",
        "potato_rosti",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/potatolatkespotatopa_87525_16x9.jpg"
    ],
    "ingredients": {
        "To serve": [
            "soured cream",
            "apple sauce"
        ],
        "default": [
            "1kg/2lb 4oz old or baking potatoes, peeled, soaked in cold water until needed",
            "1 onion, peeled",
            "25g/1oz plain flour or fine matzoh meal",
            "1 free-range egg, beaten",
            "salt and freshly ground white pepper",
            "olive or vegetable oil, for frying"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "14",
    "serves": "Serves 4-5",
    "show": {
        
    },
    "steps": [
        "For the latkes, finely grate the potatoes and onion and mix together.",
        "Place the grated potato and onion into a colander and squeeze out as much moisture as you can. Or roll up the potato and onion in a clean kitchen tea towel and wring well to extract the liquid.",
        "Mix the potato and onion with the flour, egg and salt and freshly ground white pepper.",
        "Heat the oil in a frying pan until moderately hot and then place heaped tablespoons of the mixture into the pan to shallow-fry. Lower the heat to medium, flatten each latke with the back of a spoon and fry for about five minutes on each side, turning over when the edges turn golden-brown. If the heat is too high, the latkes will become dark-brown on the outside before they are cooked inside.",
        "Remove the latkes from the pan and drain on brown paper bags (they absorb the oil, leave the latkes crisper and the latkes won't stick to the paper).",
        "Serve the latkes hot with soured cream and apple sauce."
    ],
    "tips": [
        
    ],
    "title": "Potato latkes (Potato pancakes)",
    "videos": "[]"
}