{
    "author": {
        "darina_allen": "Darina Allen"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Irish",
    "description": "",
    "dishes": [
        "oven-baked_dishes",
        "sauce",
        "soup",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "4 red peppers",
            "55g/2oz butter",
            "425g/15oz potatoes, peeled and chopped into 5mm/1/4in cubes",
            "110g/4oz onions, finely chopped",
            "1 tsp salt",
            "freshly ground pepper",
            "900ml/1½pt home-made chicken stock or vegetable stock",
            "120ml/4fl oz creamy milk",
            "sprigs of flatleaf parsley",
            "roasted chillies (optional)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Roast or chargrill the peppers for 10-15 minutes in the oven and then leave to cool in a plastic bag.",
        "Peel and deseed, save the sweet juices and carefully purée the flesh with the juices. Taste and adjust seasoning if necessary.",
        "Melt the butter in a heavy saucepan. When it foams, add the potatoes and onions and toss them in the butter until well coated.",
        "Sprinkle with salt and a few grinds of pepper. Cover with a butter wrapper or paper lid and the lid of the saucepan. Sweat on a gentle heat for approximately 10 minutes.",
        "Meanwhile, bring the stock to the boil. When the vegetables are soft but not coloured add the boiling stock and continue to cook for about 10-15 minutes or until the vegetables are soft.",
        "Add the milk. purée the soup in a blender or food processor. Taste and adjust seasoning.",
        "Just before serving, swirl the red pepper purée through the soup or simply drizzle on top of each bowl. Top with some snipped flat parsley. You might try adding one or two roast chillies to the pepper for a little extra buzz - serrano or jalapeno are good."
    ],
    "tips": [
        
    ],
    "title": "Potato and roast red pepper soup",
    "videos": "[]"
}