{
    "title": "Potato and pepper bake",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8-10",
    "recommendations": "",
    "images": [
        
    ],
    "description": "I never feel the need to apologize for using jars of chargrilled peppers, for while I don’t eat them just as they are, I find them the most useful ingredient. Just make sure that you are using peppers that are preserved in oil rather than brine. The potatoes don’t roast in this oil, so much as braise: they will crisp up in parts, but mostly just become softened and rich in the sweet peppery juices.",
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "tips": [
        "To make ahead: peel and slice the potatoes, submerge in a bowl of cold water, then cover and refrigerate for up to 1 day. Drain and pat dry before using. Cool leftovers, then cover and refrigerate as quickly as possible. They will keep in fridge for up to 5 days. Reheat on a baking tray in a 200C/180C Fan/Gas 6 oven for about 20 minutes (timing will depend on quantity)."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "2kg/4lb 8oz waxy maincrop potatoes, such as Cyprus",
            "2 x 290g jars chargrilled peppers in oil",
            "2 tbsp coriander seeds"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/200C Fan/Gas 7.",
        "Peel the potatoes, cut them into 2.5cm/1in slices, then quarter each slice (halving the smaller end slices) and toss them into a large shallow roasting tin.",
        "Tip the jars of peppers – they are normally in quite small strips, snip them with scissors if they’re not – oil and all over the potatoes. Add the coriander seeds and toss to combine before baking in the oven for 1 hour, by which time the potatoes will be soft on the inside and their outside golden, but not crisp, except at the corners.",
        "Using a slotted spatula or slotted spoon (let the excess oil drip back into the pan), transfer the potatoes to a large warmed bowl and either serve immediately, or let them stand for 15 minutes, or up to 45 minutes, as they are also excellent warm rather than hot."
    ],
    "howTos": [
        
    ],
    "videos": "[p03c2638:p03c263k]"
}