{
    "title": "Potato rosti with black pudding and apple",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the rösti": [
            "600g/1lb 5oz potatoes, peeled and grated",
            "75g/3oz crème fraîche",
            "1 free-range egg yolk",
            "salt and freshly ground black pepper",
            "75g/3oz butter, melted"
        ],
        "For the black pudding": [
            "1 tbsp olive oil",
            "1 small black pudding, sliced"
        ],
        "For the apples": [
            "25g/1oz butter",
            "2 small Cox apples, peeled and cut into wedges",
            "50ml/2fl oz cider"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the rösti, place the grated potatoes into a clean tea towel inside a bowl and squeeze out any excess water into the bowl.",
        "Transfer the grated potato into a clean bowl along with the crème fraîche and egg yolk, stir to mix and season well with salt and freshly ground black pepper.",
        "Heat the butter in an ovenproof frying pan over a medium heat and place 2 x 7.5cm/3in chefs' rings into the pan.",
        "Spoon the potato mixture into the rings, press down well with a spoon and cook for 3-4 minutes, or until golden brown. Turn the ring over, press the mixture down and cook for 3-4 minutes on the other side.",
        "Transfer the pan to the oven and bake the rösti for 5-10 minutes, or until tender and cooked through.",
        "Meanwhile, for the black pudding, heat the oil in a small frying pan until hot, place the black pudding into the pan and cook until golden-brown and cooked through.",
        "For the apples, heat the butter in another pan, add the apple segments, stirring to coat in the butter, and cook until golden-brown. Add the cider to the pan and simmer until no liquid remains.",
        "To serve, place the rösti onto a serving plate and top with the black pudding and apples."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}