{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "East_European",
    "description": "Pronounced Pov-e-Tee-za, this Eastern European sweet bread is traditionally served at Christmas, but makes a delicious tea time treat at any time of the year. Equipment and preparation: for this recipe you will need a clean, flat single bed sheet and a 1kg/2lb loaf tin.",
    "dishes": [
        "bread",
        "icing",
        "oven-baked_dishes",
        "pie",
        "slow-cooked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/povitica_92623_16x9.jpg"
    ],
    "ingredients": {
        "For the dough": [
            "300g/10½oz plain flour, plus extra for dusting",
            "40g/1½oz caster sugar",
            "7g salt",
            "10g/⅓oz fast-action yeast",
            "30g/1oz unsalted butter, melted",
            "1 large free-range egg, beaten",
            "½ vanilla pod, split and seeds scraped out",
            "150ml/5½fl oz whole milk, warmed"
        ],
        "For the filling": [
            "60g/2¼oz unsalted butter",
            "4 tbsp whole milk",
            "280g/10oz walnut pieces",
            "½ vanilla pod, split and seeds scraped out",
            "100g/3½oz caster sugar",
            "2 tbsp cocoa powder",
            "1 free-range egg yolk, beaten"
        ],
        "To assemble": [
            "15g/½oz butter, melted",
            "1 free-range egg white, beaten",
            "100g/3½oz icing sugar"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "5",
    "serves": "Makes 1 loaf",
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "steps": [
        "For the dough, tip the flour and sugar into the bowl of a freestanding mixer fitted with a dough hook. Add the salt into one side of the bowl and the yeast to the other. Add the melted butter, egg, vanilla seeds and warm milk and begin mixing on a slow speed. When the dough starts to come together, mix for a further 5-8 minutes on a medium speed until the dough is soft, smooth and stretchy.",
        "Tip the dough into a lightly oiled mixing bowl, cover with cling film and leave to rise until at least doubled in size – about one hour. Butter a 1kg/2lb loaf tin.",
        "For the filling, place the butter and milk in a small pan and heat gently until the butter has melted. Remove from the heat.",
        "Place the walnuts, vanilla seeds, sugar and cocoa powder into the bowl of a food processor and blend to a sandy powder. Add the egg yolk, milk and butter mixture and pulse to combine. Set aside.",
        "To assemble, spread a clean bed sheet over a kitchen table and dust with flour. Turn the risen dough out onto the sheet and roll out the dough into a large 50x30cm/20x12in rectangle. Brush the surface with 15g/½oz melted butter.",
        "Dust your hands with flour and ease them underneath the dough. Using the backs of your hands, stretch the dough out from the centre until very thin and translucent (you should be able to see the sheet through the dough). The rectangle should measure approximately 1metrex60cm/40x24in.",
        "Taking care not to tear the dough, spread the filling over the dough until evenly covered. If the filling has been standing for a long time and is too thick, add a little warm milk to loosen it.",
        "Starting at the long edge of the dough, lift the sheet and gently roll the dough up tightly, like a Swiss roll.",
        "Carefully lift the dough and place one end in the bottom corner of the greased loaf tin. Ease the roll into the base of the tin to form a long ‘U’ shape, then double back laying the roll over the first ‘U’ shape to form a second ‘U’ shape on top.",
        "Place the loaf tin inside a clean plastic bag and leave to rise for one hour.",
        "Preheat the oven to 180C/160C(fan)/ 350F/Gas 4.",
        "Brush the dough with beaten egg white and bake for 15 minutes. Reduce the oven temperature to 150C/130C(fan)/300F/Gas 3 and bake for a further 45 minutes, or until golden-brown. Cover with foil if the top begins to darken too much.",
        "Remove from the oven and leave to cool in the tin for 30 minutes before turning out onto a wire rack to cool completely.",
        "Mix the icing sugar with a few drops of cold water to make a runny icing and drizzle it over the povitica. Slice and enjoy."
    ],
    "tips": [
        "Using a bed sheet makes it easier to roll the very thin dough. Clean the sheet well before use or use a large piece of cotton."
    ],
    "title": "Povitica",
    "videos": "[]"
}