{
    "title": "Prawn and crayfish cocktail",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the prawn and crayfish cocktail": [
            "350g/12oz raw tiger prawns",
            "350g/12oz raw crayfish",
            "2 Little Gems lettuces, leaves separated",
            "½ tsp cayenne pepper"
        ],
        "For the cocktail sauce": [
            "2 free-range egg yolks",
            "2 tsp white wine vinegar",
            "1 tsp Dijon mustard",
            "300ml/10fl oz rapeseed oil",
            "2 tbsp tomato ketchup",
            "1 tbsp Worcestershire sauce",
            "2 dashes Tabasco sauce",
            "1 tbsp brandy",
            "½ lemon, juice only",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "For the prawn and crayfish cocktail, place the prawns and crayfish into a steamer and place over a pan of boiling water.",
        "Cover and steam over a gentle simmer until the prawns and crayfish turn pink - this should take about 4-5 minutes. Remove and cool before peeling the shellfish, discarding the shells.",
        "For the cocktail sauce, place the eggs yolks, white wine vinegar and mustard into a food processor and blend until pale and creamy.",
        "With the motor running, pour the oil in gradually, in a steady stream, until you have a thick mayonnaise - you may not need to use all the oil.",
        "Place the mayonnaise into a mixing bowl. Add the tomato ketchup, Worcestershire sauce, Tabasco sauce, brandy and lemon juice and mix to combine. Season with salt and freshly ground black pepper, to taste.",
        "Add the prawns and crayfish to the cocktail sauce and stir to combine.",
        "To serve, arrange the Little Gem leaves in the base of each of four serving glasses.",
        "Spoon the prawn and crayfish cocktail into each glass on top of the lettuce leaves. Sprinkle over the cayenne pepper and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}