{
    "author": {
        "phil_vickery": "Phil Vickery"
    },
    "cookTime": "10 to 30 mins",
    "description": "Prawn and chorizo are two of the best ingredients around, pair them with pasta and you're on to a winner.",
    "dishes": [
        "casserole",
        "linguine",
        "pasta",
        "pie",
        "sauce",
        "stew",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/prawnandchorizolingu_93455_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "3 raw tiger prawns",
            "100g/3½oz linguine",
            "1 tbsp olive oil, plus extra for drizzling",
            "1 garlic clove",
            "1 x 2.5cm/1in piece chorizo, cut into small cubes",
            "1 tomato, chopped",
            "½ tbsp red wine vinegar",
            "½ lime, juice only",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "15",
    "serves": "Serves 1",
    "show": {
        
    },
    "steps": [
        "Cook the pasta according to packet instructions, or until the pasta is al dente. Drain the pasta and set aside.",
        "Meanwhile, heat the olive oil in a frying pan and fry the garlic for 1 minute, or until softened. Add the chorizo and prawns and fry for 2-3 minutes, or until golden-brown all over. Stir in the chopped tomato and red wine vinegar and cook for 2-3 minutes, or until the mixture has thickened and the prawns are cooked through (they should be pink and opaque).",
        "Remove the pan from the heat and add the pasta, mixing well to coat in the sauce. Add a squeeze of lime juice and season, to taste, with salt and pepper. Put the pasta on a plate, drizzle over some olive oil and serve."
    ],
    "tips": [
        "Red wine vinegar is handy to have in your store cupboard as it can be used in sauces, stews and casseroles. You can pick up a bottle for as little as 60p."
    ],
    "title": "Prawn and chorizo linguine with lime",
    "videos": "[]"
}