{
    "title": "Prawn laksa rice noodle soup",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "8",
    "images": [
        
    ],
    "description": "A fabulous, warming Malaysian-Chinese fusion of spicy prawns in noodle broth. Serves two people for a main course or four as a starter to share.",
    "author": {
        "ching-he_huang": "Ching-He Huang"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the laksa paste": [
            "1 tsp ground coriander",
            "1 tsp ground cumin",
            "1 tsp turmeric",
            "2 small onions (about 190g/7oz), peeled and chopped",
            "50ml/2fl oz coconut milk",
            "2.5cm/1in piece of fresh root ginger, peeled and roughly chopped",
            "2 garlic cloves, crushed and roughly chopped",
            "2 stalks lemongrass (about 25g/1oz), roughly chopped",
            "2 Fresno chillies, seeds removed, roughly chopped",
            "1 tbsp fermented shrimp paste"
        ],
        "For the prawn noodle soup and crispy prawn garnish": [
            "400g/14oz uncooked de-veined prawns, with tails on",
            "4 tbsp vegetable oil",
            "350ml/12fl oz coconut milk",
            "500ml/18fl oz organic chicken stock",
            "2 dried kaffir lime leaves",
            "1 tbsp brown sugar",
            "3-4 tbsp fish sauce",
            "2 pinches cracked sea salt",
            "2 pinches of freshly ground black pepper",
            "2 tbsp potato starch",
            "100g/3½oz dried vermicelli rice noodles",
            "1 large lime, juice only",
            "chilli seasoning (powder or flakes), to taste (optional)",
            "80g/3oz beansprouts",
            "1 large spring onion, sliced on a deep angle to 1cm/½in pieces",
            "salt, to taste",
            "large handful of coriander leaves, to garnish",
            "1 large lime, sliced into wedges, to garnish"
        ]
    },
    "steps": [
        "Put the ingredients for the laksa paste into a blender or food processor and process to a fine smooth paste.",
        "For the crispy prawn garnish put two tablespoons of the laksa paste into a bowl and add four of the whole prawns. Cover and set aside in the fridge to marinate while you make the soup.",
        "For the soup, heat two tablespoons of vegetable oil in a large wok and cook the remaining laksa paste for a one minute until it deepens in colour.",
        "Stir in the coconut milk, stock, dried kaffir lime leaves, sugar and fish sauce and 300ml/10½fl oz water.",
        "Bring the soup to the boil and simmer for 20 minutes until the flavour deepens.",
        "While the soup is cooking and a few minutes before the soup is ready, prepare the crispy prawn garnish. Take the four marinated prawns out of the curry marinade, season with sea salt and black pepper and sprinkle over the potato starch.",
        "Heat a small pan, add two tablespoons of vegetable oil and cook the prawns for one and half minutes on each side until golden-brown, crisp and cooked through. Take off the heat but leave them in the pan to keep warm.",
        "To finish the soup, add the vermicelli rice noodles and stir while cooking for two minutes. Then add the remaining prawns and cook for two minutes. Season the soup with lime juice, (or salt and dried chilli flakes if preferred), add the beansprouts and spring onion. Remove the kaffir lime leaves, give it a final stir and then it is ready to serve.",
        "Divide the noodles evenly among the bowls and ladle over the soup. Garnish with the fried prawns, coriander leaves, and extra lime wedges."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}