{
    "author": {
        "jos_pizarro": "José Pizarro"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Spanish",
    "description": "For maximum flavour marinate the prawns overnight, but if you don't have time an hour will be sufficient.",
    "dishes": [
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the prawn fritters": [
            "400g/14oz peeled prawns, chopped",
            "2 limes, juice only",
            "1 small red onion, finely sliced",
            "1 small green chilli, finely sliced",
            "1 small shallot, finely chopped",
            "5g coriander, chopped",
            "1 spring onion, sliced",
            "1 tbsp cornflour",
            "1 free-range egg",
            "oil, for frying",
            "salt and freshly ground black pepper"
        ],
        "For the saffron aioli": [
            "2 large free-range egg yolks (at room temperature)",
            "1 small garlic clove, finely chopped or crushed to a paste",
            "1 tsp lemon juice",
            "¼ tsp fine sea salt",
            "150ml/5fl oz extra virgin olive oil",
            "10 threads saffron"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "1",
    "serves": "Serves 2",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the prawn fritters, mix the prawns with the lime juice, onion, chillies, shallot, coriander and spring onion. Leave in the fridge overnight.",
        "Just before you’re ready to cook the prawns, add the cornflour and egg to the mixture. Season with salt and pepper.",
        "For the saffron aioli, put the egg yolks in a mixing bowl with the garlic, lemon juice and salt. Whisk together. Very gradually whisk in the olive oil until you have a glistening sauce with the consistency of soft butter. Stir in the saffron, cover and chill until needed.",
        "Preheat a deep-fat fryer to 180C. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
        "Drop tablespoons of the prawn mixture into the hot oil. You will need to cook them in 4 batches - do not crowd the fryer. Fry them for 2 minutes, or until golden-brown. Drain the cooked fritters on kitchen paper and leave to rest until you have fried the remaining mixture.",
        "To serve, place the fritters in a large bowl and dip indulgently into the aioli."
    ],
    "tips": [
        "This recipe will make more aioli than you will need, but any leftovers can be kept in the fridge for up to 3 days."
    ],
    "title": "Prawn fritters with saffron aioli",
    "videos": "[]"
}