{
    "title": "Prawn dim sum",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "7",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/prawnporkandvegetabl_88714_16x9.jpg"
    ],
    "description": "James Martin’s dim sum of steamed prawn parcels are served with two types of spicy dip – a great starter for sharing.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        
    },
    "tips": [
        "Tip: The prawn mixture can be made in advance and chilled until needed. The dim sum need to be prepared at the last minute and served immediately."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the dips": [
            "3 tbsp soy sauce",
            "1 tbsp sesame oil",
            "2 red chillies, finely chopped",
            "3 tbsp rice vinegar",
            "1 tbsp sugar"
        ],
        "For the prawn dim sum": [
            "250g/9oz raw king prawns, peeled and de-veined",
            "50g/2oz bamboo shoots, finely sliced",
            "1 tbsp sesame oil",
            "1 tbsp dry sherry or rice wine",
            "¼ tsp ground white pepper",
            "1 tsp caster sugar",
            "1 tsp salt",
            "16 ready-made dim sum wrappers (available from Asian supermarkets)"
        ]
    },
    "steps": [
        "For the dips, place the soy sauce, sesame oil and one of the chopped red chillies into a clean bowl and whisk together.",
        "Meanwhile, place the rice vinegar, sugar and the remaining one chopped red chilli into a pan and heat until the sugar dissolves. Remove from the heat and allow to cool, then pour into a clean bowl.",
        "For the prawn dim sum, place the prawns into a small food processor and blend to a purée. Transfer to a bowl, add all the other ingredients, except the dim sum wrappers, and mix thoroughly.",
        "Place the wrappers onto a clean work surface and place a small spoonful of prawn mixture in the centre of each wrapper. Fold the wrappers over the prawn mixture to create a semi-circle. Press the edges of the wrapper together with damp fingers to seal the wrapper parcels and crimp the edges.",
        "Place the parcels into a bamboo steamer over a pan of simmering water and cover. Steam for 4-5 minutes, or until the prawn mixture is completely cooked through. Remove from the steamer and serve immediately.",
        "To serve, place the dim sum onto a serving plate with both bowls of dips alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}