{
    "title": "Preserved artichokes",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 2 small jars",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Artichokes are packed into a jar flavoured with your favourite herbs and plenty of garlic. Delicious with a selection of deli treats.",
    "author": {
        "alex_lomax_and_ed_bond": "Alex Lomax and Ed Bond"
    },
    "show": {
        "b04wlw4w": "The Big Allotment Challenge"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1kg/2lb 4oz artichokes",
            "2 lemons, cut into wedges",
            "350ml/12fl oz white wine vinegar",
            "500ml/18fl oz extra virgin olive oil, plus more if necessary",
            "1 head garlic, broken into cloves",
            "handful fresh mixed herbs",
            "5 bay leaves",
            "1 tbsp chopped oregano",
            "coarse sea salt",
            "1 tbsp black peppercorns"
        ]
    },
    "steps": [
        "Strip away the outer leaves of the artichokes and soak the tender hearts in a bowl of water and lemon wedges to stop them from browning.",
        "Drain the artichokes and leave them upside down.",
        "Prepare a pan of water and add the vinegar. Bring to the boil.",
        "Place the artichokes in the boiling mixture, cover and poach them gently in the mixture until cooked but not soft and still firm in the centre. The time for cooking varies - about 12-15 minutes.",
        "Drain them well and leave to cool.",
        "When cool, pack the artichokes carefully into sterilised jars, pressing them down gently and trying to prevent as many gaps as possible.",
        "Heat the oil with the garlic, herbs, bay leaves and oregano. Remove from the heat and cool. Add the salt and pepper. Remove the garlic.",
        "Pour the flavoured oil over the artichokes. Top with more oil if required after a few minutes.",
        "Seal the jars and eat within ten days."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}