{
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Italian",
    "description": "Once you've mastered Lorraine Pascale's basic pizza dough, vary the toppings according to your mood. Equipment and preparation: You will need a very large baking tray, or a 30cm/12in pizza plate.",
    "dishes": [
        "bread",
        "bun",
        "oven-baked_dishes",
        "pie",
        "pizza"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/prosciutto_mozzarella_98052_16x9.jpg"
    ],
    "ingredients": {
        "For the basic dough": [
            "250g/9oz strong white bread flour, plus extra for dusting",
            "1 tsp salt",
            "½ tsp fast-action dried yeast",
            "125–145ml/4½–5fl oz warm water",
            "2 tbsp extra virgin olive oil, plus extra for oiling and drizzling"
        ],
        "For the pizza topping": [
            "1 tube good-quality tomato purée",
            "250g/9oz mozzarella cheese, sliced",
            "8 slices prosciutto, ripped up into bite-sized pieces",
            "5 figs, quartered",
            "salt and freshly ground black pepper",
            "1 bunch fresh basil"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "32",
    "serves": "Serves 4",
    "show": {
        "b00xnbkv": "Baking Made Easy"
    },
    "steps": [
        "Mix the flour, salt and yeast together in a large bowl and make a well in the middle. In a jug, mix the water and oil together, then pour the liquid into the well of the flour mixture and mix to make a soft but not sticky dough.",
        "Knead for 10 minutes by hand on a lightly floured work surface or for five minutes in an electric mixer fitted with a dough hook. Bring the dough together to a smooth flat ball and place on a large, lightly floured baking tray.",
        "Cover the pizza dough loosely with oiled clingfilm, making sure it is airtight. Leave in a warm but not hot place for 30–40 minutes.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "Remove the clingfilm from the dough and roll out to a 30cm/12in circle to knock some air out, then prick holes all over the dough with a fork. Spread over the tomato purée, leaving a 2.5cm/1in border, followed by the mozzarella, prosciutto and half of the figs.",
        "Drizzle with oil and season with salt and freshly ground black pepper. Bake in the oven for 15–20 minutes, or until the bread is crisp and golden-brown and the cheese has melted. Scatter basil over the top and arrange the remaining figs on the pizza. Drizzle with oil.",
        "Serve at the centre of the table so everyone can rip off their piece of Italian gold."
    ],
    "tips": [
        "Make several bases in one go and then freeze them, so that next time pizza is on the menu, a base can be quickly defrosted and finished with toppings."
    ],
    "title": "Prosciutto, mozzarella and fig pizza",
    "videos": "[]"
}