{
    "title": "Pâté en waffle",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "overnight",
    "serves": "Serves 2-4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "You will need to make the pickled onions 4 days in advance and soak your raisins the night before, but once that's done everything else is quickly cooked. For this recipe you will need a waffle maker and a blender.",
    "author": {
        "paul_ainsworth": "Paul Ainsworth"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "Take care when cooking the chicken livers: there is a risk of food poisoning if they are under cooked, but they will be grainy if overcooked."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pickled red onions": [
            "2 small red onions, thinly sliced",
            "100g/3½oz caster sugar",
            "100g/3½oz white wine vinegar",
            "2 tbsp extra virgin olive oil",
            "pinch coriander seeds and fennel seeds",
            "25g/1oz chopped fresh coriander",
            "fine sea salt"
        ],
        "For the golden raisin purée": [
            "200g/7oz golden raisins, soaked overnight in cold water",
            "2 tbsp brown sauce"
        ],
        "For the waffles": [
            "200g/7oz unsalted butter, cubed",
            "250g/9oz plain flour, sifted",
            "1½ tsp baking powder",
            "¼ tsp fine sea salt",
            "3 free-range eggs",
            "425ml/15fl oz buttermilk"
        ],
        "For the chicken liver pâté": [
            "50g/1¾oz unsalted butter, cubed",
            "500g/1lb 2oz chicken livers, cut into large pieces",
            "2 medium shallots, finely chopped",
            "1 sprig thyme, leaves picked and lightly chopped",
            "1 sprig rosemary, leaves picked and finely chopped",
            "1 garlic clove, finely grated",
            "2 tbsp sherry vinegar",
            "125ml/4fl oz madeira",
            "125ml/4fl oz port",
            "fine salt, to season"
        ]
    },
    "steps": [
        "For the pickled red onions, put the onions in a sterilised large jar with an airtight lid.",
        "Place all the remaining ingredients, except the coriander and salt, in a pan with 300g/10fl oz water. Bring to the boil while whisking, then season with salt to taste. Pour over the onions and seal the jar, pickle for 4 days before serving.",
        "For the golden raisin purée, put the raisins in a saucepan, cover with cold water and bring to the boil. Reduce the heat to a gentle simmer for 1 hour. The raisins will be very soft and plump, be careful the bottom doesn’t catch during cooking. They are ready when almost all the liquid has evaporated. Drain and dry the raisins lightly, then blend until smooth. Pass through a sieve and stir in the brown sauce to taste.",
        "For the waffles, put the butter in a warm saucepan, turn up the heat to high and whisk until the butter is nut brown. Remove from the heat and set aside.",
        "In a mixing bowl, whisk together the flour, baking powder, salt, eggs and half the buttermilk to form a smooth batter. Add the remaining buttermilk and whisk again. Pour in 125g/4½oz of the beurre noisette and whisk until smooth, cover with a layer of cling film to stop a skin forming on top and set aside. Reserve any leftover beurre noisette.",
        "For the pâté, heat a wide, shallow pan until hot. Add the butter and stir until foaming. Season the chicken livers with salt, then add to the pan and quickly brown all over until just cooked (you may need to do this in batches). They should feel springy to the touch, not hard. To test, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine). Remove from the pan and set aside.",
        "Using the fat in the pan, quickly add the shallots, thyme, rosemary and garlic. Cook gently until the shallots are soft but without colour. Add in the sherry vinegar and reduce until sticky. Add the madeira and, again, reduce until sticky. Repeat with the port. Remove from the heat and leave to cool.",
        "Meanwhile, cut the cooked livers in to 1cm/½in cubes. Add them to the cooked shallots and gently fold together. Set aside.",
        "To serve, start by adding ladlefuls of the waffle mixture to your waffle maker and cook until crisp (you may need to turn the waffles during cooking for even colour).",
        "While they are cooking, preheat the oven to 160C/140C Fan/Gas 3. Drain some pickled onions and place in a bowl topped with the coriander. Put the golden raisin purée in a serving bowl.",
        "When the waffles are cooked, take them out and brush them with some of the leftover beurre noisette then spoon the pâté over the top making sure you have an even layer. Now place the waffles in an oven for 30 seconds to 1 minute. You just want to warm the pâté. Take the waffles out the oven and serve topped with the golden raisin purée and pickled onions."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}