{
    "author": {
        "hugh_fearnley-whittingstall": "Hugh Fearnley-Whittingstall"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "",
    "dishes": [
        "bread",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        "julienne"
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "4 slices pancetta, or streaky bacon",
            "2 cloves garlic, finely chopped",
            "4 large slices from a puffball, about 1cm/½in thick",
            "2 eggs, beaten and seasoned with salt and pepper",
            "100g/3½oz white breadcrumbs (from a day old loaf)",
            "4 whole eggs",
            "salt and freshly ground black pepper",
            "olive oil for frying",
            "a few salad leaves, lightly dressed"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Chop the bacon or pancetta into thick matchsticks and fry in a little olive oil until crispy. Throw in the chopped garlic and fry until it starts to take colour. Remove the garlicky pancetta and put on kitchen paper.",
        "Bring the four whole eggs to the boil in a small pan of cold water and boil them for just 4 minutes to get soft-boiled eggs.",
        "Dip the puffball slices in the beaten egg, then coat well in the breadcrumbs. Fry in the same oil left from frying the pancetta (with perhaps a little extra added), turning once until crispy and golden brown.",
        "Drain each slice quickly on kitchen paper, then place on warmed plates. Peel the soft boiled eggs carefully and cut them in half. Place two halves, yolk upwards, on each fritter and season well with salt and freshly ground black pepper. Sprinkle over the garlicky bits of pancetta.",
        "Serve with a few dressed salad leaves on the side."
    ],
    "tips": [
        
    ],
    "title": "Puffball fritters with soft-boiled eggs and bacon",
    "videos": "[]"
}