{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Make the most of any leftover pumpkin pulp with this hearty recipe.",
    "dishes": [
        "bread",
        "jam",
        "oven-baked_dishes",
        "sauce",
        "soup",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        "kneading"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the pumpkin seed bread": [
            "20g/¾oz fresh yeast",
            "500g/1lb 2oz strong flour",
            "15g/½oz salt",
            "25g/½oz caster sugar",
            "50ml/2fl oz olive oil, plus extra for greasing",
            "275ml/9fl oz warm water",
            "150g/5½oz pumpkin seeds"
        ],
        "For the soup": [
            "2 tbsp olive oil",
            "1 onion, finely diced",
            "1kg/2lb 4oz pumpkin, peeled and cut into 1cm/½in cubes",
            "2 garlic cloves, finely chopped",
            "500ml/18fl oz chicken stock",
            "1 lime, juice only",
            "200ml/7fl oz double cream",
            "salt and freshly ground black pepper",
            "4 tbsp extra virgin olive oil, to serve",
            "2 tbsp coriander cress"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the pumpkin seed bread, grease the insides of six small, very well cleaned clay flower pots. (Alternatively use a large loaf tin and bake the bread for longer.)",
        "In a bowl, or a food processor with a dough hook attached, mix together the yeast, flour, salt, sugar and oil until well combined.",
        "Gradually add the warm water, a tablespoon at a time, until the mixture comes together as a soft dough. (You may not need all of the water.)",
        "Add the pumpkin seeds and knead gently for 5-8 minutes, or until the seeds are combined and the dough is smooth and elastic.",
        "Place the dough into the prepared flower pots, cover with a clean tea towel and set aside in a warm place to prove for 1-1 ½ hours.",
        "Preheat the oven to 190C/375F/Gas 6.",
        "When the dough has proved, transfer to the oven and bake for 20-25 minutes, or until the bread has risen and is golden-brown. (The bread is cooked through when it sounds hollow when tapped firmly on the base.)",
        "For the soup, heat a frying pan until hot, then add the oil, onion and pumpkin and fry for 1-2 minutes.",
        "Add the garlic and cook for another minute, then add the stock and bring to the boil. Simmer for about 5-6 minutes, or until the squash is tender.",
        "Pour into a blender and blend to a fine purée (do this is batches if necessary).",
        "Place the soup back into a clean saucepan and add the lime juice and cream, then season with salt and freshly ground black pepper. Return to the heat to warm through.",
        "To serve, ladle the soup into soup plates and drizzle over a little extra virgin olive oil and a scattering of cress. Serve immediately with the pumpkin seed bread."
    ],
    "tips": [
        "You can toast your own pumpkin seeds by rinsing them to remove any lingering pulp or strings, spreading them evenly on a non-stick baking tray and roasting them for 30 minutes in an oven preheated to 140C/275F/Gas 1 - try them salted or spiced to suit your palate."
    ],
    "title": "Pumpkin soup with pumpkin seed bread",
    "videos": "[]"
}