{
    "title": "Pumpkin cider cake",
    "cookTime": "1 to 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 10",
    "recommendations": "2",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/pumpkin_cider_cake_90964_16x9.jpg"
    ],
    "description": "The classic flavour of pumpkin pie is magically translated into cake form. Add cider and you're on to a winner. For this recipe you will need a small bundt tin 21cm/8¼in in diameter. The key to making this look like a pumpkin is to use a tin with vertical segments, not with a twist.",
    "author": {
        "emily_angle": "Emily Angle"
    },
    "show": {
        
    },
    "tips": [
        "You can bake this in a larger bundt tin in a single layer. You will probably need an extra 10 minutes baking time, depending on the size of your tin."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the pumpkin purée": [
            "1 small pumpkin or squash (such as onion, crown prince and kabocha)"
        ],
        "For the cake": [
            "butter, for greasing",
            "250g/9oz light brown sugar",
            "300g/10½oz pumpkin purée",
            "100ml/3½fl oz medium dry cider",
            "100ml/3½fl oz vegetable oil",
            "2 large free-range eggs",
            "250g/9oz plain flour",
            "½ tsp salt",
            "2 tsp baking powder",
            "1 tsp bicarbonate of soda",
            "1 tsp ground cinnamon",
            "½ tsp ground ginger",
            "¼ tsp ground cloves"
        ],
        "For the decoration": [
            "75g/2¾oz unsalted butter, softened",
            "200g/7oz full fat cream cheese, at room temperature",
            "100g/3½oz icing sugar, sifted",
            "brown fondant (optional)"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "To make the pumpkin purée halve the pumpkin, scrape out the seeds and stringy bits with a spoon and discard. Place the pumpkin halves, cut side down, onto a baking tray and bake for 45 minutes, until it feels soft to the touch. Allow to cool, then scrape out the cooked flesh and mash with a fork until smooth. Set aside to cool.",
        "Grease and lightly flour a small bundt tin 21cm/8¼in in diameter.",
        "In a large mixing bowl, combine the brown sugar, pumpkin purée, cider and oil. Beat with a handheld electric mixer until thoroughly combined. Add the eggs, one at a time, beating until they are completely mixed in.",
        "In a separate bowl, sift together the flour, salt, baking powder, bicarbonate of soda and the spices. Beat this into the wet ingredients for 2-3 minutes until it is thick and smooth.",
        "Measure out half the batter into the prepared bundt tin (it should be about 550g/1lb 4oz of mixture). Bake for 30-35 minutes, until the top is springy to the touch and a wooden skewer inserted into the cake comes out clean.",
        "Allow the cake to cool in the tin for 5 minutes, then turn out onto a wire rack to cool completely. Wash, dry, and grease and flour your bundt tin again, and bake the other half.",
        "Meanwhile, make the cream cheese icing. Beat the softened butter in a bowl with a handheld electric mixer until it is light and fluffy. Add the cream cheese and beat until smooth. Gradually add the icing sugar and beat until well incorporated.",
        "When both cakes are completely cool, use a sharp knife to slice off a thin layer of the bottom of the cake to flatten it (reserve the cake trimmings). Place the 2 cakes, cut sides together, to see if it makes a convincing pumpkin shape. If necessary, trim off a little more so that the curves of the bundt tin line up with each other.",
        "Spread a little of the icing onto the bottom cake, then cover with the top cake layer. Use the reserved cake trimmings to fill in the hole in the middle of the cake. Spoon the icing onto the top of the cake and let it run down the sides. Create a fondant stem from the brown fondant, stick a toothpick in the end of the stem and secure it in the cake."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}