{
    "title": "Pumpkin gnocchi",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4-6",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "gennaro_contaldo": "Gennaro Contaldo"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1.5kg/3lbs 5oz roasted pumpkin, cut into chunks",
            "600ml/21¼fl oz vegetable stock",
            "plain flour, as required",
            "rice flour"
        ],
        "For the sauce": [
            "1 rosemary branch",
            "200g/7½ oz raw pumpkin, cut into very small cubes",
            "25g/1 oz butter",
            "approx. 200g/7¼oz mashed, roasted pumpkin",
            "3 tbsp olive oil",
            "4 tbsp freshly grated parmesan cheese, or vegetarian parmesan-style grating cheese",
            "extra virgin olive oil, for drizzling"
        ]
    },
    "steps": [
        "Place the roasted pumpkin in a moulis and whiz until you obtain a creamy consistency. Alternatively, mash with a fork or potato masher.",
        "Remove approx. 200g (7¼oz) of this mixture and set aside for the sauce.",
        "Place the rest of the mashed pumpkin and the stock into a saucepan and bring to the boil.",
        "Reduce the heat and stir in abundant flour as if making polenta. It will be ready when the mixture no longer sticks to the sides of the pan.",
        "Remove from the heat, and allow to cool.",
        "Place the cooled mixture on a clean, rice-floured surface and, with the help of some more rice flour, take large pieces of the dough and roll them into sausage shapes, then slice into 2cm (¾in) squares.",
        "Bring a large saucepan of salted water to the boil.",
        "Meanwhile, to make the sauce, heat the olive oil in a frying pan and fry the rosemary until the needles are crispy.",
        "Add the raw pumpkin cubes and sauté for a couple of minutes.",
        "In another frying pan, melt the butter and stir in the sieved pumpkin until heated through.",
        "Drop the fresh gnocchi into the pan of boiling water and simmer until they rise back up to the top. As they come to the surface, lift them out with a slotted spoon, drain well and add to the sieved pumpkin sauce.",
        "To serve, place on individual plates and spoon some of the fried pumpkin and rosemary over each.",
        "Sprinkle with parmesan cheese and a drizzle of olive oil to serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}