{
    "title": "Pumpkin and ginger cheesecake",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "over 2 hours",
    "serves": "Makes 4 individual cheesecakes",
    "recommendations": "2",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/pumpkin_and_ginger_27580_16x9.jpg"
    ],
    "description": "Turn leftover pumpkin pulp into a delicious dessert with these individual no-bake cheesecakes. Equipment and preparation: for this recipe you can use four 7cm/3in chefs’ rings (about 6cm/2½in deep), but you can also make it in a 20cm/8in springform tin.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "tips": [
        "Use a small sweet pumpkin to make this recipe, as the flesh is denser and less watery."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the filling": [
            "300g/10½oz pumpkin, peeled and cut into bite-sized pieces",
            "25g/1oz butter, cubed",
            "2 tbsp caster sugar",
            "3 tbsp ginger syrup (from a jar of stem ginger)",
            "200ml/7fl oz double cream, whipped",
            "200g/7oz cream cheese",
            "100g/3½oz thick Greek yoghurt",
            "3 pieces stem ginger, finely chopped, plus extra for garnish"
        ],
        "For the base": [
            "10 gingernut biscuits",
            "50g/1¾oz melted butter"
        ]
    },
    "steps": [
        "Preheat the oven 200C/400F/Gas 6.",
        "For the filling, place the chopped pumpkin on a baking tray. Dot with butter, sprinkle over the caster sugar and drizzle with the ginger syrup. Bake in the oven for 30–35 minutes, or until the pumpkin is soft.",
        "For the base, crush the gingernuts until they resemble breadcrumbs; you can do this in a food processor or by placing the biscuits in a food bag and bashing them with a rolling pin. Place the crushed biscuits in a bowl and stir in the melted butter until well combined.",
        "Line a baking tray with baking parchment. Place four metal chefs’ rings on the tray. Divide the gingernut mixture between the bases and, using the back of a spoon, press the mixture down to form a smooth base.",
        "For the filling, put the roasted pumpkin and any cooking juices in a food processor. Pulse until you have a smooth purée. Taste and add more sugar if required.",
        "Mix the whipped cream, cream cheese and yoghurt together in a bowl. Add the stem ginger and mix well. Swirl the pumpkin purée through the cream mixture, then spoon it on the biscuit bases. Smooth over the tops and place in the fridge for 1-2 hours, or until set.",
        "When ready to serve, remove the chefs’ rings (you may need to run a hot cloth or blowtorch round the outside of the tins to help ease out the cheesecakes) and decorate the top of the cheesecakes with extra stem ginger."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}