{
    "author": {
        "nigel_slater": "Nigel Slater"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This lentil and pumpkin stew is all about how to make a straightforward recipe a lot more exciting - with very little effort. Perfect for when it’s cooling down outside and you want something really warming. Each serving provides 273kcal, 8g protein, 28g carbohydrate (of which 14g sugars), 12g fat (of which 7g saturates), 9g fibre and 2g salt.",
    "dishes": [
        "bun",
        "stew",
        "stock",
        "veggie_stew"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "40g/1½oz butter",
            "2 onions, chopped",
            "1 carrot, chopped",
            "1 stick celery, chopped",
            "3 sprigs rosemary",
            "2 bay leaves",
            "1 clove garlic, chopped",
            "400g/14oz lentils",
            "1.2litres/2pints 2fl oz vegetable stock",
            "600g/1lb 5oz assorted pumpkin or squash (total chopped weight)",
            "small bunch parsley, chopped",
            "2 tbsp red wine vinegar",
            "4 tbsp sour cream"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "81",
    "serves": "Serves 4",
    "show": {
        "b01s72gt": "Nigel Slater's Simple Cooking"
    },
    "steps": [
        "In a large pan melt the butter and then add chopped onions, carrot and celery. Tear in the rosemary and a couple of bay leaves and after a few minutes add the chopped garlic. When all have nicely softened, tip in the lentils and pour over 1litre/1¾ pints of vegetable stock. Bring to the boil and then leave to simmer whilst you tend to the pumpkin.",
        "Using a variety of pumpkins and squashes gives the stew a more complex flavour. Here I use acorn squash and Cinderella, but you want to end up with about 600g/1lb 5oz of peeled pumpkin in large chunks. Add them to the stew, season and then pour over enough water to just cover all the ingredients. Put a lid on the pan and leave to simmer for 30-40 minutes.",
        "When the stew is almost ready, add the chopped parsley.",
        "To make the stew creamier, remove a small bowlful to a food processor and blitz it with 200ml/2fl oz of stock. Pour it back in and the stew becomes instantly more velvety.",
        "Serve the stew in bowls, finishing each helping off with a cooling spoonful of sour cream."
    ],
    "tips": [
        
    ],
    "title": "Pumpkin stew with sour cream",
    "videos": "[p00llsdz:p00llsf1]"
}