{
    "author": {
        "paul_merrett": "Paul Merrett"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "You'll need two fluted pastry cutters, one 5cm/2in, the other 11.5cm/4.5in, or similar sized cutters",
    "dishes": [
        "bun",
        "pasta",
        "pastry",
        "pie",
        "ravioli"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "kneading"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "1kg/2lb 3oz wedge of pumpkin",
            "3 tbsp light olive oil",
            "75g/2½oz shiitake mushrooms",
            "150g/5oz oyster mushrooms",
            "1 garlic clove",
            "1 tbsp butter",
            "salt and freshly ground black pepper",
            "200g/7oz ricotta",
            "1 egg, beaten with 1 tsp water"
        ],
        "For the pasta dough": [
            "250g/9oz '00' flour, plus extra for dusting (available in most supermarkets and in Italian speciality stores)",
            "250g/9oz fine semolina (available in most supermarkets and in Italian speciality stores)",
            "7 medium eggs"
        ],
        "For the sage butter": [
            "pumpkin seeds (reserved from the pumpkin wedge)",
            "1 small bunch sage leaves",
            "175g/6oz unsalted butter",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "large bag rocket leaves",
            "parmesan or vegetarian parmesan-style cheese shavings, to taste"
        ],
        "default": [
            "For this recipe, you can make your own pasta dough, as below, or you can use frozen ready-made wonton wrappers"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "2",
    "serves": "Makes 10-12 large ravioli",
    "show": {
        
    },
    "steps": [
        "For the filling, cut the wedge of pumpkin flesh into four large pieces. Remove the seeds and reserve.",
        "Heat two tablespoons of the olive oil in a heavy-bottomed pan. Add the pumpkin pieces and nicely brown on both sides, for about 10-15 minutes on each side. When cooked, the flesh will be fairly soft, but still firm when pierced with a knife.",
        "Slice the shiitake mushrooms into thick slices, removing any tough stalks. Tear the oyster mushrooms into slices. Heat the remaining one tablespoon of olive oil in a heavy-bottomed pan. Add the mushrooms and cook for a minute or two, stirring. Roughly chop the garlic and add it to the pan, along with the butter, towards the end of cooking time. Place the cooked mushrooms in a bowl to cool.",
        "When the pumpkin is cooked, separate the skin from the flesh using a spoon, discarding the skin. Mash gently and place in the bowl with the cooked mushrooms. Season, to taste, with salt and freshly ground black pepper and mix thoroughly. Allow to cool. When cool, add the ricotta, mix together thoroughly and check seasoning.",
        "If making your own pasta, place the '00' flour in a large clean bowl. Add the semolina and mix together with your hands. Make a well in the centre of the flour.",
        "Lightly beat the eggs and pour into the centre of the flour. Mix well with a wooden spoon until the eggs are incorporated into the flour.",
        "Turn the dough out onto a clean, floured work surface. Knead the dough until it's smooth and elastic (about 10-15 minutes). Wrap the dough in cling film and place in the fridge to rest for at least half an hour.",
        "Roll the dough out thinly on a clean, floured work surface with a rolling pin. Cut out large pieces of dough roughly 14cm/5½in square. (You can store any leftover pasta dough in the fridge for up three days.)",
        "Place the smaller of the two fluted pastry cutters in the centre of each pasta square. Place a tablespoon or so of the pumpkin filling inside the cutter and then remove. Using a pastry brush, brush the beaten egg and water over the pasta square, around the filling. Lay another square on top, carefully working out any air that's inside with your fingers.",
        "Use the larger cutter to cut out the ravioli. Repeat this process with the remaining pastry squares. You can store the ravioli in the fridge for a few hours on well-floured greaseproof paper.",
        "Cook the ravioli in a large pan of simmering water, for 4-6 minutes, turning over once during the cooking time. Remove with a slotted spoon when cooked.",
        "For the sage butter, remove any flesh from reserved the pumpkin seeds. Heat a small frying pan (without oil) and, when hot, add the pumpkin seeds and toast until lightly browned.",
        "Chop 5-6 sage leaves into thin strips, reserving some whole leaves to garnish. Add the butter to the pan with the pumpkin seeds, then add the sage and season, to taste, with salt and freshly ground black pepper. Allow the butter to brown slightly, then take off the heat.",
        "To serve, place a small mound of rocket on each plate. Place a single ravioli or several ravioli on top of the rocket and top with a sage leaf or two. Shave over some parmesan and spoon over the sage butter. Serve."
    ],
    "tips": [
        
    ],
    "title": "Pumpkin ravioli with sage butter",
    "videos": "[]"
}