{
    "title": "Purple sprouting broccoli gratin with cheese sauce and toasted brioche",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "Lincolnshire Poacher cheese adds a nutty flavour to this indulgent broccoli gratin topped with brioche croutons.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "100g/3½oz unsalted butter",
            "50g/1¾oz plain flour",
            "450ml/16fl oz full-fat milk",
            "1 tsp English mustard",
            "1 tsp Worcestershire sauce",
            "200g/7oz cheddar, grated",
            "½ loaf brioche, sliced into 1cm/½in cubes",
            "400g/14oz purple sprouting broccoli",
            "150g/5½oz Lincolnshire Poacher cheese, grated (or a similar vegetarian cheese)",
            "50g/1¾oz mixed salad leaves",
            "3 tbsp olive oil",
            "1 tbsp cider vinegar",
            "1 lemon, juice only"
        ]
    },
    "steps": [
        "Preheat the grill to high.",
        "Place a pan over a low to medium heat and add half the butter. Once melted, stir in the flour and cook, stirring, for two minutes.",
        "Gradually add the milk, stirring all the time, until you have a smooth sauce. Add the mustard, Worcestershire sauce and cheddar, then whisk until smooth.",
        "In a large pan of boiling water, cook the broccoli for 2-3 minutes. Drain and set aside.",
        "Heat the remaining butter in a frying pan and add the brioche. Fry for two minutes, or until golden-brown.",
        "In a heatproof serving dish, layer the broccoli, cheese sauce and brioche. Sprinkle over the Lincolnshire Poacher cheese and place under the hot grill.",
        "Place the salad leaves in a bowl. In a separate bowl, whisk the oil, vinegar and lemon juice together, then pour over the salad leaves.",
        "Serve warm with the salad on the side."
    ],
    "howTos": [
        "making_bechamel_sauce"
    ],
    "videos": "[]"
}