{
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Mexican",
    "description": "This money-saving gem takes just a few minutes effort and beats any ready meal. Try the bean mixture as an easy vegetarian chilli served with rice. This meal provides 648 kcal, 28g protein, 74g carbohydrate (of which 15g sugars), 26g fat (of which 12g saturates), 18g fibre and 3.2g salt per portion.",
    "dishes": [
        "oven-baked_dishes",
        "salad",
        "sauce",
        "stir-fries",
        "wraps"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quick_beany_enchiladas_63257_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 tbsp sunflower oil, plus extra for greasing",
            "100g/3½oz frozen chopped onion (or 1 medium onion, peeled and roughly chopped)",
            "100g/3½oz mixed frozen peppers (or 1 yellow pepper, de-seeded and sliced)",
            "1 x 400g tin chopped tomatoes",
            "1 x 400g tin red kidney beans in chilli sauce",
            "1 tbsp freshly squeezed lime or lemon juice",
            "3 heaped tbsp chopped fresh coriander, plus extra to garnish",
            "4 x 40g/1½oz ready-made flour tortillas",
            "75g/2½oz mature cheddar, coarsely grated",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 2",
    "show": {
        
    },
    "steps": [
        "Heat the oil in a large non-stick frying pan over a medium heat. Add the onion and peppers and fry for 4-5 minutes, or until softened and beginning to turn golden-brown. Stir in the chopped tomatoes and kidney beans.",
        "Bring the mixture to the boil, then reduce the heat until the mixture is simmering. Simmer gently for 12-15 minutes, or until the sauce is thick and glossy.",
        "Remove the pan from the heat, then stir in the lime juice (or lemon juice) and coriander. Season, to taste, with salt and plenty of freshly ground black pepper.",
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "Brush the insides of a shallow ovenproof dish all over with a little oil. Place one of the flour tortillas in the dish and spoon one-quarter of the bean mixture into the centre. Roll up the tortilla and push it to one side of the dish. Repeat the process with the remaining flour tortillas and bean mixture, lining the rolled tortillas up against each other.",
        "Sprinkle the enchiladas with the grated cheese and bake in the oven for 20-25 minutes, or until the cheese has melted and turned golden-brown. Just before serving, garnish the enchiladas with fresh coriander.",
        "To serve, divide the enchiladas equally among the serving plates. Serve with a mixed green salad."
    ],
    "tips": [
        "Tip 1: This dish is not suitable for freezing. However, any leftover tortillas can be frozen for another recipe. Tip 2: Frozen onions might be more expensive than fresh, but they save time and reduce waste. Tip 3: If you can't get hold of red kidney beans in chilli sauce, use plain red kidney beans and add ½ tsp hot chilli powder, 1 tsp ground cumin and 1 tsp ground coriander to the onion mixture before adding the tinned tomatoes and drained kidney beans. Tip 4: You can add chopped leftover cooked chicken to the bean mixture if you're not catering for vegetarians."
    ],
    "title": "Quick beany enchiladas",
    "videos": "[]"
}