{
    "author": {
        "jo_ingleby": "Jo Ingleby"
    },
    "cookTime": "10 to 30 mins",
    "description": "Flatbreads are cooked all over the world from Mexican tortillas to Indian chapatis. They are great served soft, filled with slaw or falafels, or baked until crisp and served with dips, soups or stews.",
    "dishes": [
        "bread",
        "chapatis",
        "dips",
        "falafel",
        "flatbread",
        "salad",
        "soup",
        "stew"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quick_flatbreads_43123_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "200g/7oz plain or wholemeal flour",
            "¼ tsp salt",
            "100ml/3½fl oz warm water",
            "2 tbsp oil (olive, sunflower or vegetable), plus extra for cooking"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Makes 4-6 flatbreads",
    "show": {
        
    },
    "steps": [
        "Kid’s job: Place the flour and salt in a large bowl and trickle on the water bit by bit.",
        "Kid’s job: Mix the water and flour together. Kids can mix using one finger so that they don’t get a whole hand covered in dough. Doughy hands can be cleaned by rubbing a little more flour onto the hands over another bowl or the bin - resist the urge to wash doughy hands as you will block the drain!",
        "Kid’s job: Add the oil and knead the dough - you are aiming for a soft dough. If it is too sticky add a little more flour, if it is too dry add a splash of water.",
        "Kid’s job: Knead the dough for five minutes - kids can do this in the bowl or on a clean surface using one or two hands.",
        "You can cook the breads straight away or leave the dough to stand for about half an hour. This is a good time to make a quick filling such as a grated salad or dip.",
        "Kid’s job: Divide the dough into four balls, or six if you have a smaller frying pan.",
        "Kid’s job: On a clean surface, roll each ball of dough one at a time using a rolling pin. If you pick up and move round the flatbread often you know it hasn’t stuck. (You may need to sprinkle a little flour on the surface but only use a little - too much will dry out the dough.) Don’t worry if they aren’t perfect circles!",
        "Adult’s job: Heat a large frying pan. Take a sheet of kitchen paper and rub a little oil onto the surface of the pan. Cook each flatbread for about two minutes on one side - it should puff up a little.",
        "Adult’s job: Flip the flatbread over using tongs and then cook for a couple of minutes on the other side. The flatbread should have turned lighter in colour and may have a few spots of brown.",
        "Keep the cooked flatbreads warm, wrapped in foil or a clean tea towel, until the others are cooked.",
        "If you want crisp flatbreads you can now rub them with a little olive oil, chop into strips or triangles with scissors and then ask an adult to bake them for 5-10 minutes, or until crisp."
    ],
    "tips": [
        "Flatbreads can be rolled out and frozen in a stack. You will need to put a bit of greaseproof paper between each of the breads so they don’t stick. Frozen flatbreads can be cooked from frozen - they will take a few minutes more to cook on a hot frying pan."
    ],
    "title": "Quick flatbreads",
    "videos": "[]"
}