{
    "title": "Quiche Lorraine",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "4",
    "recommendations": "45",
    "images": [
        
    ],
    "description": "Parmesan cheese in the homemade pastry crust is the Hairy Bikers’ secret weapon for a quiche Lorraine that’s a cut above.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b013y0nz": "Hairy Bikers' Meals on Wheels"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pastry": [
            "180g/6¼oz plain flour, plus extra for dusting",
            "100g/3½oz cold unsalted butter, cubed",
            "50g/2oz parmesan, grated",
            "2 tsp thyme, leaves only",
            "1 free-range egg yolk",
            "1 tsp chilled water (more if needed)"
        ],
        "For the filling": [
            "3 free-range eggs",
            "150g/5¼oz pancetta, cubed",
            "250ml/9fl oz crème fraîche",
            "150g/5¼oz Gruyère",
            "freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the pastry, sieve the flour into a mixing bowl. Add the butter, parmesan and thyme and rub into the flour until the mixture resembles breadcrumbs.",
        "Add the egg yolk and the water and mix to form a firm dough. Wrap the dough in cling film and place in the fridge for 30 minutes.",
        "On a floured surface, roll out the pastry to fit one large flan tin. Line the tin with the pastry, then place a circle of baking paper over the pastry and fill with baking beans.",
        "Transfer to the oven and bake for 15 minutes. Remove the beans and paper and return to the oven for five minutes.",
        "For the filling, place all the ingredients (except 50g/2oz of the Gruyère) into a large bowl and mix gently, to avoid filling the mixture with air.",
        "Spoon the filling into the pastry case and sprinkle the remaining Gruyère on top.",
        "Bake the quiche for 15 minutes, or until the filling is set. Serve hot or cold with a green salad."
    ],
    "howTos": [
        "rubbing_in"
    ],
    "videos": "[]"
}