{
    "author": {
        "simon_hopkinson": "Simon Hopkinson"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "French",
    "description": "Recipes for quiche don’t have to be daunting – just take the time to make homemade pastry for a crispy slice of nostalgia.",
    "dishes": [
        "bread",
        "custard",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "quiche",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "cartouche"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quiche_lorraine_03344_16x9.jpg"
    ],
    "ingredients": {
        "For the filling": [
            "8-10 thin rashers good quality smoked streaky bacon",
            "4 free-range egg yolks",
            "3 free-range eggs",
            "400ml/14fl oz whipping cream",
            "salt and freshly ground white pepper",
            "freshly grated nutmeg"
        ],
        "For the pastry": [
            "60g/2oz butter, cut into small pieces",
            "60g/2oz lard, cut into small pieces",
            "200g/7oz self-raising flour",
            "pinch salt",
            "2-3 tbsp ice-cold water"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "50",
    "serves": "Serves 6",
    "show": {
        "b012gg69": "The Good Cook"
    },
    "steps": [
        "For the pastry, place the butter, lard, flour and salt into a food processor. Pulse the mixture until it resembles coarse breadcrumbs.",
        "Place the pastry into a mixing bowl and, using a round-bladed knife, stir in enough water to bind the mixture together. Lightly knead the dough until well amalgamated, dust with flour and slip into a plastic bag. Chill in the fridge for 30 minutes before using.",
        "Preheat the oven to 180C/350F/Gas 4 and warm a baking sheet.",
        "Roll out the pastry as thinly as possible. Line a 20cm/8in wide by 4cm/1½in deep tart tin and lightly prick the base of the pastry with a fork all over. Place onto a baking tray, line with greased aluminium foil and baking beans and bake blind for 15-20 minutes.",
        "Remove the baking beans and foil. Place the tart case back into the oven and cook for a further 10 minutes, or until it is pale golden, crisp and cooked through.",
        "Fry the bacon in a dry, non-stick frying pan for 1-2 minutes, or until crisp. Drain onto kitchen paper and spread out evenly over the base of the cooked tart case.",
        "Whisk the egg yolks and whole eggs together in a bowl. Stir in the cream and season with salt, pepper and nutmeg. Pour the mixture into the pastry case and cook for 30-40 minutes, or until nicely puffed and the surface of the custard is pale golden and just set.",
        "Eat warm, or at room temperature."
    ],
    "tips": [
        
    ],
    "title": "Quiche Lorraine",
    "videos": "[]"
}