{
    "author": {
        "delia_smith": "Delia Smith"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "British",
    "description": "Delia walks you through this simple tea bread recipe for delicious results - perfect for beginners and for baking with kids. Equipment and peparation: You will need one pleated bread loaf tin 900g/2lb with a base measurement of 9x16cm/3½x6½in lightly buttered.",
    "dishes": [
        "bread",
        "cake",
        "oven-baked_dishes",
        "slow-cooked_dishes",
        "tea_bread"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quickapricotappleand_67261_16x9.jpg"
    ],
    "ingredients": {
        "For the loaf cake": [
            "175g/6oz ready-to-eat apricots, each chopped in half",
            "175g/6oz cooking apple (1 medium apple), cut into 1cm/½in chunks with skins on",
            "175g/6oz pecan nuts",
            "pinch of salt",
            "1½ level tsp baking powder",
            "2 rounded tsp cinnamon",
            "110g/4oz plain flour",
            "110g/4oz wholewheat flour",
            "110g/4oz butter, at room temperature",
            "175g/6oz soft brown sugar",
            "2 eggs, beaten",
            "3 tbsp milk"
        ],
        "For the topping": [
            "4 cubes demerara sugar, roughly crushed",
            "¼ level tsp ground cinnamon"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "22",
    "serves": "Makes 1 loaf cake",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "When the oven has preheated, spread the nuts out on a baking sheet and toast them lightly for about 8 minutes, using a timer so that you don't forget them.",
        "After that, remove them from the oven to a chopping board, let them cool a bit, then chop them roughly.",
        "Meanwhile, take a large mixing bowl, sift the salt, baking powder, cinnamon and both flours into it, holding the sieve up high to give the flour a good airing and adding the bran from the sieve. Then simply add all the rest of the ingredients except the fruit and nuts.",
        "Take an electric hand whisk, begin to beat the mixture on a slow speed, then increase the speed to mix everything thoroughly before folding in the apricot, apples and pecans.",
        "When it's all mixed add some more milk if necessary to give a mixture that drops easily off a spoon, then pile the mixture into the tin, level the top, sprinkle on the crushed sugar cubes and cinnamon, and bake in the centre of the oven for 1¼-1½ hours or until the cake feels springy in the centre.",
        "After that remove it from the oven, let it cool for about 5 minutes in the tin, then turn it out on to a wire tray and let it get completely cold before transferring it to a tin. The storage tin may not be needed if there are people around, as this loaf tends to vanish very quickly."
    ],
    "tips": [
        
    ],
    "title": "Quick apricot, apple and pecan loaf cake",
    "videos": "[]"
}