{
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "cookTime": "10 to 30 mins",
    "description": "People often tell me that cooking with shellfish is something which they find intimidating. It is really a case of just bunging the shellfish into the pan, then standing back and letting the hob do the work for you.",
    "dishes": [
        "bun",
        "linguine",
        "pasta",
        "sauce",
        "stir-fries",
        "whole_wheat_pasta"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quick_linguine_with_93749_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "350g/12oz dried linguine or spaghetti pasta (regular or whole wheat)",
            "3 tbsp extra virgin olive oil, plus extra for drizzling",
            "2 large banana shallots, finely diced",
            "3 garlic cloves, very finely chopped",
            "2 red chillies, seeds removed (if you like less heat) and finely chopped",
            "400g/14oz raw, peeled tiger prawns, deveined (about 600g/1lb 5oz frozen weight)",
            "400g/14oz clams in their shells, washed thoroughly (ideally soaked them in cold water for an hour), discard any that remain open when tapped",
            "1 glass white wine (about 150-200ml/5-7fl oz)",
            "1 small bunch parsley, roughly chopped (about 3 tbsp chopped)",
            "flaked sea salt and freshly ground black pepper",
            "70g/2½oz rocket",
            "1 small lemon, cut into 4 wedges"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b04hcm51": "Lorraine Pascale: How to be a Better Cook"
    },
    "steps": [
        "Cook the pasta in a large saucepan of boiling water according to the packet instructions, adding salt to flavour and some oil to stop the pasta sticking if desired.",
        "Meanwhile, put the oil in a large saucepan (that has a tight-fitting lid) over a medium heat. Add the shallots and gently fry for 8-10 minutes until softened, stirring from time to time. Add the garlic and chillies and cook for a couple of minutes.",
        "Add the prawns and cook for one minute, stirring. Add the clams and white wine, bring to the boil and then cover with a lid. Allow to cook for 4-5 minutes, or until the clam shells have all opened (discard any that don’t) and the prawns have turned from grey to pink.",
        "Once the pasta is cooked, drain well, tip it in on top of the shellfish and mix together well. Stir the chopped parsley through and season to taste with sea salt and black pepper.",
        "Pile into serving bowls, drizzle with an extra bit of olive oil, scatter the rocket over, top with a good grinding of black pepper and serve each bowl with a wedge of lemon."
    ],
    "tips": [
        
    ],
    "title": "Quick linguine with prawns, clams, garlic and chilli",
    "videos": "[]"
}