{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Roasted garlic and top-quality tinned tomatoes make all the difference to this simple soup. To simplify the garlic bread, just mix the roasted garlic with softened butter. Equipment and preparation: you will need a free-standing mixer, clean sheet of muslin and stick-blender or food processor.",
    "dishes": [
        "baguette",
        "bread",
        "bun",
        "jam",
        "oven-baked_dishes",
        "pie",
        "soup",
        "stir-fries",
        "tomato_soup"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the garlic butter": [
            "1 garlic bulb",
            "500ml/18fl oz double cream",
            "salt and freshly ground black pepper",
            "1 large bunch basil, roughly chopped, 2 sprigs reserved"
        ],
        "For the tomato soup": [
            "75ml/2½fl oz extra virgin olive oil",
            "½ banana shallot, finely chopped",
            "2 x 400g/14oz tin San Marzano tomatoes",
            "1 small baguette, cut lengthways into 4 pieces"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "12",
    "serves": "Serves 2",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Preheat the oven to 170C/340F/Gas 3½",
        "Wrap the whole garlic bulb in aluminium foil and place on a tray in the oven. Roast for 40-45 minutes, or until soft.",
        "When the garlic is cool enough to handle, cut the top off of the bulb. Squeeze out all the garlic and finely chop.",
        "Pour the double cream into the bowl of a freestanding mixer and beat for 3-5 minutes, or until the mixture turns to solid fatty lumps with a liquid base.",
        "Line a colander with a clean muslin cloth and place it over a bowl. Tip the mixture into the colander and wrap the muslin tightly around the cream. Squeeze out all the liquid so that you have a solid mass of butter in the muslin, then discard the liquid.",
        "Tip the butter into the bowl, add the chopped garlic and a generous pinch of salt. Stir in a third of the chopped basil and mix once more.",
        "Heat a large frying pan or sauté pan until hot, add all but two tablespoons of the extra virgin olive oil and the shallot and gently fry for a minute.",
        "Add the tinned tomatoes and the rest of the basil, reserving two sprigs for garnish, then simmer for 2-3 minutes.",
        "While the soup simmers, heat a griddle pan until very hot and char the bread on both sides, then slather with the garlic butter and place in the oven to warm through.",
        "Blend the soup using a stick blender or a food processor until you have a fine pureé. Season, to taste, with salt and black pepper.",
        "Serve the soup in bowls with the reserved olive oil drizzled over the top and a scattering of basil leaves, and the garlic bread alongside."
    ],
    "tips": [
        
    ],
    "title": "Tomato and basil soup with the best ever garlic bread",
    "videos": "[p01sxnd3:p01sxnd8]"
}