{
    "author": {
        "jasmine_and_melissa_hemsley": "Hemsley + Hemsley"
    },
    "cookTime": "10 to 30 mins",
    "description": "This quick and easy gluten-free salad is packed with raw vegetables, healthy seeds and wholesome grains. This meal provides 312 kcal, 9g protein, 31g carbohydrate (of which 10g sugars), 17g fat (of which 3g saturates), 4g fibre and 0.2g salt per portion.",
    "dishes": [
        "salad",
        "sauce",
        "stir-fries",
        "warm_salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quinoa_goji_tabbouleh_96233_16x9.jpg"
    ],
    "ingredients": {
        "For the dressing": [
            "8 tbsp extra virgin olive oil",
            "4 tbsp lemon juice",
            "1 garlic clove, crushed",
            "1 tsp honey, preferably raw honey (available from health food stores)",
            "sea salt and freshly ground black pepper"
        ],
        "For the salad": [
            "350g/12oz quinoa",
            "400g/14oz tomatoes, halved, deseeded, diced",
            "300g/10½oz fresh flatleaf parsley, leaves finely chopped",
            "60g/2¼oz fresh mint leaves, finely chopped",
            "4 spring onions, trimmed, finely chopped",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "3 tbsp black or white sesame seeds",
            "handful goji berries"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "1",
    "serves": "Serves 8",
    "show": {
        
    },
    "steps": [
        "Put the quinoa in a bowl and cover with approximately 700ml/1¼ pints cold water. Add a pinch of salt. Set aside to soak overnight (or for at least 8 hours).",
        "Drain and rinse the quinoa well. Put the quinoa in a saucepan, cover with water and bring to the boil. Reduce the heat and simmer for 10-12 minutes, or until tender. Remove from the heat and set aside to cool slightly for 5 minutes. Fluff with a fork to separate the grains.",
        "Meanwhile, for the dressing, in a large bowl, whisk together all of the dressing ingredients until well combined.",
        "Add the tomatoes to the dressing, then stir in the herbs, spring onions and quinoa. Season with salt and pepper.",
        "Just before serving, heat a frying pan over a medium heat. Add the sesame seeds and dry-fry for 1-2 minutes, or until toasted and golden-brown, shaking the pan occasionally to prevent the seeds from burning. Remove from the pan and set aside.",
        "To serve, pile the tabbouleh on a platter, then sprinkle over the toasted sesame seeds and goji berries."
    ],
    "tips": [
        "If you don’t have time to soak the quinoa, wash it thoroughly under cold running water, then cook according to the packet instructions."
    ],
    "title": "Quinoa goji tabbouleh",
    "videos": "[]"
}