{
    "author": {
        "jasmine_and_melissa_hemsley": "Hemsley + Hemsley"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "These tasty vegetarian burgers use quinoa and halloumi for a healthier alternative to meat or takeaways. Each burger provides 122 kcal, 6.5g protein, 11g carbohydrate (of which 1.3g sugars), 6g fat (of which 3.5g saturates), 0.5g fibre and 0.5g salt.",
    "dishes": [
        "beef_burger",
        "oven-baked_dishes",
        "salad",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/quinoa_and_halloumi_57964_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "250g/9oz quinoa",
            "250ml/9fl oz vegetable stock or water",
            "2 free-range eggs, beaten",
            "3 tbsp chickpea flour",
            "3 tsp dried oregano or thyme",
            "½ tsp chilli flakes (or chopped fresh chilli, to taste)",
            "3 garlic cloves, crushed",
            "5 spring onions, trimmed and finely sliced",
            "225g/8oz halloumi, diced",
            "1 tbsp ghee, for frying",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "2",
    "serves": "Makes 16",
    "show": {
        
    },
    "steps": [
        "Put the quinoa in a bowl and cover with approximately 500ml/18fl oz cold water. Add a pinch of salt. Set aside to soak overnight (or for at least 8 hours). Drain well.",
        "Bring the stock to the boil in a large saucepan. Add the quinoa, stir once, then simmer for 10-12 minutes, or until tender. Remove from the heat and drain well. Set aside to cool.",
        "Preheat the oven to 190C/170C Fan/Gas 5.",
        "In a large mixing bowl, beat together the eggs, chickpea flour, herbs, chilli, and garlic until smooth and well combined. Stir in the spring onions, halloumi and quinoa. Season with salt and pepper. Add a little more chickpea flour or water if needed.",
        "Shape the burger mixture into 16 equal-shaped patties in your hands.",
        "Heat the ghee in a large frying pan over a medium-high heat. When the fat is smoking, add the burger patties, shape with a spoon in the pan. You may need to do this in batches. Fry for 3-4 minutes, or until a golden-brown crust forms, then gently flip with a spatula and fry the other side.",
        "Transfer the fried burgers to a roasting tray. When all of the burgers have been fried, cook them in the oven for a further 12-15 minutes, or until cooked through.",
        "Serve with a green salad with red onion and avocado."
    ],
    "tips": [
        "Tip 1: If you don’t have time to soak the quinoa, wash it thoroughly under cold running water, then cook according to the packet instructions. Tip 2: Instead of frying the burgers, you can arrange them onto a lightly greased baking tray and bake for 20-25 minutes, until firm and golden-brown. Tip 3: To check the seasoning of the burgers, fry a tablespoonful of the mixture before shaping it into patties, then season the main mixture accordingly."
    ],
    "title": "Quinoa and halloumi burger",
    "videos": "[]"
}