{
    "author": {
        "manju_malhi": "Manju Malhi"
    },
    "cookTime": "over 2 hours",
    "cusine": "Indian",
    "description": "",
    "dishes": [
        "curry",
        "gravy",
        "oven-baked_dishes",
        "raita"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the marinade": [
            "3 tbsp vegetable oil",
            "3 garlic cloves, crushed",
            "255ml/9fl oz natural unsweetened yoghurt",
            "1 tbsp garam masala",
            "1 tsp fresh ginger, finely grated",
            "½ tsp salt",
            "¼ tsp medium-hot chilli powder",
            "5-6 saffron strands"
        ],
        "For the seasoned yoghurt": [
            "255ml/9fl oz natural unsweetened yoghurt",
            "1 small Spanish onion, finely sliced",
            "1 medium tomato, finely chopped",
            "1 green finger chilli, finely chopped",
            "¼ tsp salt",
            "1 tbsp vegetable oil",
            "¼ tsp brown or black mustard seeds",
            "4 curry leaves",
            "10 unsalted skinned peanuts (optional)"
        ],
        "default": [
            "1.5kg/3½lb leg of lamb, on the bone"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Prick the lamb all over with a skewer.",
        "Mix all the remaining ingredients together to make the marinade, and smear it thickly over the lamb.",
        "Place on a plate and cover, then leave to marinate in the refrigerator for a couple of hours.",
        "Preheat the oven 180C/350F/Gas 4.",
        "Put the lamb in a roasting tin and cover loosely with foil, ensuring that it doesn't touch the lamb. Cook for about two hours until the meat is tender, basting the lamb about halfway through with the juices from the pan.",
        "Remove the foil and cook for 8-10 minutes more.",
        "Take the meat out of the oven, cover loosely with foil and leave the rest in a warm place for about 15 minutes.",
        "While the lamb is resting, make the seasoned yoghurt. Whip the yoghurt until it is creamy. Fold in the onion, tomato, green chilli, and salt.",
        "Heat the oil in a small frying pan, then add the mustard seeds and curry leaves. Be careful as the mustard seeds will pop when heated. Fry for a few seconds, then add the peanuts, if using. Fry for a minute, making sure the mixture doesn't burn.",
        "When the mixture has cooled, gently add it to the yoghurt. Serve chilled with the roasted lamb.",
        "Make a gravy with the remaining juices from the roasting tin by stirring in 75-100ml/2½-3½fl oz boiling water and simmering over a medium heat for three minutes.",
        "Carve the lamb and pour the spicy gravy over the meat."
    ],
    "tips": [
        
    ],
    "title": "Marinated roast leg of lamb (raan) served with seasoned yoghurt (tadka raita)",
    "videos": "[]"
}