{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "East_European",
    "description": "I have been on the lookout for good rabbit dishes ever since I took a holiday on the island of Malta where there are a lot of them, being dry limestone country where not much other wildlife can thrive. This recipe, from Adriatic Croatia/Albania, uses garlic, tomatoes, olive oil, baby onions and red wine. Try it with rice or orzo pasta.",
    "dishes": [
        "caramel",
        "casserole",
        "oven-baked_dishes",
        "pasta",
        "pie",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "2 rabbits, cleaned and jointed (ask your butcher to do this, if you like)",
            "3 bay leaves",
            "4 tbsp balsamic vinegar",
            "100ml/3½fl oz olive oil",
            "4 garlic cloves, grated",
            "6 whole allspice berries",
            "1 cinnamon stick",
            "200ml/7fl oz red wine",
            "350ml/12fl oz chicken stock, hot",
            "2 tbsp tomato purée",
            "5 ripe tomatoes, peeled and chopped",
            "1 tsp dried oregano",
            "600g/1lb 5oz baby onions or shallots, peeled and left whole",
            "1 tsp sugar",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "1",
    "serves": "Serves 10-12",
    "show": {
        "b0667qf6": "Rick Stein: From Venice to Istanbul"
    },
    "steps": [
        "Wash the rabbit pieces well, then pat dry and put in a bowl with the bay leaves and pour over the vinegar. Cover and set aside to marinate for at least 1 hour in the fridge.",
        "Preheat the oven to 160C/140C Fan/Gas 3.",
        "Heat a couple of tablespoons of the olive oil in a flameproof lidded casserole pan over a high heat and fry the rabbit pieces in batches until they are well browned all over. Return all the rabbit pieces to the pan along with the bay leaves from the marinade.",
        "Add the garlic, allspice berries, cinnamon stick and red wine. Bring to the boil. Add the chicken stock, tomato purée, tomatoes and oregano. Season with salt and pepper and reduce to a simmer. Cover the pan, transfer to the oven and cook for 1–1½ hours until the rabbit is tender.",
        "Meanwhile, heat the remaining oil in a frying pan and fry the baby onions gently, stirring frequently, until just golden-brown all over. This should take about 10–15 minutes. Add the sugar halfway through to help them to caramelize. Tip the onions into the pot containing the rabbit just before it’s done and stir through.",
        "Serve with rice or orzo pasta."
    ],
    "tips": [
        
    ],
    "title": "Rabbit and onion casserole (Lepur çomlek)",
    "videos": "[]"
}