{
    "title": "Rabbit pie",
    "cookTime": "1 to 2 hours",
    "prepTime": "1-2 hours",
    "serves": "Serves 4",
    "recommendations": "8",
    "images": [
        
    ],
    "description": "Rabbit with cider, mustard and chicken stock, topped with a shortcrust pastry lid. Rustic cooking at its best.",
    "author": {
        "liz_smith": "Liz Smith"
    },
    "show": {
        "b00701fw": "A Taste of My Life"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pie filling": [
            "1 wild rabbit, cut into serving pieces",
            "salt and freshly ground black pepper",
            "2 tbsp vegetable oil",
            "5 shallots, sliced",
            "2 carrots, sliced",
            "2 celery sticks, sliced",
            "300ml/10fl oz chicken stock",
            "300ml/10fl oz dry cider",
            "1 bay leaf",
            "1 handful chopped fresh rosemary leaves",
            "1 tbsp Dijon mustard"
        ],
        "For the beurre manié": [
            "40g/1½ oz butter, softened",
            "40g/1½oz plain flour"
        ],
        "For the crust": [
            "225g/8oz ready-made shortcrust pastry",
            "flour, for dusting",
            "1 free-range egg, yolk only"
        ]
    },
    "steps": [
        "Soak the rabbit in water for an hour to whiten the flesh.",
        "For the pie filling, season the rabbit pieces with salt and freshly ground black pepper. Heat the oil in a frying pan, then lightly fry the rabbit pieces for 3-4 minutes, or until the rabbit is beginning to brown. Remove from the pan and set aside.",
        "Add the shallots, carrots and celery to the pan and lightly fry for 2-3 minutes, or until the onions begin to turn translucent. Pour in the stock and the cider and stir in the bay leaf, chopped rosemary and mustard until well combined.",
        "Place the rabbit pieces back into the pan and cover with a lid. Lower the heat and allow to simmer for 45 minutes to one hour, or until the rabbit is tender.",
        "Remove the rabbit pieces from the stock and place into an ovenproof ceramic pie dish.",
        "For the buerre manié, mash the softened butter into the flour with a fork and add in small pieces to the stock in the saucepan. Stir constantly over a medium heat until well combined and the sauce thickens, then pour the mixture over the rabbit in the dish. Brush the edges of the dish with water.",
        "Preheat the oven to 220C/430F/Gas 7.",
        "For the crust, roll out the pastry on a floured work surface and cut off a strip long enough to go around the edges of the pie dish. Lay it around the edges of the dish and moisten with water.",
        "Roll out the rest of the pastry into a circle large enough to fit over the pie dish. Place the pastry circle on top of the dish and press the overhanging edges down into the pastry strip, sealing well. Make a few slits in the top of the pastry to let out the steam and prevent the crust from going soggy.",
        "Bake in the oven for 30-40 minutes, or until the pastry is golden-brown and crisp. Slice into wedges and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}