{
    "title": "Rabbit with prunes and mustard",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "16",
    "images": [
        
    ],
    "description": "Try this hearty rabbit with prunes and mustard - a good way of showcasing game.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "200g/7oz ready-to-eat pitted prunes",
            "6 tbsp brandy",
            "50g/2oz butter",
            "1 tbsp sunflower oil",
            "2 young wild rabbits, skinned, cleaned and jointed into six portions",
            "8 rindless rashers streaky bacon, cut into 2cm¾in pieces",
            "2 large long shallots, sliced lengthways",
            "2 tbsp plain flour",
            "200ml/7fl oz white wine or cider",
            "1 tbsp Dijon mustard",
            "2 tsp wholegrain mustard",
            "1 bay leaf",
            "1 small bunch fresh thyme",
            "500ml/17fl oz chicken stock",
            "100ml/3½fl oz double cream",
            "sea salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/35oF/Gas 4.",
        "Put the prunes in a small saucepan and pour over the brandy. Bring to a simmer over a medium heat, turning the prunes in the liqueur. Set aside to cool.",
        "Melt 25/1oz of the butter with the oil in a large non-stick frying pan over a medium heat. Season the rabbit portions on all sides with salt and freshly groun black pepper. Fry the rabbit in 2-3 batches, until golden-brown, turning occasionally. Transfer to a large flameproof casserole dish.",
        "Fry the bacon pieces in the same frying pan for 4-5 minutes or until the fat is crisp. (Add a little extra oil if necessary.) Scatter over the rabbit. Melt the remaining butter in the pan and gently fry the shallots for 5-6 minutes or until softened, stirring regularly.",
        "Stir the flour into the pan with the shallots and cook for a few seconds before slowly adding the wine and half the stock, stirring constantly until the sauce thickens. Add the mustard, bay leaf and thyme. Bring to a gentle simmer and season with a little salt and plenty of ground black pepper. Pour over the rabbit and bacon. Stir the remaining stock into the pot and bring to a simmer on the hob.",
        "Remove from the heat, cover the surface of the casserole carefully with a sheet of greaseproof paper and cover with a lid. Transfer to the oven and cook for 1¼-2 hours, or until tender. (The meat should be starting to fall off the bone when the rabbit is ready.)",
        "When the rabbit is tender, put the casserole on the hob, remove the lid and stir in the cream and prunes with brandy. Simmer gently for a few minutes until the prunes are hot, stirring carefully so the rabbit doesn’t completely fall apart. Adjust the seasoning to taste."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}