{
    "title": "Rainbow cupcakes",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 24",
    "recommendations": "4",
    "images": [
        
    ],
    "description": "Simple but ever so pretty, these multi-coloured cupcakes are topped with sprinkles and a glacé cherry. Perfect for Red Nose Day bake sales. Equipment and preparation: for this recipe you will need two 12-hole muffin tins and a piping bag fitted with a large star nozzle.",
    "author": {
        "abbey_clancy": "Abbey Clancy"
    },
    "show": {
        "b052sj1d": "The Great Comic Relief Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the rainbow cupcakes": [
            "240g/8½oz plain flour",
            "240g/8½oz golden caster sugar",
            "3 tsp baking powder",
            "pinch of salt",
            "80g/2¾oz unsalted butter, at room temperature",
            "240ml/8½fl oz whole milk",
            "2 medium free-range eggs",
            "½ tsp pure vanilla extract",
            "4 food colourings of your choice (such as red, yellow, green and blue)"
        ],
        "For the vanilla buttercream": [
            "250g/9oz unsalted butter, room temperature",
            "500g/1lb 2oz icing sugar",
            "2 tsp vanilla extract"
        ],
        "To decorate": [
            "multi-coloured hundred and thousands",
            "24 glacé cherries"
        ]
    },
    "steps": [
        "Preheat the oven to 170C/160C Fan/Gas 3. Line two 12-hole cupcake trays with cupcake cases.",
        "For the cupcakes, beat the flour, sugar, baking powder, salt and butter together in a freestanding mixer with a paddle attachment (or use a handheld electric whisk). Mix in half the milk until it is just incorporated.",
        "In a separate bowl, whisk the eggs, vanilla extract and remaining milk together. Pour into the flour mixture and beat until the mixture is smooth.",
        "Divide the batter equally between four bowls and colour each one with food colouring, so you end up with four brightly coloured bowls of cake mixture.",
        "Now layer the coloured mixtures in the cupcake cases. Starting with one colour, divide the mixture equally between the cupcake cases and smooth it out so you have a layer at the bottom. Continue with all the other colours in the same way, evenly spreading each layer out and being careful not to mix the colours together, so that you end up with distinct layers of mixture.",
        "Carefully transfer to the oven and bake for 20–25 minutes, or until the sponge bounces back when touched and a skewer inserted into the centre comes out clean.",
        "Leave the cupcakes to cool slightly in the tray before turning out onto a cooling rack to cool completely.",
        "For the vanilla buttercream, beat the butter with a handheld electric mixer until soft. Sift in the icing sugar and incorporate to make a smooth icing. Add the vanilla extract and beat the icing for a further few minutes until light and fluffy. Transfer to a piping bag fitted with a large star nozzle.",
        "When the cupcakes are cold, pipe the vanilla buttercream on top of the cakes and decorate with the hundreds and thousands. To finish, top each cupcake with a glacé cherry to resemble a red nose."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}