{
    "author": {
        "nancy": "Nancy Birtwhistle"
    },
    "cookTime": "less than 10 mins",
    "cusine": "French",
    "description": "How do you top an almond croissant? Add a shot of tart, pink raspberry powder. Perfect with a latte on a Sunday morning.",
    "dishes": [
        "croissant",
        "icing",
        "oven-baked_dishes",
        "prepare-ahead_desserts",
        "sausage"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the dough": [
            "160g/5¾oz unsalted butter, 120g/4¼oz chilled and 40g/1½oz at room temperature",
            "250g/9oz strong white flour",
            "10g/⅓oz powdered milk",
            "30g/1oz caster sugar",
            "7g salt",
            "8.5g fast-action dried yeast"
        ],
        "For the raspberry and almond filling": [
            "30g/1oz ground almonds",
            "2 drops almond extract",
            "30g/1oz caster sugar",
            "30g/1oz icing sugar, plus extra for dusting",
            "1 tbsp raspberry powder",
            "1 large free-range egg yolk",
            "1 large free-range egg, beaten"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "",
    "serves": "Makes 12 small croissants",
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "steps": [
        "Prepare the chilled butter by placing it between two sheets of greaseproof paper and banging with a rolling pin until you have a 8x15cm/3¼x6in rectangle about 1cm/½in thick. Put this back in the fridge.",
        "Place the room temperature butter, strong white flour, powdered milk, caster sugar, salt and 150ml/5½fl oz water into the bowl of a freestanding mixer fitted with a dough hook. Mix on a low setting until combined. Pour in the yeast and continue to mix on low speed for five minutes, then turn up the speed to medium and continue mixing for another 5-7 minutes.",
        "Tip the dough out of the bowl and bring it together into a smooth ball, then place in a greased, non-metallic bowl and set aside, covered, for 15 minutes.",
        "Transfer the bowl to the microwave and heat at 100 watts for six minutes then leave to rest for another 10 minutes. Alternatively, prove the dough in a warm room for a further 45 minutes, or until doubled in size.",
        "Tip the risen dough out onto a worktop then roll out into a 18x25cm/7x10in rectangle about 1cm/½in thick.",
        "Transfer to a baking sheet lined with baking parchment, cover with cling film and place in the freezer for 10 minutes.",
        "Remove the dough from the freezer and place the rolled block of chilled butter in the centre of the rectangle. Fold the top third over the butter then the bottom third up over the top. Roll out into a 18x25cm/7x10in rectangle about 1cm/½in thick, turn the dough 90 degrees and repeat the folding and rolling process again.",
        "Fold the dough back into thirds and place back into the freezer for 15 minutes. Roll out again and this time fold into quarters – folding each short edge into the centre, then closing it up like a book. Roll out again, then repeat this double-fold once more and freeze the dough for another 15 minutes.",
        "Wrap the dough in cling film and set aside in the fridge.",
        "For the raspberry and almond filling, place the almonds, almond extract, sugars, and raspberry powder into a bowl. Mix with a spoon, adding enough egg yolk to bind to a paste. Tip the paste onto the work surface, then roll 12 sausages about a 0.5cm/¼in thick and 5cm/2in long and place on a plate in the fridge.",
        "Roll out the dough into a rectangle approximately 40x30cm/16x12in. Cut it down the centre lengthwise then cut six triangles from each strip (the triangles will be approximately 10cm/4in wide at the base). Place a sausage of raspberry almond filling along the long edge of the triangle, and roll each croissant up.",
        "Place onto a baking tray lined with baking parchment and leave to prove for one hour.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "When ready to bake, brush the top of the pastries with beaten egg and bake for 8-10 minutes, or until golden-brown. Remove from the oven and allow to cool for five minutes on the tray before transferring to a wire rack.",
        "When cool, sift some icing sugar over the raspberry and almond croissants and serve."
    ],
    "tips": [
        "This recipe uses a microwave to speed-up the process of proving dough. For this to work you need a microwave which can operate on a very low power. To test yours, heat a large knob of chilled butter on the lowest setting for two minutes. If the butter is softened, your microwave can be used for proving, but if the butter is completely melted it's too powerful to use in this way."
    ],
    "title": "Raspberry and almond croissants",
    "videos": "[]"
}