{
    "title": "Raspberry marinated rack of lamb",
    "cookTime": "over 2 hours",
    "prepTime": "overnight",
    "serves": "Serves 4",
    "recommendations": "6",
    "images": [
        
    ],
    "description": "This roast rack of lamb with a difference sees the meat infused with a berry-and-herb sauce.",
    "author": {
        "gregg_wallace": "Gregg Wallace"
    },
    "show": {
        "b016pbs9": "Great British Food Revival"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "350ml/12½fl oz vegetable bouillon",
            "300g/10½oz fresh raspberries",
            "4 tbsp raspberry jam",
            "2 tbsp red wine vinegar",
            "1 x 1.4kg/3lb rack of lamb (approx. 3-4 ribs per person)",
            "½ tsp dried rosemary"
        ],
        "To serve": [
            "new potatoes",
            "steamed green vegetables"
        ]
    },
    "steps": [
        "Blend the vegetable bouillon, raspberries, raspberry jam, and red wine vinegar in a food processor until smooth. Transfer the mixture to a large bowl and set aside until needed.",
        "Heat a large, non-stick frying pan over a medium to high heat. When the pan is hot, sear the rack of lamb for a few seconds until lightly browned on all sides, then remove from the pan.",
        "Using a sharp knife, pierce the meat several times all over. Add to the bowl of raspberry marinade, then cover the meat with the marinade using your hands. Cover the bowl with cling film and marinate in the fridge for at least 12 hours, turning occasionally.",
        "When the lamb has marinated, preheat the oven to 175C/350F/Gas 4.",
        "Remove the lamb from the marinade and pat dry using kitchen roll.",
        "Suspend the lamb on a rack over a shallow roasting tin. Roast for one hour (for rare), one hour 15 minutes for medium, or until cooked to your liking.",
        "While the lamb is roasting, transfer the marinade to a saucepan and bring to the boil, then add the rosemary. Continue to boil over a medium to high heat for 8-10 minutes, or until the volume of sauce has reduced by one-third and the sauce has thickened slightly.",
        "To serve, carve the raspberry-marinated rack of lamb into individual cutlets. Arrange the cutlets on four serving plates, spooning over the raspberry sauce. Serve with new potatoes and green vegetables."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}