{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "no cooking required",
    "description": "",
    "dishes": [
        "cake",
        "icing",
        "mousse"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "To serve": [
            "75g/2¾oz icing sugar",
            "100ml/3½fl oz peach schnapps",
            "225g/8oz fresh raspberries",
            "double cream, whipped until soft peaks form when the whisk is removed"
        ],
        "default": [
            "3 large ready-made Madeira cakes",
            "150ml/5fl oz brandy",
            "250ml/9fl oz fresh orange juice",
            "180g/6oz butter, softened",
            "180g/6oz sugar",
            "180g/6oz ground almonds",
            "180ml/6oz double cream, whipped until stiff peaks form when the whisk is removed",
            "400g/14oz frozen raspberries, thawed"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "",
    "serves": "Serves 8-12",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "Line a 1.5 litre/2 pints 13fl oz round-bottomed bowl/basin with cling film.",
        "Trim the crusts from the Madeira cake and cut into thin slices.",
        "Place the brandy and orange juice into a bowl and mix well.",
        "Dip the cake slices into the fruit juice and brandy mixture, then use to line the inside of the basin until all the inside is covered. You should have some cake left over to finish the pudding later.",
        "Place the butter and sugar into a clean bowl and beat together until completely combined.",
        "Add the almonds, a little at a time (be careful so the mix doesn't split), mixing continuously.",
        "Fold in the whipped cream, then add the thawed raspberries.",
        "Add the mixture to the inside of the cake-lined bowl.",
        "Cover with the remaining cake slices and place into the fridge to chill overnight.",
        "Sieve the icing sugar into a bowl and add the schnapps. Add the fresh raspberries and leave to macerate for at least one hour.",
        "To serve, carefully turn the cake out onto a large plate and gently remove the cling film.",
        "Cut out generous wedges of the cake and place onto plates. Spoon the macerated fruit alongside and add a dollop of cream."
    ],
    "tips": [
        
    ],
    "title": "Raspberry mousse cake",
    "videos": "[]"
}