{
    "title": "Raspberry shortcake",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "To make the toasted breadcrumbs for this recipe, chop up 70g/3oz bread (to include crusts) and spread on a baking sheet. Bake in a preheated 150C/300F/Gas 2 oven for 30 minutes or until lightly toasted; then process to crumbs in a food processor.",
    "author": {
        "jeremy_lee": "Jeremy Lee"
    },
    "show": {
        "b0071y6r": "Great British Menu"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the shortcake": [
            "125g/4½oz unsalted butter, softened",
            "40g/1¾oz caster sugar",
            "1 tsp finely grated orange zest",
            "170g/6oz plain flour",
            "40g/1¾oz blanched best-quality almonds, freshly ground (quite fine but still with some texture)",
            "40g/1¾oz toasted white breadcrumbs (see note above)"
        ],
        "For the raspberries": [
            "250ml/9fl oz double cream",
            "a large bowl of raspberries",
            "a small bowl of caster sugar",
            "a little icing sugar, for sifting"
        ]
    },
    "steps": [
        "Beat the butter and sugar together well until pale. Add the orange zest and beat very well. Add the flour, ground almonds and breadcrumbs, and mix thoroughly into a soft dough.",
        "Place a large piece of baking parchment onto a work surface. Place the dough at one end of the paper, then roll it in the paper to make a sausage shape roughly 5cm/2in in diameter. Seal the sausage in the paper and chill overnight.",
        "Preheat the oven to 170C/340F/Gas 3.",
        "Line a large baking sheet with baking parchment. Cut the roll of shortcake dough into slices the thickness of a one-pound coin and lay them on the baking parchment. Bake for 12-15 minutes or until golden-brown. Leave the shortcake to cool and become crisp. Choose the 12 best shortcakes and store the rest for another time.",
        "When ready to serve, whip the cream to soft peaks. Apply a comma-shaped swirl of cream onto each of four plates (this helps stop the shortcake sliding around) and sit a shortcake on top. Spoon on a generous spoonful of cream and heap with a few raspberries, then sprinkle a little caster sugar over. Apply another small spoonful of cream and place another shortcake on it. Repeat with more cream, a few more raspberries and another little blob of cream, then place the last shortcake on top and add a dusting of icing sugar. Repeat this process to make four shortcake stacks. (If your raspberries aren't quite sweet enough, layer the shortcakes with a mix of half cream and half custard instead of all cream, adding a touch of vanilla extract and lemon juice to taste.)"
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}