{
    "title": "Raspberry, basil and clotted cream summer fruit pudding with basil crisp",
    "cookTime": "less than 10 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Easy summer puddings, in individual portions, with clotted cream on the inside. Summer heaven. Equipment and preparation: You will need four small dariole moulds.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "800g/1lb 12oz raspberries",
            "4-5 tbsp icing sugar",
            "12-14 thin slices white bread",
            "2 tbsp basil leaves, torn into small pieces",
            "8 tbsp clotted cream",
            "8 basil leaves",
            "115g/4oz caster sugar"
        ]
    },
    "steps": [
        "Blend 600g/1lb 5oz of the raspberries with the icing sugar in a blender, to a purée.",
        "Strain the raspberry purée through a fine sieve into a bowl – check the sweetness of the raspberries and add more sugar if needed.",
        "Remove the crusts from the bread and stamp out four small circles to fit the bottom of four small dariole moulds.",
        "Stamp out four larger circles to cover the top.",
        "Cut the remainder of the bread slices into strips the height of the moulds.",
        "Lightly oil the inside of each mould, then line with cling film.",
        "Dip one side of the small bread circles in the raspberry purée and place in the bottom of the mould, dipped side against the mould.",
        "Repeat with the bread strips around the side of the mould, overlapping them slightly.",
        "Stir 150g/5½oz of the remaining raspberries into the purée, then add the torn basil leaves and stir again.",
        "Half-fill the moulds with the raspberries in the purée then add a spoonful of clotted cream.",
        "Fill to the top with raspberries and purée and press down well.",
        "Dip one of the larger rounds of bread in the raspberry purée and place on top of the mould, raspberry side down.",
        "Place the summer puddings in the fridge until ready to serve.",
        "To make the basil crisp, cover a microwaveable plate with cling film, brush the cling film with a little oil, then lay the basil leaves on top and cover with more cling film.",
        "Microwave on high for one minute then leave to cool for 30 seconds. Carefully peel the cling film off the basil leaves.",
        "Place the sugar into a frying pan and heat gently until melted. Then cook without stirring until it turns a golden caramel colour. Be careful, as caramel is extremely hot. Immediately place the bottom of the pan into cold water (either in the sink or a larger pan) to stop the caramel cooking further.",
        "Line a baking tray with parchment, or silicone paper and place a spoonful of caramel onto the paper, drawing the spoon away to create a tail.",
        "Repeat with the rest of the caramel to create little lollipops. Leave to cool until set hard.",
        "To serve, turn the summer puddings out onto a plate and garnish with any remaining raspberry purée, the reserved raspberries, a basil leaf, more clotted cream and the lollipop."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}