{
    "title": "Raspberry and pistachio éclairs",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Makes 24 éclairs",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/raspberry_and_pistachio_61368_16x9.jpg"
    ],
    "description": "If you aren't up to the challenge of Paul's choux pastry tower, you can still enjoy the same gorgeous flavours in these easier éclairs.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the choux pastry": [
            "100g/3½oz unsalted butter, cut into roughly 1cm/½in cubes",
            "pinch of salt",
            "130g/4½oz very strong white bread flour",
            "2 large free-range eggs, beaten"
        ],
        "For the pistachio crème pâtissière": [
            "400ml/14fl oz full-fat milk",
            "2 tbsp pistachio paste",
            "100g/3½oz caster sugar",
            "4 large free-range egg yolks",
            "40g/1½oz cornflour",
            "40g/1½oz butter, cubed"
        ],
        "For the raspberry crème pâtissière": [
            "400ml/14fl oz full-fat milk",
            "2 tbsp freeze-dried raspberry powder",
            "100g/3½oz caster sugar",
            "4 large free-range egg yolks",
            "40g/1½oz cornflour",
            "40g/1½oz butter, cubed"
        ],
        "For the icing": [
            "250g/9oz fondant icing sugar, sifted",
            "1 tsp raspberry liqueur (such as Chambord)",
            "¼ tsp almond extract",
            "pink food colouring paste",
            "green food colouring paste"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/200C Fan/Gas 7. Line 2 baking sheets with baking parchment. On the first sheet draw 12 x 9cm/3½in lines spaced well apart. Turn the paper over so the pencil marks are underneath but can be seen, to use as a template.",
        "Put the butter, salt and 250ml/9fl oz water into a large saucepan. Heat gently until the butter has melted, then bring to the boil. (Don’t let the liquid boil for any length of time, or you will drive off too much moisture.) Immediately remove from the heat and tip the flour into the pan. Beat with a wooden spoon to form a smooth ball of dough that leaves the sides of the pan clean.",
        "Now vigorously beat the egg into the hot dough, a little at a time. This takes some elbow grease! As you add the egg, the dough will become stiff and glossy. Stop adding the egg if the dough starts to become loose (though you should use up all or most of it).",
        "Spoon the mixture into a piping bag fitted with a 12mm/½in plain nozzle. Pipe the mixture onto the templates on the baking sheets.",
        "Bake for 10 minutes, then reduce the oven temperature to 190C/170C Fan/Gas 5 and bake for a further 25-30 minutes until dark golden-brown. When baked, the pastry should be crisp and dry. As soon as you remove it from the oven, transfer to a cooling rack and pierce each éclair gently with a skewer (this allows steam to escape and stops the pastry becoming soggy). Put the choux on wire racks to cool completely.",
        "For the pistachio crème pâtissière, pour the milk into a pan, add the pistachio paste and bring to the boil, then remove from the heat.",
        "Whisk the sugar, egg yolks and cornflour together in a large bowl. Pour a little of the hot milk onto the egg mixture, whisking continuously. Whisk in the rest of the hot milk until well combined, then return to the pan. Cook the mixture over a gentle heat, stirring continuously, until the mixture thickens.",
        "Remove from the heat and pass the mixture through a sieve into a clean bowl. Beat in the butter until melted. Leave to cool, cover the surface with cling film to prevent a skin forming and chill. When cool, spoon into a piping bag fitted with a long thin nozzle.",
        "For the raspberry crème pâtissière, pour the milk into a pan, add the raspberry powder and bring to the boil, then remove from the heat.",
        "Whisk the sugar, egg yolks and cornflour together in a large bowl. Pour a little of the hot milk onto the egg mixture, whisking continuously. Whisk in the rest of the hot milk until well combined, then return to the pan. Cook the mixture over a gentle heat, stirring continuously, until the mixture thickens.",
        "Remove from the heat and pass the mixture through a sieve into a clean bowl. Beat in the butter until melted. Leave to cool, cover the surface with cling film and chill before using. When cool, spoon into a piping bag fitted with a long thin nozzle.",
        "Make a small hole in each piece of choux. Fill half of the éclairs with the pistachio crème pâtissière and the remaining half with raspberry crème pâtissière.",
        "For the icing, add enough water to the fondant icing sugar to make a very stiff icing. Divide the mixture into 2 bowls. Add the raspberry liqueur to one bowl and a tiny amount of pink food colouring paste to make a pale pink icing. Add the almond extract to the other bowl and a tiny amount of green food colouring paste to make a pale green icing.",
        "Spoon the icing into 2 separate disposable piping bags and snip off the ends. Pipe the pink icing onto the raspberry filled éclairs and the green icing onto the pistachio filled éclairs. Smooth with a palette knife and allow to set.",
        "For best results serve the éclairs immediately. They can be stored in the fridge for an hour but the pastry will start to absorb moisture from the filling and become soggy."
    ],
    "howTos": [
        "making_choux_pastry"
    ],
    "videos": "[]"
}