{
    "title": "Ravioli of crab and scallop with a spiced prawn sauce",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 2",
    "recommendations": "17",
    "images": [
        
    ],
    "description": "This homemade pasta is stuffed with seafood and served with a rich brandy-flavoured sauce.",
    "author": {
        "john_torode": "John Torode"
    },
    "show": {
        "b006t1k5": "MasterChef"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pasta": [
            "250g/9oz '00' pasta flour",
            "pinch salt",
            "2 free-range eggs",
            "3 free-range egg yolks",
            "dash olive oil"
        ],
        "For the spiced prawn sauce": [
            "1 tbsp olive oil",
            "1 carrot, chopped",
            "1 celery stick, chopped",
            "1 small leek, chopped",
            "3 star anise",
            "½ red chilli",
            "1 thumb ginger, chopped",
            "1 stalk lemongrass",
            "1 tomato, chopped",
            "400g/14oz shell on prawns, roughly chopped",
            "50g/1¾oz rice",
            "50ml/2fl oz brandy",
            "500ml/18fl oz chicken stock",
            "crème fraîche, to finish"
        ],
        "For the ravioli stuffing": [
            "225g/8oz white crab meat",
            "50g/1¾oz parsley, chopped",
            "1 red chilli, chopped",
            "25g/1oz fresh tarragon, chopped",
            "1 tbsp single cream",
            "salt and freshly ground black pepper",
            "2 scallops, cut into thirds",
            "1 free-range egg, beaten for egg wash"
        ],
        "To garnish": [
            "spring onions, chopped",
            "red chillies, chopped"
        ]
    },
    "steps": [
        "To make the pasta, place the flour and salt in a food processor. Gradually add the eggs, yolks, oil, and a dash of water, if needed, until combined into a dough that is not sticky. Remove from the processor, knead for five minutes then shape into a round ball. Wrap in cling film then transfer to the fridge to rest for 20 minutes.",
        "For the spiced prawn sauce, in a saucepan heat the olive oil and fry the carrot gently without colouring it, then add the celery and leek and fry until lightly browned. Add the star anise, chilli, ginger, lemongrass and tomato. Once really browned, add the prawns and continue to fry.",
        "Add the rice and brandy. Stir, allow to heat briefly, then to flambé, slowly tilt the pan towards the flame, or light with a match. Let the flames flare up then die down. (CAUTION: Keep your face and hair away from the flames. Do not leave unattended.) Cover with chicken stock and cook for 20 minutes.",
        "Pass through a sieve into a clean saucepan.",
        "For the ravioli stuffing, mix together all the ingredients apart from the scallops and egg wash. Season to taste with salt and freshly ground black pepper.",
        "Roll out the pasta dough into two thin sheets and brush with egg wash. Place each slice of scallop evenly spaced on one sheet and top each one with a spoonful of the stuffing mix. Lay the second sheet over the top and press gently to seal the filling. Using a cutter, cut out 6cm/2½in fluted rounds, making sure there are no air bubbles trapped in the parcels.",
        "When ready to serve, bring a large pan of water to the boil, add the ravioli and cook a few at a time. Cook for 1-2 minutes or until they float to the surface. Drain and place on serving plates.",
        "Stir a little crème fraîche into the sauce and spoon over the ravioli. Garnish with spring onions and chillies."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}