{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "less than 10 mins",
    "description": "Razor clams are great sponges for flavour and are elevated in this recipe by a delicious crunchy crumb.",
    "dishes": [
        "bread",
        "gratin",
        "jam",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "16 razor clams, rinsed",
            "75ml/3fl oz white wine",
            "3 tbsp finely chopped chives",
            "3 tbsp fresh breadcrumbs",
            "2 tbsp finely grated manchego cheese",
            "150ml/5fl oz olive oil",
            "2 shallots, finely diced",
            "1 garlic clove, finely chopped",
            "2 tomatoes, skinned, seeded, diced",
            "2 tbsp chopped fresh tarragon",
            "1 tbsp chopped fresh chervil",
            "½ lemon, juice and zest"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Preheat the grill to high.",
        "Heat a saucepan until hot, add the clams and wine and cover with a lid. Steam the clams for 60 seconds, or until they have opened. Pour the contents of the pan into a colander and drain.",
        "Discard any clams that haven’t opened, then pull the clams from the shells and remove the dark grey part – reserving half the shells.",
        "Rinse the clams to remove any grit, then roughly chop the flesh. Lay the shells onto a baking tray and place the meat back onto both sides of the shells.",
        "Mix together the chives, breadcrumbs and grated cheese until well combined. Cover the clams with this mixture.",
        "Place under the grill for 3-4 minutes, or until golden-brown.",
        "Meanwhile heat a frying pan over a low heat. Add the olive oil, shallots and garlic and warm for one minute. Add the tomatoes and warm through for a further two minutes. Add the herbs, lemon zest and juice, and season to taste with salt and black pepper.",
        "To serve, carefully lay the shells onto the plate in a line then spoon the sauce vierge over the top."
    ],
    "tips": [
        
    ],
    "title": "Razor clam gratin with sauce vierge",
    "videos": "[]"
}