{
    "title": "Razor clams in borage butter with pickled shallots and pine nuts",
    "cookTime": "10 to 30 mins",
    "prepTime": "overnight",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Lightly frying the clams caramelises the outside for an attractive finish. Serve them back in their shells with a herb butter and pickled shallots.",
    "author": {
        "jack_stein": "Jack Stein"
    },
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the borage butter": [
            "10g borage",
            "10g chives",
            "10g curly parsley",
            "10g chervil",
            "100g/3½oz unsalted butter",
            "1 tsp lemon juice",
            "pinch salt"
        ],
        "For the pickled shallots": [
            "150ml/5fl oz cider vinegar",
            "25g/1oz sugar",
            "15g/½oz salt",
            "2 shallots, thinly sliced into rings",
            "pinch fresh thyme leaves",
            "1 star anise",
            "3 juniper berries",
            "3 black peppercorns",
            "12 razor clams",
            "50ml/2fl oz vegetable oil, for frying"
        ],
        "To garnish": [
            "15g toasted pine nuts",
            "12 borage flowers"
        ]
    },
    "steps": [
        "For the borage butter, blanch all of the herbs in boiling water for 20 seconds and refresh in a bowl of ice-cold water.",
        "Drain the herbs thoroughly and put them into a food processor with the butter and blend. Add a squeeze of lemon juice and a pinch of salt.",
        "Wrap the butter in cling film and roll into a ballotine (a sausage shape) and tie the ends. Place into the fridge for at least an hour (overnight is preferable).",
        "For the pickled shallots, put the cider vinegar into a pan with the sugar and salt. Add the shallots, thyme, star anise, juniper berries and black peppercorns. Bring to a boil before taking off the heat. Set aside to cool.",
        "For the clams, preheat the oven to 220C/425F/Gas 7.",
        "Clean the clam shells in cold running water. Discard any open clams that do not close when given a sharp tap.",
        "Put the clams in a pan with 1cm/½in boiling water. Put the lid on the pan and let the clams steam for three minutes.",
        "Take the clams out of the pan. Throw away any that have not opened. Remove the opened clams from their shells. Clean the shells and keep them for serving.",
        "Fry the clams in a splash of vegetable oil on one side until a light golden-brown colour. Flip onto the other side for a quick flash fry.",
        "Cut off the ends and the brown ‘stomach’. Add a pinch of salt.",
        "Place a slice of the herb butter into each clam shell. Put the clams on top of the butter.",
        "Put the clams and shells into the preheated oven until the butter has melted (approximately 30 seconds).",
        "To serve, arrange the clams on a plate. Place a few pickled shallots on the clams and garnish with pine nuts and borage flowers."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}