{
    "title": "Red prawn express",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This recipe will take some organising (prawns are steamed through ‘apple vapour’ pushed through a home espresso machine). But there’s no doubt that you’ll have something interesting to talk about over dinner. Equipment and preparation: you will need a piece of clean cheesecloth or muslin, a sheet of clean cut glass and a home espresso machine.",
    "author": {
        "elena_arzak": "Elena Arzak"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "Apple skins can be dried in a a dehydrator, according to manufacturer's instructions."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the langoustines": [
            "12 langoustines",
            "salt and pepper",
            "2 tbsp chopped parsley leaves",
            "2 tbsp chervil leaves",
            "2 tbsp dill",
            "25ml/1fl oz olive oil",
            "2 tsp ground ginger",
            "80g/3oz spring onions, sliced"
        ],
        "For the apple vapour": [
            "100g/3½oz dried Braeburn apple skins",
            "1 litre/1¾pints Braeburn apple juice mixed with water"
        ],
        "To serve": [
            "almond oil",
            "pansies (make sure they are organic and edible)",
            "fried bread croûtons"
        ]
    },
    "steps": [
        "For the langoustines, season the langoustines with salt and pepper. Place them in a suitable container for marinating and mix them with the remaining ingredients. Cover with cling film and set aside.",
        "For the apple vapour, add the apple skins to the fresh juice and leave to stand for 2-3 minutes. Pass this through a fine sieve lined with a clean sheet of muslin. Pour the infusion into the water tank of a home espresso machine. Make a hole in the cling film of the langoustine dish big enough to fit the steamer nozzle through and turn the steamer on. Steam the langoustines in the apple vapour. Set aside any juices from the cooking process.",
        "To serve, put a few drops of almond oil in the bottom of a shallow serving bowl along with the steamed langoustines and any juices they might have released. Place the flowers and croûtons on top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}