{
    "title": "Red nose cake",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8-10",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "A red velvet cake spectacularly layered with cream cheese frosting and topped with red noses. Who wouldn’t donate for this beauty?",
    "author": {
        "claudia_winkleman": "Claudia Winkleman"
    },
    "show": {
        "b01q9tbm": "The Great Comic Relief Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "200g/7oz self-raising flour",
            "50g/2oz cocoa powder",
            "200g/7oz unsalted butter, softened",
            "200g/7oz caster sugar",
            "3 free-range eggs, lightly beaten",
            "1 tsp red food colouring gel",
            "2 tsp vanilla extract",
            "175ml/6oz buttermilk",
            "1 tsp cider vinegar"
        ],
        "For the icing and decoration": [
            "125g/4½oz unsalted butter, softened",
            "175g/6oz cream cheese, softened",
            "500g/1lb 2oz icing sugar, sifted",
            "250g/9oz red fondant icing"
        ]
    },
    "steps": [
        "Preheat the oven to 170/325F/Gas 3. Grease and line three 18cm/7in cake tins (or use cake liners).",
        "In a bowl, sift together the flour and the cocoa powder. Set aside.",
        "Cream the butter and sugar in a free-standing mixer until the mixture is very pale, light and fluffy.",
        "Add one-third of the beaten egg, still beating, and then add one tablespoon of the flour mixture. Repeat with another third of the egg and a little more of the flour mixture. Add the remaining egg, then beat in the remaining flour mixture, with the food colouring and vanilla.",
        "Finally stir in the buttermilk and couple of drops of the vinegar.",
        "Spoon immediately into the prepared tins and bake in the oven for 20 minutes or until springy to the touch.",
        "Meanwhile make the cream cheese frosting. Place the softened butter and cream cheese into the bowl of a free-standing mixer and beat until thoroughly combined, soft and fluffy. Gradually add the sifted icing sugar until the mixture is well-combined. Set aside for at least 15 minutes in a cool place until beginning to set.",
        "Remove the cakes from the oven and allow to cool in the tins for five minutes before turning out onto a wire rack to cool completely.",
        "Using the red fondant icing, roll 12 balls about 2cm/1in in diameter. Set aside.",
        "When the cake is completely cool, spread one-third of the icing between each layer of the cake and the final third on top. Arrange the red noses on the top and serve."
    ],
    "howTos": [
        "creaming",
        "how_to_line_a_round_cake_tin",
        "testing_to_see_if_a_cake_is_cooked"
    ],
    "videos": "[]"
}