{
    "title": "Red mullet with linguine tossed in chilli and garlic",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "13",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/red_mullet_with_linguine_53307_16x9.jpg"
    ],
    "description": "Fresh pasta with red mullet, garlic and chilli - a beautiful fresh dish for spring and summer.",
    "author": {
        "angela_hartnett": "Angela Hartnett"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pasta dough": [
            "300g/10½oz Italian ‘00’ flour",
            "3 free-range eggs",
            "1 tbsp olive oil",
            "pinch salt"
        ],
        "For the sauce": [
            "4 tsp finely sliced red chilli",
            "4 tsp finely sliced garlic",
            "125ml/4fl oz white wine",
            "125ml/4fl oz fish or vegetable stock",
            "4 whole red mullet, filleted, pin boned and cut into strips",
            "2 tbsp flatleaf parsley",
            "1 tbsp basil leaves",
            "1 lemon, zest only",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "For the pasta, blend the flour and eggs in a food processor to fine crumbs, then add the olive oil and salt and pulse to just combine.",
        "Remove the mixture from the processor, and pull the dough together into a ball. Knead the dough until smooth.",
        "Wrap the pasta dough in cling film and rest in the fridge for 30 minutes.",
        "Once rested, take the dough out of the fridge and roll out to about 1cm/½in thick.",
        "Pass the rolled dough through a pasta machine, starting with the widest setting, and reducing the setting each time until on the finest setting.",
        "Change to the linguine cutter on the pasta machine and pass the pasta through once more.",
        "Weigh out about 35g/1¼oz of pasta per person.,Hang the remaining pasta over the back of a chair and allow to dry.",
        "For the sauce, heat a frying pan until hot, add the olive oil, chilli and garlic and gently fry until just softened.",
        "Add the red mullet and gently fry for a couple of minutes, then add the white wine and cook until the volume of liquid has reduced.",
        "Add the stock to the mullet and cook until reduced again.",
        "Meanwhile, bring a pan of salted water to the boil, add the pasta and cook until it floats to the surface and is just tender.",
        "Drain the pasta and stir straight into the sauce.",
        "Finish with the herbs and lemon zest then season with salt and freshly ground black pepper."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}