{
    "title": "Regina’s chicken noodle soup",
    "cookTime": "over 2 hours",
    "prepTime": "overnight",
    "serves": "Serves 6-8",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "This comforting winter broth is the perfect antidote to Christmas excess. Serve alongside dumplings or matzo balls - or both!",
    "author": {
        "regina_waldman": "Regina Waldman"
    },
    "show": {
        "b05y38pk": "Nigel Slater: Eating Together"
    },
    "tips": [
        "This dish involves boiling a whole chicken for the broth, make sure this chicken does not go to waste by using it in another dish such as Spanish chicken and rice."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1 whole chicken, jointed",
            "2 onions, peeled and left whole",
            "5 carrots, roughly chopped",
            "2 sweet potatoes, roughly chopped",
            "4 celery stalks, trimmed, roughly chopped",
            "1 leek, trimmed, roughly chopped",
            "½ swede, roughly chopped",
            "3 chicken stock cubes",
            "1 beef stock cube",
            "1 bay leaf",
            "300g/10½oz vermicelli",
            "1 x 230g tin butter beans",
            "salt and white pepper"
        ]
    },
    "steps": [
        "Place the chicken pieces, all of the chopped vegetables, the stock cubes and the bay leaf into a large, heavy-based saucepan. Fill the pan with water and bring to the boil. Season generously with salt and freshly ground black pepper.",
        "Reduce the heat until the mixture is simmering gently. Partly cover with a lid and simmer for 3½ hours, stirring occasionally and skimming the fat from the surface of the liquid once every hour using a slotted spoon.",
        "Strain the soup and discard everything but the strained liquid. Cover, set aside until cool, then chill in the fridge overnight.",
        "The following day, the soup will have turned to jelly. Warm the soup to melt the jelly and skim the fat from the surface once more.",
        "Meanwhile, cook the vermicelli in a pan of salted, boiling water according to the packet instructions. Drain well.",
        "Cook the butterbeans in a separate pan of boiling water for 3-4 minutes, or until tender. Drain well.",
        "To serve, divide the noodles and butterbeans equally among 6-8 serving bowls. Ladle over the warm chicken broth."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}