{
    "title": "Rhubarb and custard tarts",
    "cookTime": "over 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Makes 4 individual tarts",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "Grenadine adds sweetness and a lovely pink colour to the rhubarb, but if you want to avoid alcohol you can use pomegranate juice instead. Equipment and preparation: for this recipe you will need four 10cm/4in tart rings.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the sweet pastry": [
            "125g/4½oz unsalted butter",
            "225g/8oz plain flour",
            "20g/¾oz caster sugar",
            "1 medium free-range egg"
        ],
        "For the custard": [
            "750ml/1⅓ pints double cream",
            "2 vanilla pods, slit in half lengthways and seeds scraped out",
            "100g/3½oz sugar",
            "4 medium free-range eggs"
        ],
        "For the baked rhubarb": [
            "500g/1lb 2oz medium-sized rhubarb",
            "50ml/2fl oz grenadine",
            "100g/3½oz caster sugar",
            "1 orange, juice only",
            "2 tbsp orange marmalade",
            "clotted cream, to serve"
        ]
    },
    "steps": [
        "For the sweet pastry, preheat the oven to 170C/340F/Gas 3.",
        "In a bowl or a food processor, rub the butter and flour together. Add the sugar and egg and mix until the dough comes together.",
        "Wrap the dough in cling film and use your hands to compress into a flat circle shape, this will make it easier to roll out later. Chill the dough for an hour.",
        "Remove the cling film and roll out the pastry to 5mm/¼in thick. Line the four tart cases with pastry, leaving some over-hanging the edge. You can trim the edges after baking.",
        "Scrunch up some baking parchment then use it to line the pastry cases. Fill with baking beans or uncooked rice. Bake for 15-20 minutes, or until the pastry is golden-brown.",
        "For the custard, place the cream, vanilla seeds and pod in a large saucepan and bring to the boil.",
        "Place the sugar and eggs in a large bowl and whisk. Gradually pour the warm cream over the eggs, whisking all the time.",
        "Pour the custard back into the pan and cook until thick enough to coat the back of a spoon, then pass it through a sieve.",
        "Half fill the tart cases with custard. Leave to set in the fridge for at least two hours.",
        "For the baked rhubarb, preheat the oven to 200C/400F/Gas 6.",
        "Place the rhubarb, grenadine, sugar and orange juice in a baking dish. Place in the oven for five minutes or until the rhubarb is tender. Set aside to cool.",
        "Once cooled, cut the rhubarb in 1cm/½in neat pieces and drain on kitchen paper. Reserve any cooking juices.",
        "Once the custard has set, arrange the rhubarb pieces on top, until the pastry case is full.",
        "To make a glaze, heat the marmalade with the rhubarb cooking juices until the volume of liquid has reduced to a thick syrup. Leave to cool slightly and then brush over the rhubarb in the tart. Leave to set out of the fridge.",
        "Serve the finished tarts with a spoonful of clotted cream and a drizzle of the glaze."
    ],
    "howTos": [
        "how_to_blind_bake_pastry",
        "lining_tin_with_pastry",
        "rubbing_in"
    ],
    "videos": "[]"
}