{
    "author": {
        "brendan_lynch": "Brendan Lynch"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "A moist ginger sponge topped with tangy stewed rhubarb and served with crème anglaise.",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "sauce",
        "sponge_pudding",
        "stew",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the crème anglaise": [
            "1 vanilla pod",
            "250ml/9fl oz of double cream",
            "250ml/9fl oz of full-fat milk",
            "6 free-range eggs, yolks only",
            "75g/2 2/3oz caster sugar"
        ],
        "For the pudding": [
            "200g/7oz rhubarb, chopped into 1½ – 2 cm lengths",
            "2 tbsp blackcurrant cordial",
            "80g/2¾oz caster sugar",
            "1½ tbsp cornflour",
            "150g/5½oz strawberries, hulled and quartered",
            "175g/6oz soft butter",
            "175/6oz caster sugar",
            "3 large free-range eggs",
            "2 tsp ground ginger",
            "175g/6oz self-raising flour",
            "125g/4½oz crystallised ginger, chopped into small pieces"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Makes 6",
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "steps": [
        "Grease six metal pudding moulds and line the bottoms with a small circle of parchment paper.",
        "In a medium-sized pan, cook the rhubarb, blackcurrant cordial and caster sugar over a medium heat and cook for four minutes. Add the cornflour, stir and cook for another minute. Remove from the heat and add the strawberries. Put two to three tablespoons of mixture into the bottom of each mould (approximately a quarter full) and set aside.",
        "Preheat the oven to 180C/350F/Gas 4. Cream the butter and sugar with a whisk until it is pale and smooth. Add the eggs one at time, making sure that each one is fully incorporated before adding the next. Sift in the ground ginger and flour in three stages, making sure the batter is mixed thoroughly. Add in the chopped pieces of crystallised ginger and stir through.",
        "Spoon the mixture into the moulds until they are no more than three quarters full. Place the moulds in a roasting tray and pour hot water in to the tray until half way up the side of the moulds. Transfer the puddings to the oven and bake for 25–30 minutes, or until springy to touch. Then set aside to cool on a rack.",
        "To make the crème anglaise, scrape out the seeds from the vanilla pod. In a pan set over a medium heat bring the vanilla seeds, cream and milk to the boil. In a medium-sized bowl, beat the egg yolks and caster sugar together with a whisk. Gradually pour in the hot milk and whisk to incorporate. Transfer to a clean saucepan and cook over a low heat, constantly stirring until it starts to thicken. As soon as it is thick enough to coat the back of a wooden spoon, strain through a fine sieve into a serving jug.",
        "To serve, run a small sharp knife round the inside of each mould and turn the puddings out onto serving plates. Pour over the crème anglaise."
    ],
    "tips": [
        
    ],
    "title": "Rhubarb and ginger pudding",
    "videos": "[]"
}