{
    "title": "Rhubarb and vanilla clafoutis",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rhubarbandvanillacla_87825_16x9.jpg"
    ],
    "description": "A nice twist on the French classic, add shocking pink stalks of rhubarb to jazz up this tender pudding-cake.",
    "author": {
        "jun_tanaka": "Jun Tanaka"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the filling": [
            "20g/¾oz butter, plus extra to grease the dish",
            "400g/14¼oz forced rhubarb, cut into 5cm/2in pieces",
            "2 tbsp granulated sugar"
        ],
        "For the batter": [
            "1 vanilla pod",
            "150ml/5¾fl oz full-fat milk",
            "150ml/5¾fl oz double cream",
            "5 free-range whole eggs",
            "120g/4¼oz caster sugar",
            "75g/2½oz plain flour"
        ],
        "To serve": [
            "icing sugar, to taste",
            "crème fraîche, to taste"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the filling, melt the butter over a medium heat in a frying pan. Add the rhubarb and one tablespoon of the granulated sugar and fry for two minutes. Remove from the heat and set aside.",
        "For the batter, split the vanilla pod in half with a sharp knife and scrape out the seeds.",
        "In a separate pan, place the milk, cream and vanilla seeds and pod over a medium heat and bring up to simmering point. Remove from the heat, then leave to cool for the flavours to infuse.",
        "Whisk together the eggs in a mixing bowl until light and frothy, add the sugar and whisk until well-blended. Fold in the flour and gradually pour the milk and cream into the mixing bowl, removing the vanilla pod.",
        "Butter a shallow ovenproof dish and lightly sprinkle with the remaining granulated sugar.",
        "Place the rhubarb in the dish, pour in the batter and bake in the oven for 45 minutes, or until golden-brown and firm.",
        "Serve straightaway with a dusting of icing sugar and crème fraîche, to taste."
    ],
    "howTos": [
        "folding",
        "de-seeding_vanilla_pods"
    ],
    "videos": "[]"
}