{
    "title": "Rhubarb and polenta crumble with soured vanilla ice cream",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "matt_tebbutt": "Matt Tebbutt"
    },
    "show": {
        "b0071y6r": "Great British Menu"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the ice cream": [
            "3 medium free-range egg yolks",
            "85g/3oz caster sugar",
            "250ml/9fl oz whole milk",
            "1 vanilla pod, split lengthways",
            "200ml/7fl oz double cream",
            "100ml/3½fl oz crème fraîche"
        ],
        "For the crumble topping": [
            "50g/2oz blanched almonds",
            "60g/2½oz plain flour",
            "40g/1¾oz polenta (medium ground)",
            "50g/2oz caster sugar",
            "pinch salt",
            "2 drops pure vanilla extract",
            "75g/2¾oz chilled unsalted butter, chopped"
        ],
        "For the rhubarb": [
            "200ml/7fl oz ginger wine",
            "75g/2¾oz light soft brown sugar",
            "strip of pared orange zest",
            "250g/9oz young pink rhubarb, cut into 2.5cm/1in batons"
        ]
    },
    "steps": [
        "For the ice cream, whisk the egg yolks and sugar in a bowl and set aside. Pour the milk into a saucepan, scrape in the vanilla seeds and drop in the pods. Infuse the milk with the vanilla by warming gently. Heat the cream in a separate pan.",
        "Add the milk and cream to the egg yolks and sugar. Pour this mixture into a clean saucepan, place over a gentle heat and stir constantly until thickened. Remove from the heat, stir in the crème fraîche and pass through a sieve. Discard the vanilla pods. Leave to cool, before churning in an ice cream machine until thickened (according to manufacturer's instructions). Decant into a clean container and place in the freezer.",
        "For the crumble topping, toast the almonds by tossing them in a heavy pan over a medium heat. Chop finely and mix with the flour, polenta, sugar, salt and vanilla extract. Rub in the chilled butter. Spread out the crumble on a baking tray and chill for about 30 minutes. (Chilling will firm up the crumble so that it will be crisper when baked.)",
        "Preheat the oven to 140C/285F/Gas 1.",
        "Bake the crumble for 40 minutes. Remove from the oven, allow to cool and then crumble into pieces with your hands. Set aside.",
        "For the rhubarb, gently heat the ginger wine with the sugar and orange zest in a large, shallow pan until the sugar has dissolved. Add the rhubarb pieces and poach gently for 3-4 minutes or until soft. Leave the rhubarb to cool in the liquid, then drain the rhubarb thoroughly.",
        "To serve, stand an individual chefs' ring for each crumble on a plate or in a wide, rimmed bowl (the ring should be about 7.5cm/3in in diameter and 3.5cm/11/4in deep). Pack in pieces of rhubarb until the ring is nearly full. Add a generous sprinkling of crumble, before removing the ring. Top each serving with a spoonful of ice cream, or place it on the side of the plate."
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}