{
    "title": "Rhubarb and custard soufflé",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Rhubarb and custard gets a Great British Menu makeover: soufflé made with pudding rice, and coated with biscotti crumbs adds a delicate touch.",
    "author": {
        "phil_howard": "Phil Howard"
    },
    "show": {
        "b0071y6r": "Great British Menu"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the soufflé base": [
            "20g/¾oz butter",
            "55g/2oz pudding rice",
            "250ml/9fl oz milk",
            "250ml/9fl oz double cream",
            "1 vanilla pod, split in half lengthways",
            "45g/1½oz caster sugar",
            "pinch salt"
        ],
        "For the ice cream cone": [
            "2 free-range eggs, whites only",
            "110g/4oz caster sugar",
            "110g/4oz plain flour",
            "30g/1oz melted butter",
            "pinch salt"
        ],
        "For the rhubarb jam": [
            "400g/14oz rhubarb, cut into 3cm/1¼in lengths",
            "100g/3½oz caster sugar",
            "1 strip orange zest"
        ],
        "For the ice cream": [
            "500ml/18fl oz milk",
            "500ml/18fl oz double cream",
            "2 strips orange zest",
            "2 vanilla pods, split lengthways",
            "12 free-range eggs, yolks only",
            "200g/7oz sugar"
        ],
        "To serve the soufflés": [
            "25g/1oz butter, softened",
            "50g/2oz biscotti breadcrumbs",
            "200g/7oz egg whites",
            "80g/2¾oz caster sugar",
            "icing sugar, to dust"
        ]
    },
    "steps": [
        "For the soufflé base, preheat the oven 120C/250F/Gas ½. Melt the butter in an oven-proof pan, add the pudding rice and fry gently for 2-3 minutes. Add the milk, cream, vanilla pod, sugar and a pinch of salt, bring to the boil then turn down the heat and cook at a bare simmer, stirring frequently for 20 minutes, or until the mix is thick.",
        "Cover with a lid and bake the rice in the oven for an hour, stirring every 20 minutes until the mixture has thickened even more. Remove the rice from the oven, transfer to a blender and blend to a smooth pureé.",
        "For the ice cream cone, preheat the oven to 160C/325F/Gas 3. Whisk the egg whites and sugar to form a stiff meringue. In a separate bowl mix the flour, butter and salt to a smooth paste. Fold the egg whites into the flour mix until smooth. Set aside to rest for an hour.",
        "With a spatula, spread the meringue on a non-stick tray into two 10cm/4in discs, about 1mm thick. Bake in the oven for 6-8 minutes or until pale golden-brown. Whilst still hot, carefully lift off the meringue tuilles and wrap them around a cream horn mould, holding tightly until they have set. Remove from the moulds and set aside to cool. Store in an airtight container.",
        "For the rhubarb, preheat the oven to 130C/250F/Gas ½. Toss the rhubarb pieces in a bowl with the sugar and orange zest. Transfer to a baking dish, cover with aluminium foil and bake for 45 minutes, until completely tender. Remove the rhubarb from the oven and allow to sit for an hour.",
        "Transfer the rhubarb to a heavy based pan and cook the rhubarb to a rich jam. Set aside, covered, until needed.",
        "For the ice cream, heat the milk, cream, orange zest and vanilla in a saucepan, and bring up to the boil. Meanwhile, whisk the egg yolks and sugar together, briefly but vigorously, in a mixing bowl. Pour the boiling milk onto the egg yolk mixture, to make a custard, and whisk to incorporate. Return the custard mix to the pan, and cook, stirring continuously, until the custard coats the back of a spoon. Pour the custard through a sieve and set aside to cool.",
        "Churn the custard/ice cream in an ice cream maker base two hours before required, and once churned, immediately fold 150g/5oz of the rhubarb jam through, to create a ripple effect.",
        "For the soufflés, butter two soufflé moulds ensuring a thorough coating. Coat the interior of the moulds with biscotti crumbs and transfer the moulds to the fridge.",
        "Warm through 250g/9oz of the rice pudding purée in a saucepan and place it into a large bowl.",
        "Preheat the oven to 170C/325F/Gas 3.",
        "Whisk the egg whites and as soon as they start to aerate gradually add the sugar and continue whisking until you have a rich, glossy meringue. Fold this into the rice pudding base and finally, fold in 200g/7oz of rhubarb jam. Fill the two soufflé moulds and level the tops with a palate knife. Bake the soufflés for 8-10 minutes or until risen.",
        "Just before serving, transfer a quarter of the ice cream to a piping bag set within a 1cm/½in nozzle and pipe the two meringue cones full of ice cream.",
        "Dust the soufflés with icing sugar and serve with a ball of ice cream in a spoon on the side and each with an ice cream cone."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}