{
    "author": {
        "steven_saunders": "Steven Saunders"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "This tried-and-tested recipe for rhubarb fool is a perfect springtime dessert.",
    "dishes": [
        "biscuit",
        "icing",
        "lemonade",
        "shortbread"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "folding"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rhubarbfoolwithlemon_66051_16x9.jpg"
    ],
    "ingredients": {
        "For the rhubarb fool": [
            "700g/1½lb rhubarb",
            "2 lemongrass stalks very finely chopped to almost a powder",
            "100ml/3½fl oz water",
            "140g/5oz unrefined organic sugar",
            "110g/4oz icing sugar",
            "150ml/¼ pint crème fraîche (preferably organic) or 1 small carton",
            "150ml/¼ pint mascarpone cream",
            "4 tbsp white chocolate, grated or peeled into shavings"
        ],
        "For the rhubarb lemonade": [
            "1 lemon, juice only",
            "1 small glass sweet wine, optional"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "10",
    "serves": "Serves 4",
    "show": {
        "p007b4j1": "Veg Talk"
    },
    "steps": [
        "Wash and trim, but do not peel the rhubarb. Cut into even chunks about 3cm/1¼in long and put into a warm pan with the water, sugar and the lemongrass. Cover and simmer until the rhubarb softens and breaks down - usually this takes about 10 minutes.",
        "Strain through a sieve, reserving all the juices and allow the rhubarb to cool down.",
        "Whisk the icing sugar into the mascarpone, then gently fold in the crème fraîche and half the rhubarb.",
        "Divide the remaining rhubarb among four dishes or glasses and spoon the fool mixture on top. Allow to set and cool in the fridge. Serve with the chocolate shavings on top.",
        "For the rhubarb lemonade, pass the reserved rhubarb liquid through a fine sieve, then add lemon juice to taste. Add the sweet wine if you want to make it alcoholic and chill well in the fridge.",
        "Serve in small iced glasses with the fool and some shortbread biscuits or Tuille biscuits."
    ],
    "tips": [
        
    ],
    "title": "Rhubarb fool with lemongrass",
    "videos": "[]"
}