{
    "author": {
        "chris_fearon": "Chris Fearon"
    },
    "cookTime": "over 2 hours",
    "description": "This dessert for Olympic themed Great British Menu is made to resemble the Olympic Torch, using bronze and gold coloured chocolate. You'll need six A4 acetate sheets and a waffle cone maker, or alternatively you can use shop-bought cones.",
    "dishes": [
        "custard",
        "honeycomb",
        "meringue",
        "mousse",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the honeycomb": [
            "140g/5oz glucose syrup",
            "75g/2½oz good quality honey",
            "400g/14oz caster sugar",
            "10g bicarbonate of soda"
        ],
        "For the ice cream": [
            "260ml/9fl oz milk",
            "260ml/9fl oz whipping cream",
            "6 free-range eggs, yolks only",
            "100g/3½oz caster sugar",
            "260ml/9fl oz Greek style yoghurt"
        ],
        "For the ice cream cones": [
            "60g/2¼oz butter, melted",
            "1 free-range egg",
            "170g/6oz plain flour",
            "170g/6oz sugar",
            "1 tsp baking powder"
        ],
        "For the meringues": [
            "4 free-range eggs, whites only",
            "1 tbsp lemon juice",
            "260g/9oz sugar"
        ],
        "For the rhubarb mousse": [
            "330g/11½oz tinned rhubarb",
            "4 leaves gelatine, soaked in cold water",
            "350ml/12fl oz whipping cream",
            "120g/4oz egg whites",
            "130g/4½oz sugar",
            "60g/2¼oz glucose syrup"
        ],
        "For the white chocolate": [
            "250g/9oz good quality white chocolate buttons",
            "1-2 pinches gold food colouring powder",
            "1-2 pinches bronze food colouring powder",
            "2 tbsp popping candy"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 6",
    "show": {
        "b0071y6r": "Great British Menu"
    },
    "steps": [
        "For the meringues, preheat the oven to 100C/210F/Gas ¼. Whisk the egg whites with an electric whisk on full speed, as soon as they start to turn white add the lemon juice and continue to whisk. As the mixture begins to thicken, slowly sprinkle in the sugar, at a steady speed, until all is incorporated. Transfer the meringue mix to a piping bag with a small plain nozzle. Line a baking tray with parchment paper and pipe little droplets onto the paper. Bake in the oven for 45 minutes. Remove the meringue from the oven, cool, then transfer to an airtight container.",
        "For the rhubarb mousse, place the contents of the tinned rhubarb into a food processor and blend to a purée.",
        "Place half of the purée into a saucepan and heat, stirring with a spoon, but do not boil. Squeeze out the excess water from the soaked gelatine and add to the rhubarb. Remove from the heat and mix until dissolved. Set aside to cool.",
        "Whip the cream just a little, to thicken it only slightly, and place it into the fridge. Using an electric whisk, whisk the egg whites til soft peaks form when the whisk is removed from the bowl.",
        "Place the sugar and glucose into a saucepan and add 50ml/2fl oz water. Heat to 116C/240F (use a thermometer to do this), and stir constantly. Once up to temperature, slowly add the syrup to the egg whites whilst beating, to form an Italian meringue. Carefully fold in the cooled gelatine rhubarb puree and once incorporated, carefully fold in the whipped cream and the remaining half of the purée. Place the mousse mixture into a piping bag with a plain nozzle and leave to set in the fridge for 45-60 minutes.",
        "For the ice cream cones, blend all the ingredients with 250ml/9fl oz water in a food processor to form a fine batter. Heat up the waffle cone maker and pour on enough to cover the base, cook until golden brown then quickly roll with the cone mould provided. Leave to cool.",
        "For the white chocolate, place the buttons into a medium sized microwaveable glass bowl and place into the microwave for 10 seconds on full power then give them a stir, repeat until the chocolate takes on the consistency of a thick custard, this should take about 5-6 minutes in total. Be careful not to overheat the chocolate or it will split.",
        "As soon as the white chocolate is melted in the microwave, pour a very small amount into each of the ice cream cones to seal the bottom.",
        "Split the chocolate into three separate bowls and add the gold food colouring to one, the bronze to another and keep one plain. Spoon two tablespoons of the bronze chocolate onto an acetate sheet, laid out on a chopping board or flat tray, and spread out into a rectangle. Sprinkle with popping candy. Repeat the process with the gold chocolate and then the plain.",
        "With a sharp pointed knife, mark the chocolate into flame like shapes, place another sheet of acetate on top and another chopping board or tray on top of that to weigh it down. Place into the fridge for 25-30 minutes.",
        "Remove one from the fridge and flip it between the two boards so that the top is now the bottom. Begin to peel the acetate away, rolling it into a loose tube, the pieces should start to fall out in the desired shapes. Repeat the process for the remaining two sheets one at a time.",
        "For the honeycomb, place the glucose, honey, sugar and 100ml/3½floz water into a deep-sided, flat based pan, place over a high heat and bring up to 154C/309F. Remove from the heat and add the bicarbonate of soda. Whisk through very fast, being very careful as the liquid will be extremely hot, and transfer to a deep, non-stick tray. Leave to cool, then break into small pieces.",
        "For the ice cream, place the milk and cream into a saucepan and bring up to boiling point. Meanwhile, whisk the egg yolks and caster sugar together until pale, then pour in the hot milk and cream, lightly whisking. Once incorporated, transfer all the mixture back to the pan and cook on a low heat until it coats the back of a wooden spoon, this should take about 8-10 minutes. Remove from the heat and set aside to cool.",
        "Once cool, whisk in the yoghurt and place into your ice cream machine to churn, following the manufacturer’s instructions.",
        "To serve, pipe the rhubarb mousse into the ice cream cones, leaving a 2.5cm/1 in gap at the top. Sprinkle meringue and honeycomb to fill the cone, then pipe more mousse. Finish with a little more honeycomb and meringue, a scoop of ice cream and then push the shards of chocolate into the ice cream."
    ],
    "tips": [
        
    ],
    "title": "The Torch: rhubarb mousse and yoghurt ice cream cones",
    "videos": "[]"
}