{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "French",
    "description": "A thick juicy steak is a real treat and so easy to cook for a dinner party, but here’s how to cook it without having to disappear to the kitchen at the last minute and fill the room with smoke!",
    "dishes": [
        "oven-baked_dishes",
        "sausage"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rib-eye_steak_with_33722_16x9.jpg"
    ],
    "ingredients": {
        "For the butter": [
            "75g/2½oz softened butter",
            "2 banana shallots, finely diced",
            "50g/1¾oz Stilton cheese",
            "1 tbsp finely chopped chives",
            "salt and freshly ground black pepper",
            "6 x 3cm/1¾in thick rib-eye steaks each about 200g/7oz",
            "dash oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "14",
    "serves": "Serves 6",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Melt a knob of the butter in a small pan and cook the shallots over a low heat until softened. Remove from the heat, transfer to a bowl and leave to cool for 10 minutes.",
        "Mash the Stilton with a fork in a bowl and beat in the remaining softened butter and chives. Add the melted butter and shallots and season with salt and black pepper. Mix well.",
        "Place the butter on a sheet of cling film and form into a sausage shape. Roll up in the cling film, twisting the ends to secure. Chill for at least 30 minutes before using.",
        "To cook the steaks, heat a large non-stick frying pan over a high heat. Brush each steak with a little oil and season with salt and freshly ground black pepper. Fry each steak for 1½-2 minutes (or according to thickness) on each side, or until golden-brown. You will need to cook the steaks two or three at a time. Transfer to a baking tray. Set aside to get cold and transfer to the fridge until needed.",
        "To finish the steaks before serving, preheat the oven to 220C/425F/Gas 7. Bake the steaks for six minutes or until piping hot. Add two minutes for medium, and four minutes for medium to well done. Cut six discs from the shallot butter and sit one disc on top of each hot steak and set aside to rest for two minutes before serving."
    ],
    "tips": [
        "Make sure the steak sizzles as soon as it hits the hot frying pan This method works well for any steak of the same thickness, but if using thicker fillet steak, reheat for eight minutes for rare. Add two minutes for medium, and four minutes for medium to well done. Rest the steaks for two minutes before serving."
    ],
    "title": "Rib-eye steak with Stilton butter",
    "videos": "[]"
}