{
    "title": "Rice pudding with rhubarb compôte",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "4",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/ricepuddingwithrhuba_86548_16x9.jpg"
    ],
    "description": "Clotted cream, vanilla and a rhubarb compôte take this school dinner classic to another level.",
    "author": {
        "michael_caines": "Michael Caines"
    },
    "show": {
        "b007yk5b": "Countryfile Summer Diaries"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the rice pudding": [
            "200g/7oz pudding rice",
            "1.2 litres/2 pints of milk",
            "1 vanilla pod, halved",
            "200g/7oz caster sugar",
            "100g/3½oz clotted cream"
        ],
        "For the rhubarb compôte": [
            "100g/3½oz butter",
            "750g/1½lb rhubarb, washed and chopped",
            "100g/3½oz sugar",
            "1 vanilla pod, halved"
        ]
    },
    "steps": [
        "For the rice pudding, bring a pan of water to the boil. Place the pudding rice into the pan and cook for three minutes before draining and rinsing with cold water.",
        "Place the rice, milk, vanilla pod and sugar into a clean pan and bring to the boil. Simmer for 30 minutes, stirring occasionally.",
        "Once the rice is cooked, stir in the clotted cream and leave to cool.",
        "For the rhubarb compôte, melt the butter in a stainless steel pan before adding the chopped rhubarb, sugar and vanilla pod. Gently cook the rhubarb to a purée, stirring occasionally.",
        "Remove the vanilla pod from the purée, scraping the remaining vanilla seeds into the rhubarb before placing the purée into a blender. Blend the mix thoroughly before passing through a fine sieve. Return the purée to a pan and keep warm.",
        "To serve, place a large spoon of the rice pudding into the middle of a large bowl. Make a well in the middle of the rice and spoon in some of the rhubarb compôte."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}