{
    "author": {
        "aaron_craze": "Aaron Craze"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "British",
    "description": "Top oozy rice pudding with sweet strawberries for a comforting dessert. Get kids to help out with mixing the rice pudding ingredients and mashing the strawberries.",
    "dishes": [
        "jam",
        "oven-baked_dishes",
        "rice_pudding",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rice_pudding_with_mashed_26102_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "100g/3½oz pudding rice, rinsed",
            "40g/1½oz caster sugar",
            "750ml/1¼ pint semi-skimmed milk",
            "200g/7oz strawberries"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 150C/130C Fan/Gas 2.",
        "Put the rice in a 1-litre/1¾-pint baking dish, then mix in the sugar and milk. Place the dish on a baking tray and bake for 1¾-2 hours, or until the rice is soft and the mixture thickened with a golden top. Set aside.",
        "Remove the stalks from the strawberries. Rinse the fruit, then put it in a bowl and mash using a fork until almost smooth.",
        "Serve the rice pudding warm with a spoonful of mashed strawberries on top."
    ],
    "tips": [
        "If you don’t have any fruit to mash for the top you can simply add a small spoonful of jam instead. Add dried fruit to the rice pudding before cooking to sweeten the dish naturally. You can replace up to half of the sugar with dried fruits such as finely chopped dates or apricots. Semi-skimmed milk makes for a lower fat rice pudding, but you can replace with whole milk if you prefer. If you’re in a rush you can cook the rice pudding in a saucepan on the hob. Simply bring the mixture to a boil, reduce the heat to low once boiling, cover and leave to cook for 35-40 minutes, stirring now and again."
    ],
    "title": "Rice pudding with mashed fruit",
    "videos": "[]"
}