{
    "title": "Rice pudding with raspberry coulis",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the rice pudding": [
            "150g/5½oz cooked rice",
            "100ml/3½fl oz double cream",
            "1 tbsp caster sugar",
            "30g/1oz butter",
            "½ vanilla pod, split and seeds scraped out"
        ],
        "For the caramel topping": [
            "150g/5½oz caster sugar",
            "290ml/10fl oz warm water"
        ],
        "For the raspberry coulis": [
            "100g/3½oz raspberries",
            "30g/1oz icing sugar",
            "2 tbsp hot water"
        ]
    },
    "steps": [
        "To make the rice pudding, put all the pudding ingredients into a small non-stick saucepan, stir well and cook over a gentle heat for 3 minutes. Discard the vanilla pod and pour into a small ovenproof dish and set aside.",
        "To make the caramel topping, place the sugar in a very clean heavy-based saucepan and pour over the warm water. Brush the sides of the saucepan with a pastry brush dipped in water to rinse away any sugar crystals that may have stuck to the sides. Heat over a low heat, stirring occasionally with a wooden spoon, until all the sugar has dissolved. Turn up the heat and boil until the sugar turns to golden caramel. Dip the base of the pan momentarily in cold water to halt the cooking process, then leave the caramel to stand for a few minutes to allow the caramel to become viscous. Pour a thin zig-zag line of caramel onto the top of the rice pudding and place under the grill for 4 minutes.",
        "To make the coulis, put the raspberries, icing sugar and hot water into a mini blender and blitz until smooth.",
        "To serve, serve the rice pudding with the coulis in a jug on the side."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}