{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "10 to 30 mins",
    "description": "A rice bowl is a wondrous thing, but often – despite the simplicity of its title – a rather cluttered and complicated one. Here, I have pared it back, to make a gorgeously seasoned rice bowl, with nothing more than a few seeds, herbs and radishes stirred through it, and an avocado to top it. It’s a simple take on an inspiringly expansive idea. So please use this as a starting point only. It’s very much a non-recipe recipe, and every time I make it, I add something different, depending on what’s to hand.",
    "dishes": [
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "150g/5½oz short grain brown rice",
            "5cm/2in piece fresh root ginger, peeled",
            "4–6 radishes, cut into quarters or eighths lengthways, depending on their size.",
            "1½ tbsp tamari or soy sauce",
            "1 tsp cloudy apple cider vinegar",
            "4 tbsp mixed seeds, such as pumpkin, sunflower, sesame",
            "3–4 tbsp chopped fresh coriander",
            "1 small ripe avocado"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 2",
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "steps": [
        "Put the rice and 1 cup (250ml/9fl oz) cold water in a heavy-based saucepan that comes with a tight-fitting lid, and bring to the boil. Once it’s bubbling, clamp on the lid, turn the heat down very low and simmer for 25 minutes. Then turn off the heat, leaving the lid on, and let it stand for a further 5 minutes, by which time the rice will be cooked – but still nutty – and the water absorbed.",
        "While the rice is cooking, use a vegetable peeler to shave the ginger into very thin strips.",
        "When the rice is cooked, spoon into a mixing bowl. Add the tamari or soy sauce and the cider vinegar to the bowl and toss with a fork to combine, and then do the same with the ginger shavings, radishes and seeds. Stir all but a little of the chopped coriander into the rice, still using a fork.",
        "Divide between 2 smallish bowls and top with avocado, cut either into gondola shaped slices or chunks, as wished. Sprinkle each with the remaining coriander, and eat serenely."
    ],
    "tips": [
        "I cannot get enough of short grain brown rice – so much more nubbly and delicious than regular wholegrain rice or white rice – but I find it doesn’t cook quite like rice does normally. That’s to say, usually the unswerving rule when cooking rice is 1 part rice to 2 parts water. I have found that with short grain brown rice it is 1 part rice to 1½ parts water (despite what it says on the packet). Anyway, whatever rice you’re using, I find it much simpler to use cups rather than weights – though I’ve given those, too – as it is ratio of volumes that is crucial."
    ],
    "title": "Rice bowl with ginger, radish and avocado",
    "videos": "[p037rc0j:p037rc0n]"
}