{
    "author": {
        "dan_lepard": "Dan Lepard"
    },
    "cookTime": "over 2 hours",
    "description": "Try something different for your Christmas cake with this rich fruit cake recipe topped with homemade pecan marzipan.",
    "dishes": [
        "cake",
        "christmas_cake",
        "icing",
        "jam",
        "marzipan",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries",
        "upside-down_cake"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the brandy butter frosting": [
            "300g/10½oz icing sugar",
            "50g/1¾oz butter",
            "25ml/1fl oz double cream",
            "25ml/1fl oz brandy"
        ],
        "For the fruit cake": [
            "80g/2¾oz golden syrup",
            "80g/2¾oz black treacle",
            "50g/1¾oz honey",
            "250g/9oz dark brown sugar",
            "200ml/7fl oz double cream",
            "15g/½oz (about 2 tbsp) mixed spice",
            "250g/9oz unsalted butter",
            "1 tsp orange extract",
            "1 tsp lemon extract",
            "6 medium free-range eggs",
            "350g/12oz currants",
            "350g/12oz raisins",
            "350g/12oz chopped pitted prunes",
            "350g/12oz glacé cherries or more dried fruit",
            "500g/1lb 2oz strong white flour",
            "½ tsp bicarbonate of soda",
            "brandy, whisky or orange juice, for feeding the cake",
            "2 tbsp apricot jam, boiled and sieved"
        ],
        "For the pecan marzipan": [
            "200g/7oz finely ground pecans, or half walnuts and half pecans",
            "100g/3½oz icing sugar",
            "125g4½oz soft brown sugar",
            "3 free-range egg yolks",
            "2 tsp liquid glucose",
            "1 tbsp honey",
            "1 tsp glycerine",
            "1-2 tsp ground cinnamon",
            "2 tsp vanilla extract"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "46",
    "serves": "Makes 1 x 25cm/10in round cake",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 170C/335F/Gas 3 and line a 25cm/10in round, deep cake tin with non-stick paper.",
        "Place the syrup, treacle, honey, sugar, cream and spices in a saucepan and bring to the boil. Pour the mixture into a large mixing bowl, add the butter in pieces and stir until melted, then add the orange and lemon extracts.",
        "Beat in the eggs until smooth, then stir in the fruit. Mix the flour and soda together, then stir this through evenly.",
        "Spoon into the tin and bake for about 2-2½ hours, or until a skewer inserted comes out clean. Leave to cool in the tin, then carefully remove from the tin.",
        "When cold, spoon the top liberally with brandy, whisky or boiled orange juice, wrap well and leave in a cool, dark place for 3-4 days before icing.The cake will keep for up to 3 months and should be ‘fed’ (covered with brandy, whisky or boiled orange juice every 4-5 days).",
        "For the pecan marzipan, combine the ground pecans and icing sugar in a bowl and mix together.",
        "In a saucepan, whisk together the brown sugar, egg yolks, glucose, honey, glycerine, cinnamon and vanilla, then cook over a low heat whisking constantly until pale, light and piping hot.",
        "Pour this over the pecan mixture and stir well to make a smooth paste. Leave to cool, then wrap in cling film.",
        "To cover the cake in marzipan, first lightly knead the marzipan so it’s smooth then roll it out on a worktop dusted with icing sugar. Roll the marzipan into a disc about 1cm/½in thick and 1-2cm/½-1in wider than the diameter of your cake (check the marzipan isn’t sticking to the worktop by dusting underneath it again with icing sugar).",
        "Brush the top of the cake with the sieved jam then leave a few minutes for it to set. Turn the cake upside down onto the marzipan and wiggle it gently so the top is stuck firmly.",
        "Trim any excess marzipan leaving a 2cm/1in border. Using a knife, gently press up into the gap caused by the curve of the cake, then scrape it up smoothly so it is level with the side of the cake.",
        "Carefully turn the cake the right way up and you should be left with a perfectly flat top surface and straight sides.",
        "Wrap the cake in cling film and leave to dry in a cool, dark place for 4-5 days.",
        "For the brandy butter icing, measure the icing sugar into a bowl, then melt the butter for a few seconds in the microwave or in a small pan over a low heat, taking care not to burn it.",
        "Pour the melted butter with the cream and brandy into the sugar and mix until smooth.",
        "Spread the icing onto the top of the cake and make small peaks using a knife. Set aside for a few hours, or until the icing has set.",
        "Dust with icing sugar before serving."
    ],
    "tips": [
        
    ],
    "title": "Christmas cake with pecan marzipan and brandy butter icing",
    "videos": "[p00h3wd7:p00h3wd9]"
}