{
    "title": "Rich Christmas pudding",
    "cookTime": "over 2 hours",
    "prepTime": "1-2 hours",
    "serves": "Serves 6-8",
    "recommendations": "22",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/richchristmaspudding_8935_16x9.jpg"
    ],
    "description": "Make this pudding ahead on Stir-up Sunday. Feed it with booze regularly for the flavours to develop.",
    "author": {
        
    },
    "show": {
        
    },
    "tips": [
        "If you are making this as a dairy-free recipe, take care to ensure the breadcrumbs are dairy free. Although many breads contain dairy, free-from options are widely available - just check the label."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "225g/8oz golden caster sugar",
            "225g/8oz vegetarian suet",
            "340g/12oz sultanas",
            "340g/12oz raisins",
            "225g/8oz currants",
            "110g/4oz candied peel, chopped",
            "110g/4oz plain flour",
            "110g/4oz fresh white breadcrumbs",
            "55g/2oz flaked almonds",
            "1 lemon, zest only",
            "5 eggs, beaten",
            "1 level tsp ground cinnamon",
            "1 level tsp mixed spice",
            "5g/1 level tsp freshly grated nutmeg",
            "pinch of salt",
            "150ml/5fl oz brandy or rum"
        ]
    },
    "steps": [
        "Lightly grease 4x600ml/1 pint or 2x1.2 litre/2 pint pudding basins.",
        "Mix together all the dry ingredients.",
        "Stir in the eggs and brandy and mix well.",
        "Spoon the mix into basins. Put a circle of baking parchment and foil over the top of each basin and tie securely with string. Make a string handle from one side of the basin to the other so it is easier to pick the basin out of the pan after cooking.",
        "Put the basins in a large steamer of boiling water and cover with a lid. Boil for 5-6 hours, topping the boiling water up from time to time, if necessary. If you do not have a steamer, put the basins in a large pan on inverted saucers on the base. Pour in boiling water to come a third of the way up the sides of the pudding bowls. Cover and steam as before.",
        "Cool. Change the baking parchment and foil covers for fresh ones and tie up as before. Store in a cool cupboard until Christmas Day.",
        "To serve, steam for 2 hours and serve with brandy butter, rum sauce, cream or homemade custard."
    ],
    "howTos": [
        "sealing_steamed_puddings"
    ],
    "videos": "[]"
}