{
    "title": "Rich fruit buttermilk scones",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 12",
    "recommendations": "23",
    "images": [
        
    ],
    "description": "Equipment and preparation: You will need a lighlty greased baking sheet and a 5cm/2in cutter.",
    "author": {
        "delia_smith": "Delia Smith"
    },
    "show": {
        
    },
    "tips": [
        "Scones do not keep well so are best eaten on the day they're made. Any left over, however, will freeze perfectly well."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "225g/8oz self-raising flour",
            "40g/1½oz caster sugar",
            "75g/3oz butter at room temperature",
            "50g/2oz mixed dried fruit",
            "1 egg, beaten",
            "3-4 tbsp buttermilk, to mix",
            "a little extra flour for dusting tops",
            "pinch of salt"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "Begin by sifting the flour and salt into a bowl and sprinkling in the sugar, then rub the butter in lightly until the mixture looks crumbly.",
        "Sprinkle in the dried fruit, pour in the beaten egg, and addtbsp of the buttermilk.",
        "Start to mix the dough with a knife and finish off with your hands - it should be soft but not sticky, so add more milk, a teaspoon at a time, if the dough seems too dry.",
        "Next, form the dough into a ball and turn it out on to a lightly floured working surface. Now roll it out very lightly to a round at least 2.5cm/1in thick, then cut the scones out by placing the cutter on the dough and giving it a sharp tap. Don't twist the cutter, just push the dough out, then carry on until you are left only with trimmings - roll these and cut an extra scone.",
        "Place the scones on the lightly greased baking sheet and dust lightly with the extra flour. Bake them in the top half of the oven for 10-12 minutes or until they are well risen and golden brown. After that remove them to a cooling tray and serve very fresh, split and spread with butter."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}