{
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "cookTime": "over 2 hours",
    "description": "Once the initial faff of browning the meat is done, this dish requires very little effort and the resulting flavours are intense.",
    "dishes": [
        "casserole",
        "oven-baked_dishes",
        "sauce",
        "slow-cooked_dishes",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rioja-braised_lamb_66249_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "4 lamb shanks",
            "salt and freshly ground black pepper",
            "oil, for frying",
            "350ml/12fl oz Rioja or 350ml/12fl oz good-quality beef stock",
            "250ml/9fl oz balsamic vingear",
            "1 garlic bulb, cut in half horizontally",
            "2 bay leaves",
            "1–2 tsp paprika",
            "handful black peppercorns",
            "4 sprigs fresh rosemary",
            "300ml/10fl oz beef stock",
            "125g/4oz chorizo",
            "1 large red onion, peeled and cut into wedges",
            "2 carrots, peeled and chopped",
            "dash honey, to taste"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "201",
    "serves": "Serves 4",
    "show": {
        "b015fpxs": "Home Cooking Made Easy"
    },
    "steps": [
        "Preheat the oven to 150C/300F/Gas 3.",
        "Season the lamb well with salt and freshly ground black pepper. Drizzle oil into a heavy-based saucepan pan set over a high heat. Turn down the heat slightly and brown the lamb shanks all over.",
        "Pour the wine and balsamic vinegar into a casserole dish and boil for five minutes. Add the lamb shanks, garlic, bay leaves, paprika, peppercorns, half the rosemary and the stock. Cover with a lid and bring to the boil.",
        "Once boiling, place the dish into the oven and cook for two hours.",
        "Remove the dish from the oven and add the chorizo, onion, carrots, honey to taste, if using, and the remaining rosemary, then return to the oven and cook for another hour, or until the meat is tender and falling off the bone.",
        "Remove the meat and vegetables with a slotted spoon and keep warm.",
        "Place the casserole dish onto a high heat and boil for 8–10 minutes, or until thickened slightly. Add salt and freshly ground black pepper to taste.",
        "Serve the meat and vegetables with creamy mashed potatoes and lashings of the sauce."
    ],
    "tips": [
        
    ],
    "title": "Rioja-braised lamb shanks with chorizo and garlic",
    "videos": "[]"
}