{
    "title": "Risotto with lettuce and spring onion",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "This is known as Risotto con le Cipolline e la Lattuga in Italy",
    "author": {
        "valentina_harris": "Valentina Harris"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "8 spring onions, chopped finely",
            "3 tbsp unsalted butter",
            "340g/12oz arborio rice",
            "1 small glass white wine",
            "up to 2 litres/3½ pints chicken or vegetable stock, kept hot",
            "1 head round lettuce, washed and dried, then shredded coarsely",
            "sea salt and freshly ground black pepper",
            "4 tbsp freshly grated parmigiano reggiano"
        ]
    },
    "steps": [
        "Fry the spring onions very gently and slowly with half the butter. When they are soft, add the rice and quickly toast the grains thoroughly all over.",
        "When the rice is crackling dry, add the wine and stir, evaporating the fumes. Then start to add the stock, beginning with 3 ladles so as to completely submerge the rice.",
        "Stir thoroughly, and allow the liquid to be absorbed, then lower the heat and continue to add stock in quantities of 1-2 ladles at a time and stir constantly between each addition.",
        "The rice itself will let you know when it needs more liquid by allowing a clear wake to open up behind the spoon as you draw it across the pan.",
        "After about 20 minutes, the rice should have swelled and become creamy, but the grains should still be chewy, but not chalky. In no way should there be any hint of rice pudding about it.",
        "Take it off the heat, stir in the lettuce and stir it around to wilt the leaves, then add the remaining butter, adjust the seasoning and stir in the parmigiano. Cover and leave to rest for about 4 minutes, then transfer on to a warmed serving dish or individual plates and eat at once."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}