{
    "author": {
        "valentina_harris": "Valentina Harris"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Italian",
    "description": "This is known as Risotto con i Pisellini e Zafferano in Italy.",
    "dishes": [
        "gratin",
        "risotto",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1 small onion, peeled and very finely chopped",
            "3 tbsp unsalted butter",
            "4 handfuls raw or cooked frozen peas",
            "340g/12oz arborio rice",
            "up to 2 litres/3½ pints chicken or vegetable stock, kept hot",
            "a pinch of saffron threads soaked in warm water for 30 minutes to infuse, then strained, or 2 sachets saffron powder",
            "4 tbsp freshly grated parmigiano reggiano (or similar vegetarian grating cheese)",
            "sea salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "5",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Fry the onion gently in half the butter until softened but not coloured at all. Add all the rice in one go and quickly toast the grains in the hot butter and onion for up to five minutes or until they are crackling hot, but not browned at all.",
        "Add the first 3 ladles of hot stock and stir together thoroughly. Add all the peas except for one handful, stir together for 2 or 3 minutes, then begin to add more stock and stir thoroughly together.",
        "Continue to cook the risotto, adding more stock - 1½ ladles at a time - each time the spoon opens up a clear wake behind it as you draw the spoon through the cooking risotto. Keep an eye on the heat so as not to let the risotto cook too quickly.",
        "When the risotto is cooked thoroughly, in other words the rice grains are firm to the bite and neither pappy nor chalky, and the texture is suitably creamy, take it off the heat.",
        "Stir in the remaining butter and peas, the saffron powder or strained infusion from the saffron threads, seasoning to taste and half the cheese. Stir thoroughly, then cover and leave to stand for four minutes.",
        "After the risotto has rested, stir once more and transfer on to a warmed serving dish or individual plates, sprinkle with the remaining cheese and serve at once."
    ],
    "tips": [
        
    ],
    "title": "Risotto with peas and saffron",
    "videos": "[]"
}