{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A tender cut of beef is a little bit of luxury and this is the perfect main course to cook for a gathering of friends.",
    "dishes": [
        "mayonnaise",
        "oven-baked_dishes",
        "pie",
        "roast_beef",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roast_fillet_of_beef_45803_16x9.jpg"
    ],
    "ingredients": {
        "For the beef": [
            "1kg/2.2lb middle-cut thick fillet of beef",
            "salt and pepper",
            "2 tbsp olive oil"
        ],
        "For the sauce": [
            "2 whole heads garlic",
            "150ml/¼ pint mayonnaise",
            "150ml/¼ pint full fat crème fraîche",
            "½ tsp sugar",
            "2 tbsp wholegrain mustard"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "9",
    "serves": "Serves 10",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7 (fan 200C).",
        "Rub the fillet of beef with plenty of salt and pepper and the oil.",
        "Heat a large frying pan until very hot. Fry the fillet on all sides until browned. Transfer to a roasting tin.",
        "Place the fillet in the centre of the roasting tin, arrange the whole garlic bulbs around the fillet and drizzle with a little oil. Roast for 23 minutes for medium-rare (only 20 minutes if it is a long, thin piece).",
        "When the beef is cooked, remove from the oven, cover with aluminium foil and leave to rest for 15 minutes.",
        "Serve hot or you can leave it to cool, and then wrap in more foil and place in the fridge to cool completely.",
        "To make the sauce, cut the roasted garlic bulbs in half horizontally and squeeze the garlic paste from each single clove into a bowl. Add the mayonnaise, crème fraîche and sugar.",
        "Blend to a smooth purée using a blender or food processor. Stir in the wholegrain mustard. Chill until ready to serve alongside the beef.",
        "Carve the beef into thin slices just before serving."
    ],
    "tips": [
        "Both the beef and the sauce can be prepared up to two days in advance. If you want to get ahead, carve the cold beef an hour or two before serving then reassemble as a whole joint and wrap it tightly in cling film. Unwrap and arrange on a platter just before serving as the beef will loose its lovely pink colour if left exposed to the air for too long. It is important to ask for a middle-cut piece of fillet as you want the beef to be of even thickness the whole length so that it cooks evenly. If roasting from hot after pan-frying, roast in the oven for slightly less time – about 23 minutes."
    ],
    "title": "Roast fillet of beef with roasted garlic and mustard cream",
    "videos": "[]"
}