{
    "title": "Roast fore rib of beef, roasted potatoes and Yorkshire pudding",
    "cookTime": "1 to 2 hours",
    "prepTime": "overnight",
    "serves": "Serves 6",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "James Martin brings you the perfect recipe for an extra special roast. Push the boat out and make your own Yorkshire puddings, gravy and mustard.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the Yorkshire puddings": [
            "225g/8oz plain flour",
            "8 free-range eggs",
            "600ml/20fl oz milk",
            "50g/1¾oz beef dripping or lard",
            "salt and freshly ground black pepper"
        ],
        "For the beef": [
            "4kg/8lb 8oz, 3 bone fore rib 28 day aged beef",
            "200ml/7fl oz white wine",
            "300ml/10fl oz beef stock"
        ],
        "For the roast potatoes": [
            "10 King Edward potatoes, peeled and cut into 2 or 3",
            "50g/1¾oz lard, beef dripping or vegetable oil",
            "pinch salt"
        ],
        "For the vegetables": [
            "75g/2¾oz butter",
            "3 carrots, finely sliced",
            "1 head spring greens, finely sliced",
            "250g/9oz peas"
        ],
        "For the mustard": [
            "150ml/5fl oz cider vinegar",
            "5 tbsp caster sugar",
            "60g/2¼oz yellow mustard seeds",
            "25g/1oz brown mustard seeds",
            "2 tbsp English mustard powder",
            "110ml/3¾fl oz beer"
        ]
    },
    "steps": [
        "For the Yorkshire puddings, put the flour in a bowl, season with salt and pepper. Add the eggs and whisk to a batter. Add the milk and whisk until smooth then place in the fridge for at least one hour, but preferably overnight.",
        "For the beef, preheat the oven to 200C/180C Fan/Gas 6.",
        "Heat a frying pan until very hot. Season the beef with salt and pepper. Fry the beef on all sides in the hot pan until nicely browned. Transfer to a roasting dish and place in the oven for 1 hour 30 minutes.",
        "Meanwhile for the roast potatoes, put the potatoes in a large saucepan, cover with water, add a pinch of salt and bring to the boil. Reduce the heat and simmer for 3-4 minutes. Drain the potatoes into a colander and shake around a little to rough up the edges.",
        "Put a deep roasting tray onto the heat and add the fat. Add the potatoes and fry on each side until they start to brown. Sprinkle with salt and place in the oven alongside the beef for 30 minutes until starting to turn golden and crisp. After 30 minutes, turn the potatoes over in the fat and return to the oven for a further 20-30 minutes.",
        "Remove the beef from the oven, cover with aluminium foil and rest for 15-30 minutes. Put the beef on a board to carve then return the roasting pan to the heat, and heat over a medium heat until bubbling, then add the wine and cook until reduced by half. Add the beef stock and cook until reduced by half again, season to taste.",
        "To cook the Yorkshire puddings, preheat the oven to 220C/200C Fan/Gas 7.",
        "Divide the dripping or lard between 2 x 12 hole muffin tins or Yorkshire tins. Heat the tins in the oven for 10 minutes, until smoking hot. Carefully pour the batter into the tins, filling them two-thirds of the way. Bake the Yorkshire puddings for 20 minutes. Do not open the oven door during this time.",
        "After 20 minutes, open the door to allow any steam to escape, then turn the temperature down to 190C/170C Fan/Gas 5. Cook the Yorkshire puddings for a further 15 minutes until crisp and golden-brown.",
        "For the vegetables, heat a frying pan until hot, add one-third of the butter and all the carrots. Stir to coat the carrots in the melted butter, add 110ml/4floz water and bring to the boil. Reduce the heat to a simmer and cook for five minutes, until the liquid has reduced to coat the carrots and they are tender. Season with salt and pepper.",
        "Repeat the process for the spring greens, cooking them for 2-3 minutes until tender.",
        "Meanwhile, bring a pan of salted water to the boil, add the peas and cook for two minutes until hot through. Drain the peas and toss with the last of the butter.",
        "For the mustard, put the vinegar and sugar in a non-reactive pan and bring to a simmer. Add the yellow and brown mustard seeds and the mustard powder and stir well. Simmer over a high heat for three minutes, until the volume of liquid has reduced by half and the seeds have softened slightly.",
        "Pour the mustard mixture into the bowl of a food processor and blend to a purée. It will take a few minutes for the seeds to break down and the mustard to become creamy. Add the beer to the mustard mixture and blend once more. Season with salt and pepper.",
        "To serve, carve the beef and place onto serving plates, with the roast potatoes, Yorkshire pudding and a spoon full of each of the vegetables. Finish with a drizzle of the gravy and serve the mustard alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}