{
    "author": {
        
    },
    "cookTime": "30 mins to 1 hour",
    "description": "",
    "dishes": [
        "bun",
        "oven-baked_dishes",
        "pesto",
        "prepare-ahead_desserts",
        "sandwich"
    ],
    "flags": [
        
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the lime tzatziki": [
            "450g/1lb Greek yoghurt",
            "1 cucumber, halved, de-seeded and coarsely grated",
            "grated zest of 2 limes",
            "1 large clove of garlic, crushed",
            "1 bunch of spring onions, finely sliced",
            "a pinch of chilli powder",
            "To decorate:",
            "sprigs of fresh basil",
            "Preparing ahead:",
            "Prepare and cook the salmon, chill.",
            "One hour before: make the tzatziki, chill.",
            "Last minute: decorate the salmon and serve."
        ],
        "default": [
            "2.3kg whole salmon, filleted",
            "5 tbsp red pesto",
            "2 tbsp basil, finely shredded",
            "5 tbsp each white wine and water",
            "1 tbsp olive oil"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "1",
    "serves": "Serves 10",
    "show": {
        
    },
    "steps": [
        "Heat the oven to 200C/400F/Gas 6. Lightly oil a large sheet of tin foil.",
        "Pull out any small bones from the salmon fillets. Lay one fillet, skin side down onto the tin foil, spread with the red pesto and sprinkle with the basil, season with a little salt and ground black pepper. Arrange the second fillet on top, again skin side uppermost, press the sandwiched fillets lightly together.",
        "Brush the skin of the top fillet with the olive oil, season lightly and pour the wine and water around the base. Wrap the foil loosely around the fish and bake in the oven for 25 - 30 minutes or until the fish is cooked. To test to see if the fish is cooked, the skin should pull away easily and the flesh look opaque.",
        "For the tzatziki mix the yoghurt, cucumber, lime zest, garlic and spring onions together, season really well with the chilli, salt and pepper and serve.",
        "To serve, lie the fish onto a serving plate and arrange sprigs of basil around the fish, serve the tzatziki in a large bowl."
    ],
    "tips": [
        
    ],
    "title": "Roast salmon with red pesto and basil and lime tzatziki dressing",
    "videos": "[]"
}