{
    "author": {
        
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Vegetarians and meat-eaters alike will love this hearty, vegetable lasagne. Serve with a green salad and crusty bread.",
    "dishes": [
        "bread",
        "lasagne",
        "oven-baked_dishes",
        "salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roastedvegetablelasa_77405_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "450g/16 oz courgettes",
            "1 aubergine",
            "3-4 tbsp extra virgin olive oil",
            "1 kg firm, ripe tomatoes, sliced",
            "2 cloves garlic, chopped",
            "2 tbsp balsamic vinegar",
            "10-12 fresh basil leaves, torn",
            "Pinch salt and freshly ground black pepper",
            "2x125g/4½ oz low-fat mozzarella cheese, sliced",
            "150g/5¼ oz fresh lasagne sheets",
            "100g/3½ oz freshly grated parmesan, or similar vegetarian hard cheese"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "47",
    "serves": "Serves 4-6",
    "show": {
        
    },
    "steps": [
        "Slice the courgettes and aubergine into diagonal slices. Heat a ridged grill pan, brush the slices with olive oil and grill for several minutes each side until chargrilled, then remove. You'll have to do this in batches.",
        "Preheat the oven to 190C/375F/Gas 5. Brush the inside of a large baking dish with a little oil. Place a layer of sliced tomatoes (about one third of the total) on the bottom, slightly overlapping.",
        "Next, layer with half of the courgette and aubergine slices. Sprinkle with half the chopped garlic and one tbsp balsamic vinegar.",
        "Scatter over half of the torn basil leaves and season with salt and pepper.",
        "Layer half the mozzarella slices on top, then cover with half the lasagne sheets.",
        "Continue layering with the rest of the ingredients, ending with a layer of tomatoes on top. Sprinkle over the parmesan.",
        "Cover with foil and bake for 35-40 minutes. Remove the foil and bake another five minutes until the parmesan's golden on top."
    ],
    "tips": [
        
    ],
    "title": "Roasted vegetable lasagne",
    "videos": "[]"
}