{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A bread loaf is packed with sweet roasted vegetables, mozzarella and fresh basil to make a delicious addition to a picnic, or serve in slices at home with crisp croutons for contrast.",
    "dishes": [
        "bread",
        "oven-baked_dishes",
        "pesto",
        "sandwich"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roasted_vegetable_picnic_46310_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "2 red peppers, seeds removed, cut into quarters",
            "2 yellow peppers, seeds removed, cut into quarters",
            "2 courgettes, sliced lengthways",
            "1 aubergine, sliced lengthways",
            "4 tbsp olive oil, plus extra for frying",
            "salt and freshly ground black pepper",
            "1 day-old crusty loaf of bread",
            "1½ tsp sherry vinegar",
            "1 garlic clove, crushed",
            "2 x 125g/4½oz buffalo mozzarella",
            "1 packet fresh basil leaves",
            "3 tbsp ready-made pesto"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "9",
    "serves": "Serves 6",
    "show": {
        "b01rhdgt": "Paul Hollywood's Bread"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Place all the chopped vegetables in a bowl and drizzle with half the oil and season with salt and pepper.",
        "Toss to coat all the vegetables in the oil. Scatter the vegetables in a single layer on a baking tray and roast until the vegetables are softened, about 15 minutes. You may need to do this in two batches.",
        "Cut the top off the loaf to create a lid.",
        "Hollow out the loaf by scooping out the soft bread (keeping it in large chunks) and leaving an edge of around 3cm/1¼in so that the shell isn’t too thin.",
        "Place half of the removed inner bread in a food processor and pulse to make breadcrumbs.",
        "Mix the remaining oil with the sherry vinegar, breadcrumbs and garlic then mix with any juices from the roasting tin. Divide the liquor between the vegetables, season with salt and pepper and toss together. Leave to stand for an hour so that the vegetables and breadcrumbs soak up the juices.",
        "Slice the mozzarella and pat dry with kitchen paper.",
        "Take the hollowed out loaf and spread the pesto over the base. Begin layering the vegetables starting with the red pepper, then the aubergine, the mozzarella, the yellow pepper and finally the courgette, adding a little ripped basil between the layers. Repeat the layers until the loaf is full. Put the lid on, wrap tightly with cling film and place in the fridge overnight.",
        "Slice the loaf and serve."
    ],
    "tips": [
        
    ],
    "title": "Roasted vegetable picnic loaf",
    "videos": "[]"
}