{
    "title": "Langoustines with oyster mayonnaise, wilted spinach and anchovy sand",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This recipe celebrates the fresh flavours of the sea and makes an indulgent starter for four or main for two.",
    "author": {
        "mark_jordan": "Mark Jordan"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the anchovy sand": [
            "75g/2½oz flour",
            "50g/1¾oz butter, softened",
            "1 free-range egg, yolk only",
            "few drops anchovy oil (from a tin of anchovies in oil)"
        ],
        "For the oyster mayonnaise": [
            "6 oysters",
            "300ml/10fl oz vegetable oil",
            "1 spring fresh parsley",
            "squeeze lemon juice"
        ],
        "For the langoustines": [
            "12 large langoustines, peeled",
            "vegetable oil, for frying",
            "1 lemon, juice only",
            "110g/4oz butter",
            "250g/9oz baby spinach",
            "pinch salt"
        ],
        "To serve": [
            "2 tbsp ebene caviar",
            "2 tbsp pepper dulse seaweed (available online)",
            "handful fresh pea shoots"
        ]
    },
    "steps": [
        "For the anchovy sand, preheat the oven to 180C/350F/Gas 4. Place the flour, butter and egg yolk into a food processor and gently mix together. Add a few drops of the anchovy oil and pulse until combined. Tip out the dough and break into little balls. Place on a non-stick tray and bake in the oven until golden-brown and crunchy (approximately 15 minutes). Set aside to cool, then crumble to resemble sand.",
        "For the oyster mayonnaise, gently open the oysters and place the meat into a jug. Add a small sprig of parsley and use a hand blender to purée until smooth. Slowly start adding the vegetable oil, blending all the time, until it forms a mayonnaise. Add a few drops of lemon juice and then place in the fridge to set.",
        "For the langoustines, place a non-stick frying pan over a medium heat and add a few drops of vegetable oil. Gently place the langoustines into the pan and cook until golden-brown on one side, at this point turn off the heat and add the butter and a squeeze of lemon juice. Then add the spinach. When the spinach has wilted, remove both the langoustine and the spinach from the pan and season with a little salt",
        "To serve, sprinkle the anchovy sand all over a large serving plate and put five or six blobs of the mayonnaise onto the plate and top each one with some ebene caviar. In between the mayonnaise place some piles of spinach, sit the langoustines on the spinach and garnish with the pepper dulse seaweed and few sprigs of pea shoots. Serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}