{
    "title": "Roast rib of beef with mustard and thyme Yorkshire puddings and red wine gravy",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "",
    "author": {
        "jo_pratt": "Jo' Pratt"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the beef:": [
            "vegetable or groundnut oil",
            "flaked sea salt and freshly ground black pepper",
            "approximately 2.25kg/5lb boned and rolled rib joint of beef",
            "6 shallots, peeled and left whole",
            "2 carrots, peeled and cut in half",
            "1 garlic bulb, cut in half across the centre",
            "few sprigs of fresh thyme",
            "beef stock or water"
        ],
        "For the Yorkshire puddings:": [
            "225g/8oz plain flour",
            "pinch of salt",
            "2 tsps English mustard powder",
            "3 eggs, beaten",
            "1 egg, white only",
            "1 tsp fresh thyme leaves, or ½ tsp dried thyme",
            "300-400 ml/10-14fl oz milk",
            "vegetable or groundnut oil, for cooking"
        ],
        "For the gravy:": [
            "1 heaped tbsp plain flour",
            "½ bottle full-bodied red wine",
            "450ml/¾ pint beef stock or water"
        ]
    },
    "steps": [
        "Make the beef: preheat the oven to 190C/375F/Gas 5.",
        "Heat a good glug of oil in a large roasting tray on the hob. Rub plenty of salt and pepper over the beef and colour it in the hot oil on all sides for a few minutes.",
        "Remove the beef from the tray and add the shallots, carrots, garlic and thyme to the tray, then sit the beef on top.",
        "Cook in the oven for about 1¾ hours for medium rare; add another 15 minutes for medium, and 30 minutes for medium-well done. During the cooking time, baste the beef every so often with any juices in the pan. If the bottom of the pan seems a little dry, add a little beef stock or water.",
        "Once it is cooked, transfer the beef on to a plate and loosely cover with foil. Retain the contents of the roasting tray for the gravy. The beef can now be left to rest in a warm place for 20-25 minutes, giving you just the right amount of time to cook the Mustard and Thyme Yorkshire Puddings and Red Wine Gravy.",
        "Make the Yorkshire puddings: preheat the oven to 220C/425F/Gas 7 and place 1-2 deep muffin tins in to preheat.",
        "Sift the flour, salt and mustard powder into a large bowl and whisk in the beaten eggs, egg white, thyme and enough milk to give a smooth, thick batter about the consistency of double cream. The batter is best left for at least 30 minutes, or if you can make it the day before and keep it in the fridge, that's even better. This will give you really smooth, well-risen Yorkshires. Re-whisk the batter just before using, adding any extra milk to return to the double-cream consistency. Pour into a jug. If you're making the mixture on the day, you can do this while the beef is cooking.",
        "Remove the muffin tins from the oven and pour a good drop of oil into each hole. Return to the oven for a few minutes until the oil is almost smoking. Carefully take out of the oven and pour the batter into the tins, almost filling each hole. Return to the oven and cook for 25-30 minutes, or until golden and crispy. While the Yorkshires are cooking, filling the kitchen with the wonderful aroma of thyme, you can make the gravy.",
        "Make the gravy: pour away any excess oil from the roasting tray and place it with all the sticky vegetables back on the hob over a high heat. Vigorously stir in the flour and then pour in the red wine and beef stock or water. Bring to the boil, cooking for about 8 minutes until slightly thickened. Pour in any juices from the resting beef, then season with salt and pepper.",
        "Strain through a sieve, pushing through all the juices from the vegetables, and serve in a warm jug with thick slices of the rested roast beef and the perfectly risen Yorkshire puds."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}