{
    "title": "Roast pork with garlic and thyme sautéed potatoes and spiced apple sauce",
    "cookTime": "1 to 2 hours",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4-6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "p007b4jc": "Stately Suppers"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1.5kg/3lb 5oz loin of pork, on the bone, chined (ask your butcher to chine the loin for you - this will make carving easier)",
            "olive oil",
            "salt and freshly ground black pepper",
            "6 sage leaves",
            "1 lemon, halved"
        ],
        "For the thyme and garlic sautéed potatoes": [
            "25g/1oz butter",
            "1 kg/2¼lb potatoes, peeled and diced",
            "1 tsp fresh thyme leaves",
            "1-2 cloves garlic, finely chopped",
            "salt and freshly ground black pepper"
        ],
        "For the spiced apple sauce": [
            "500g/1lb 2oz cooking apples, peeled, cored and chopped",
            "30g/1oz butter",
            "2 tbsp water",
            "2 tbsp white wine vinegar",
            "¼ tsp ground nutmeg",
            "¼ tsp ground cinnamon",
            "freshly ground black pepper",
            "30g/1oz soft dark brown sugar"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6. Using a sharp knife, score the skin of the pork 12 to 15 times.",
        "Place the pork in a colander in the sink and pour boiling water over the scored skin - this is to help achieve perfect crackling.",
        "Put the pork, skin-side up, in a roasting tin, drizzle with a little oil and sprinkle over some salt. Scatter over the sage leaves and add the lemon halves.",
        "Roast the pork for approximately 1½hours or until cooked through. The juices will run clear when the meat is pierced with a skewer when cooked through.",
        "Meanwhile, for the potatoes, melt the butter in a medium saucepan. Sauté the potatoes with the thyme and garlic for 10 minutes or until golden and cooked through. Season well with salt and freshly ground black pepper.",
        "For the sauce, put the apples in a pan with the butter, water, vinegar and spices. Cover and cook until softened but chunky. Add sugar to taste.",
        "Serve the pork cut into portions with the spiced apple sauce and the thyme and garlic sautéed potatoes."
    ],
    "howTos": [
        "scoring_skin"
    ],
    "videos": "[]"
}