{
    "title": "Roast crown of wood pigeon with peas and mousseron",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "Mousseron are delicious little mushrooms grown wild in France. Their earthy flavour matches the pigeon, while peas and mint add a touch of spring.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the wood pigeon": [
            "2 wood pigeon crowns",
            "50g/1¾oz unsalted butter",
            "salt and freshly ground black pepper, to taste",
            "2 sprigs thyme"
        ],
        "For the peas and mousseron": [
            "50g/1¾oz unsalted butter",
            "50g/1¾oz bacon, cut into lardons",
            "100g/3½oz mousseron mushrooms",
            "150g/5½oz peas, podded, blanched in a pan of boiling water and refreshed in ice cold water",
            "100ml/3½fl oz brown chicken stock",
            "2-3 tbsp chopped mint leaves",
            "1 head Little Gem lettuce, finely chopped",
            "2 garlic cloves, grated"
        ]
    },
    "steps": [
        "For the wood pigeon, preheat the oven to 230C/450F/Gas 8.",
        "Put the pigeons on a roasting tray and place a large knob of the butter on top of each. Sprinkle with salt and pepper. Cook in the oven for eight minutes, or until the juices run clear when the meat is pierced in the thickest part. The meat will still be a little pink inside. Allow to rest for eight minutes.",
        "For the peas and mousseron, heat a frying pan and add half the butter and bacon. Cook for a couple of minutes to brown the bacon. Add the mousseron mushrooms and cook for another couple of minutes. Add the peas, chicken stock and all but a knob of the remaining butter. Cook until the volume of liquid has reduced to a glaze. Season with salt and pepper.",
        "Add the mint, Little Gem and grated garlic. Stir and heat through.",
        "For the wood pigeon, cut the breasts from the pigeons. Heat a knob of butter in a clean pan then add the pigeon breasts and thyme. Take off the heat after a minute. (Make sure you don't overcook the pigeon otherwise it can taste a little like liver.)",
        "To serve, put the pigeon breasts into serving bowls and top with the bacon and peas."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}