{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "This will become a firm family favourite as it can be cooked in one dish and is so quick and easy to put together. Choose your favourite type of local, British sausage for this recipe – my family loves leek and sage.",
    "dishes": [
        "oven-baked_dishes",
        "sausage",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roasted_sausage_and_39127_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "2 tbsp olive oil",
            "2 large onions, sliced lengthways into wedges",
            "2 red peppers, deseeded and diced",
            "2 garlic cloves, chopped",
            "1 tbsp chopped fresh thyme leaves",
            "500g/1lb 2oz baby new potatoes, halved",
            "12 sausages, pricked with a fork",
            "200ml/7fl oz white wine",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "33",
    "serves": "Serves 4-6",
    "show": {
        "b05vr6dl": "Mary Berry's Absolute Favourites"
    },
    "steps": [
        "Preheat the oven to 220C/200C fan/Gas 7.",
        "Place all the ingredients except the wine in a large, resealable freezer bag. Seal the bag shut and shake well to coat everything in the oil. Alternatively, put everything in a large bowl and turn the ingredients until they are fully coated in the oil.",
        "Tip into a large roasting tin, spreading the ingredients out into one even layer and ensuring that the sausages aren’t covered by any of the vegetables. Season well with salt and pepper. Roast for about 30–35 minutes until golden-brown.",
        "Remove from the oven, turn the sausages over and toss the vegetables in the cooking juices. Pour in the wine and return to the oven for a further 20 minutes or until browned and the sausages are cooked and the potatoes tender.",
        "Serve hot with a dollop of mustard on the side."
    ],
    "tips": [
        "If you’re making this for young children, you can replace the wine with stock, if you prefer."
    ],
    "title": "Roasted sausage and potato supper",
    "videos": "[]"
}