{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "French",
    "description": "Roast lamb atop sliced potatoes with onions and peas. Give it a fancy French name and your Sunday lunch will taste even better.",
    "dishes": [
        "fricassee",
        "jam",
        "oven-baked_dishes",
        "roast_lamb",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the fricassée of onions and peas": [
            "50g/2oz butter",
            "150g/5½oz frozen baby pearl onions",
            "250g/9oz frozen peas",
            "500ml/18fl oz chicken stock"
        ],
        "For the roasted leg of lamb and boulangère potatoes": [
            "2.7kg/6lb leg of lamb, bone in",
            "50g/1¾oz butter, softened",
            "50ml/1¾fl oz olive oil",
            "6 large potatoes, peeled and sliced thinly",
            "4 onions, sliced thinly",
            "salt and freshly ground black pepper",
            "450ml/16fl oz chicken or lamb stock"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "20",
    "serves": "Serves 4-6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the roasted leg of lamb and boulangère potatoes, preheat the oven to 230C/450F/Gas 8.",
        "Rub the meat with the softened butter and place it in a roasting tin.",
        "Pour a tablespoon or so of the olive oil over the meat and cook in the oven for about 30 minutes.",
        "While the meat is cooking, place the potatoes and onions in a bowl, toss together and season with salt and freshly ground black pepper.",
        "After 30 minutes, take the meat from the oven and lift it out of the tin.",
        "Layer the potatoes and onions into the fat in the tin and pour over the stock.",
        "Place a wire rack over the potatoes and onions and sit the lamb on top.",
        "Roast for about another hour, depending on how well you like your meat cooked. Allow the lamb to rest as long as you have cooked it.",
        "For the fricassée of onions and peas, heat a medium frying pan and add the butter. Once melted add the baby onions. Cook for 3-4 minutes, or until golden-brown all over.",
        "Add the peas, stir and add the stock. Cook for a few minutes, or until the onions have cooked through.",
        "To serve, slice the lamb and serve in shallow bowls. Place the potatoes alongside and add the onions and peas."
    ],
    "tips": [
        
    ],
    "title": "Roasted leg of lamb with boulangère potatoes and a fricassée of onions and peas",
    "videos": "[]"
}