{
    "author": {
        "curtis_stone": "Curtis Stone"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "blini",
        "oven-baked_dishes",
        "sauce",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the rösti potatoes": [
            "4 medium baking potatoes, peeled",
            "salt, to taste",
            "2 sprigs thyme, leaves only",
            "oil, for frying"
        ],
        "For the sauce": [
            "25g/1½oz caster sugar (quantity may vary depending on sharpness of rhubarb)",
            "3 stalks rhubarb, roughly diced",
            "150ml/6oz red port",
            "150ml/6oz chicken stock"
        ],
        "default": [
            "2 x 360g/12½oz large duck breasts",
            "200g/8oz baby spinach, stems removed, washed",
            "20g/1oz butter"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "7",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "To make the sauce, place the sugar and rhubarb in a medium-sized pan and cook over a low-to-medium heat for five minutes.",
        "Add the red port and bring to the boil for two minutes.",
        "Add the chicken stock and cook until rhubarb resembles a sauce.",
        "Preheat oven to 180C/356F/Gas 4.",
        "To make the rösti, begin by par-boiling the potatoes for about 10-15 minutes. This will help the rösti to cook through more quickly. Cool until you're able to handle them.",
        "Once cooled, using a grater, finely grate the potato. Sprinkle the potato with salt and place in a large tea towel or cloth. Squeeze firmly and discard the moisture that comes from the potatoes through the cloth.",
        "Mix thyme leaves with potato and place in a small blini pan, about 2-3cm/1in in depth.",
        "Using plenty of oil, cook rösti potato on a medium heat until golden brown on one side.",
        "While rösti potato is cooking, constantly push the potato down using a fork.",
        "Turn rösti and continue to colour until golden on both sides. NB: Rösti potatoes can be made in advance and reheated just before serving.",
        "For the duck, on a medium-to-high heat, place duck breasts in a frying pan skin-side down and cook until skin is a light golden brown.",
        "Place duck breasts in the oven for 8-12 minutes while continuing to check from time to time that the skin of the duck does not become too dark.",
        "Remove duck from oven and rest for 4-5 minutes.",
        "In a separate pan, sauté spinach in a little butter until soft.",
        "Using the back of a slotted spoon, squeeze excess moisture out of spinach (discard) and keep spinach warm.",
        "Place spinach and potato on serving plate, slice duck and arrange in a fan shape around the spinach and potato.",
        "Drizzle sauce around the plate and serve."
    ],
    "tips": [
        
    ],
    "title": "Roast duck with rosti potatoes and sauce of rhubarb and red port",
    "videos": "[]"
}