{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "1 to 2 hours",
    "description": "Boulangère potatoes are a lighter version of dauphinoise and delicious served with roast chicken and a simple salad.",
    "dishes": [
        "jam",
        "oven-baked_dishes",
        "pie",
        "roast_chicken",
        "salad",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        "testing_cooked_poultry"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the boulangère potatoes": [
            "6 potatoes, peeled, sliced thinly",
            "4 onions, peeled, sliced thinly",
            "salt and freshly ground black pepper",
            "450ml/16fl oz chicken stock"
        ],
        "For the roast chicken": [
            "1kg/2lb 2oz free-range or organic chicken",
            "5 sprigs thyme",
            "40g butter"
        ],
        "For the salad": [
            "½ shallot, peeled, finely diced",
            "1 tsp Dijon mustard",
            "1 tbsp white wine vinegar",
            "3 tbsp olive oil",
            "salt and freshly ground black pepper",
            "2 Little Gem lettuces, leaves separated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "20",
    "serves": "4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the roast chicken, rub the butter and thyme leaves onto the skin of the chicken.",
        "For the boulangère potatoes, mix the potato and onion slices together in a bowl and season, to taste, with salt and freshly ground black pepper. Transfer the mixture to a large buttered ovenproof dish and pour over the stock.",
        "Transfer the dish to a rack in the lower part of the oven. Place the chicken directly onto the shelf above the potatoes so that any fat from the chicken drips onto the potatoes. Roast for 1½-2 hours, or until the potatoes are tender and golden-brown and the chicken is cooked. (The chicken is cooked through when the juices run clear when pierced in the thickest part with a skewer.) Once cooked, removed from the oven and set aside to rest for 10 minutes.",
        "For the salad, whisk shallot, mustard, vinegar and olive oil together in a bowl until well combined. season, to taste, with salt and freshly ground black pepper.",
        "Mix the Little Gem lettuce and salad dressing together in a bowl until well combined.",
        "To serve, carve the chicken into thick slices and place some onto each of four serving plates. Spoon the boulangère potatoes and salad alongside."
    ],
    "tips": [
        
    ],
    "title": "Roast chicken with with boulangère potatoes",
    "videos": "[]"
}