{
    "title": "Christmas turkey and stuffing",
    "cookTime": "1 to 2 hours",
    "prepTime": "1-2 hours",
    "serves": "Serves 10-12",
    "recommendations": "18",
    "images": [
        
    ],
    "description": "Gordon Ramsay shares a stunning traditional Christmas recipe of roast turkey with a breadcrumb and herb stuffing.",
    "author": {
        "gordon_ramsay": "Gordon Ramsay"
    },
    "show": {
        "p0077hx8": "The Nation's Favourite Food"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the herb butter": [
            "250g/9oz pack unsalted butter, softened",
            "3-4 sprigs fresh thyme, leaves only",
            "sprig of fresh rosemary, chopped leaves only",
            "2 tbsp fresh parsley leaves, chopped",
            "salt",
            "freshly ground black pepper",
            "5-6kg/11-13lb medium-sized turkey",
            "3 or 4 good quality, thick sausages, skins removed"
        ],
        "For the stuffing": [
            "125g/4½oz butter",
            "1 onion, finely chopped",
            "large sprig of thyme and rosemary, chopped leaves only",
            "200g/7oz white breadcrumbs",
            "6 fresh sage leaves",
            "1 lemon, zest only",
            "50g/2oz pine nuts",
            "1 tsp sea salt",
            "freshly ground black pepper",
            "3 tbsp fresh parsley, chopped"
        ],
        "For the gravy": [
            "1 onion or large shallot, chopped",
            "2 tbsp olive oil",
            "125ml/4fl oz dry white wine",
            "1 sprig fresh thyme",
            "1 bay leaf",
            "500ml/17fl oz chicken stock",
            "200ml/7fl oz double cream",
            "pan juices from roasting",
            "sea salt",
            "freshly ground black pepper"
        ]
    },
    "steps": [
        "Pre-heat the oven to 180C/350F/Gas 4",
        "Make the herb butter, mix herbs and butter together to form a paste, season well and chill.",
        "Prepare the turkey, to remove legs, cut through the skin and pull joint firmly away from body then cut through ball and socket joints.",
        "Cut away the 'oyster' on the back of the turkey so leg and thigh comes away cleanly.",
        "With a thin, sharp knife, bone both legs and stuff with sausage meat.",
        "Wrap tightly in tin foil and chill to set the shape.",
        "Prepare the crown, cut off wing tips and, for easier carving, take out the wishbone and cut away back bone with poultry shears.",
        "Lift up the breast skin with your fingers and separate it from the flesh.",
        "Divide the herb butter between the two breast flaps and pull the skin back over.",
        "Season well, place in a roasting tin and cover loosely with butter paper or foil.",
        "Cook the turkey, put the foil-wrapped legs in a roasting pan and cook at 180C/350F/Gas4 for 45 minutes. Reduce temperature to 160C/320F/Gas 2 and cook for a further 15 minutes then remove foil and cook for a further 30 minutes, straining off any juices for the gravy.",
        "Cook the crown for 1-1½ hours at 180C/350F/Gas 4 until juices run clear and let the bird rest for 30 minutes before carving.",
        "Make the stuffing, melt butter in a large frying pan and gently sauté onion for five minutes until soft.",
        "Stir in the herbs for one minute then add breadcrumbs to absorb butter.",
        "Mix in zest, pine nuts and seasoning and cook over medium heat for about seven minutes until crumbs start to brown and crisp.",
        "Take off the heat, mix in the parsley and serve warm.",
        "Make the gravy, sauté the onion in the olive oil for about five minutes. Pour in the wine, add the thyme and bay and boil until reduced right down.",
        "Add stock and boil until reduced by half then add cream and boil for further five minutes. Season with freshly ground black pepper.",
        "Remove from heat, cool for ten minutes and strain.",
        "Add turkey pan juices, boil for two minutes, season with salt and strain. (This can be made in advance and frozen before the juices are added. When thawed, simply heat until boiling and follow point 20.)"
    ],
    "howTos": [
        "making_herb_butter",
        "testing_cooked_poultry",
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}