{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Spanish",
    "description": "This simple summery dish is ready to eat in 20 minutes and offers a taste of Spain on your plate.",
    "dishes": [
        "baguette",
        "bread",
        "bun",
        "jam",
        "oven-baked_dishes",
        "pie"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "6 ripe tomatoes, cut into chunks",
            "4 sprigs fresh thyme, leaves only",
            "3 garlic cloves, crushed",
            "1 baguette, cut into cubes",
            "125ml/4½fl oz extra virgin olive oil",
            "8 sardines, gutted and cleaned, butterflied and filleted (ask the fishmonger to do this for you)",
            "4 fresh mackerel, gutted and cleaned, cut into large pieces (ask the fishmonger to do this for you)",
            "2 bunches radishes, trimmed",
            "1 tsp cumin seeds",
            "2 tbsp honey",
            "1 small bunch fresh basil, leaves only, torn",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "Place the tomatoes, thyme, garlic and baguette cubes into a roasting tray and drizzle over 75ml/2¾fl oz of the oil. Season, to taste, with salt and freshly ground black pepper. Transfer to the oven and roast until the baguette cubes are golden-brown around the edges. Remove the tray from the oven.",
        "Increase the oven temperature to its highest setting.",
        "Lightly grease a baking tray with a little oil and lay the sardines, mackerel and radishes onto it. Sprinkle over the cumin seeds and drizzle over the honey and 2 tablespoons of the remaining olive oil. Roast in the oven for 5-10 minutes, or until all of the fish is cooked through.",
        "Just before serving, sprinkle the basil over the tray of roasted tomatoes, bread, garlic and thyme. Crush the tomatoes lightly with the back of a fork.",
        "To serve, spoon the roasted tomato mixture onto serving plates and top each portion with some of the roasted sardines, mackerel pieces and radishes. Drizzle over the remaining olive oil."
    ],
    "tips": [
        "To butterfly the sardines yourself, stand each sardine on a chopping board with its stomach touching the board. Press down gently along the length of the fish so that the sides of the gutted fish splay out. Flip the fish over and open it out further, then slice through the back bone at the tail and head ends. Use your fingertips to peel the bones from the inside of the fish."
    ],
    "title": "Roasted sardines, mackerel and radishes",
    "videos": "[p03fggs4:p03fggs8]"
}