{
    "author": {
        "marcus_wareing": "Marcus Wareing"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Spanish",
    "description": "",
    "dishes": [
        "broth",
        "bun",
        "hotpot",
        "pie",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the broth": [
            "110g/4oz yellow split peas",
            "1 tbsp vegetable oil",
            "½ onion, finely chopped",
            "1 carrot, chopped into 1cm/½in cubes",
            "1 garlic clove, crushed to a paste",
            "½ leek, white part only, chopped into 1cm/½in pieces",
            "110g/4oz button mushrooms, finely chopped",
            "200g/7oz cooking chorizo, cut into 1cm/½in pieces",
            "50g/2oz semi-dried tomatoes, chopped",
            "1 tbsp tomato purée",
            "500ml/17½fl oz chicken stock",
            "½ tsp salt",
            "freshly ground black pepper, to taste",
            "1 bouquet garni (made with 2 bay leaves and ¼ bunch thyme tied together with kitchen string)"
        ],
        "For the monkfish": [
            "400g/14oz monkfish tail, trimmed",
            "1 tbsp smoked paprika",
            "1 tbsp salt",
            "1 tbsp vegetable oil",
            "50g/2oz unsalted butter",
            "200g/7oz cooking chorizo, sliced thinly on the diagonal"
        ],
        "To serve": [
            "¼ bunch flatleaf parsley, leaves only, chopped",
            "small handful coriander cress (available from specialist suppliers and online)",
            "extra virgin olive oil, to taste"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "4",
    "serves": "4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the broth, place the split peas into a small saucepan and top with cold water. Bring to a gentle simmer for about 10-12 minutes, or until partly cooked but still slightly crunchy. Drain and set aside.",
        "Meanwhile, gently heat the vegetable oil in a pan and add the onion, carrot, garlic, leek, mushrooms, chorizo and tomatoes. Gently fry to soften the vegetables, but not colour them.",
        "After five minutes, add the tomato purée, then add the stock, partly cooked yellow peas, salt, pepper and the bouquet garni.",
        "Simmer very gently for 25-30 minutes, or until the peas and the vegetables are completely cooked through.",
        "For the monkfish, cut the monkfish into 1cm/½in thick slices.",
        "Mix the smoked paprika and salt in a small bowl, then lightly dust the monkfish with the mixture.",
        "Heat a medium non-stick frying pan, add the oil, then add the butter to the pan. When the butter begins to foam, add the monkfish pieces.",
        "Fry the fish, spooning the butter over it as it cooks. Once the fish is cooked through, remove it from the pan and set aside on a warm plate. Discard half of the butter.",
        "Add the chorizo to the pan and cook until crisp.",
        "To serve, add the chopped parsley to the broth and stir through. Place 5-6 pieces of monkfish in the centre of each of four bowls. Place a few slices of cooked chorizo over the top then spoon over the broth. Garnish with the coriander cress and extra virgin olive oil, to taste."
    ],
    "tips": [
        
    ],
    "title": "Roasted monkfish and chorizo hotpot",
    "videos": "[]"
}