{
    "author": {
        "simon_hulstone": "Simon Hulstone"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "Verjus, fennel pollen and kibbled onions all feature in a deliciously-different recipe for halibut.",
    "dishes": [
        "sauce",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the halibut": [
            "2 x 110g/4oz halibut fillet",
            "1 tbsp olive oil",
            "2 slices iberico lardo",
            "1 tsp fennel pollen",
            "1 tbsp kibbled onions (dried onion flakes)",
            "1tbsp fresh chives, chopped finely",
            "1 tbsp fresh borage leaves"
        ],
        "For the parsnip purée": [
            "50g/2oz butter",
            "150g/5oz parsnips, finely chopped",
            "90ml/3½fl oz double cream"
        ],
        "For the verjus butter": [
            "50ml/2fl oz verjus du perigord",
            "50ml/2fl oz light chicken stock",
            "110g/4oz butter, chilled, cubed",
            "salt and freshly ground black pepper",
            "1 tbsp golden sultanas, chopped and soaked in 2 tbsp verjus",
            "¼ cucumber, peeled, finely chopped",
            "3 spring onions, finely sliced"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the parsnip purée, heat the butter in a saucepan and cook the parsnips for one minute on a high heat.",
        "Add the cream, bring the mixture to the boil then reduce the heat and simmer for five minutes or until the parsnips are tender. Blend the parsnip mixture in a blender until smooth.",
        "Pass the mixture through a fine sieve and into a clean pan, then season to taste with salt and freshly ground black pepper.",
        "For the verjus butter, pour the verjus and chicken stock into a saucepan and bring to a boil, continue to cook until the volume of the liquid is reduced by three-quarters.",
        "Remove the pan from the heat and whisk in the cubed butter until smooth and glossy. Season to taste with salt and freshly ground black pepper. Add the sultanas, cucumber and spring onion. Keep warm.",
        "Meanwhile for the halibut, season the fillets with salt and freshly ground black pepper.",
        "Pour 1 tbsp olive oil in a hot frying pan, add the seasoned halibut skin-side down and cook for 2-3 minutes, or until golden-brown. Turn the fish over and remove the pan from the heat.",
        "Place the fish onto a board or a plate and place a lardo slice on each fillet and carefully sprinkle the fennel pollen, kibbled onions, chives and borage on top.",
        "To serve, spoon the parsnip purée in the centre of serving plates and place the dressed halibut on top. Finish by pouring the sauce around the halibut and serve immediately."
    ],
    "tips": [
        
    ],
    "title": "Fillet of halibut with parsnip purée and a verjus and spring onion butter sauce",
    "videos": "[]"
}