{
    "author": {
        "glynn_purnell": "Glynn Purnell"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bun",
        "fondue",
        "oven-baked_dishes",
        "pie",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the brill:": [
            "2 suprême of brill (fillet pieces)",
            "50g/2oz plain flour",
            "olive oil, for rubbing onto the fish"
        ],
        "For the onion fondue:": [
            "50g/2oz butter",
            "1 medium large onion, sliced",
            "250g/9oz crème fraîche",
            "½ bunch of spring onions, shredded",
            "freshly ground black pepper",
            "½ bunch of chives, finely chopped"
        ],
        "For the scorched lettuce:": [
            "6 cos lettuce leaves",
            "salt and freshly ground black pepper",
            "1 bunch watercress",
            "8 whole baby leeks, blanched",
            "1 tbsp white wine vinegar",
            "½ lemon, juice only",
            "4 tbsp olive oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Dust the brill fillet with flour and then rub with a tablespoon of olive oil.",
        "Heat a dry ovenproof frying pan until hot, add the oiled brill and fry on each side until golden-brown then place in the oven for 4-5 minutes.",
        "Heat a separate frying pan until medium hot, add the butter and onions and cook until soft. Add the crème fraîche and spring onions and stir through. Season with pepper then add the chives. Remove from the heat and set aside until needed.",
        "Scorch the lettuce leaves with a chef’s blow torch then season with salt and freshly ground black pepper. Mix together with the watercress and blanched baby leeks.",
        "Whisk the white wine vinegar, half the lemon juice and the olive oil together in a bowl then season, to taste, with salt and freshly ground black pepper.",
        "Remove the brill from the oven, add a knob of butter and the remaining lemon juice to the pan and baste the fish with the juices.",
        "To serve, spoon some fondue of onion onto a plate and top with the brill fillet.",
        "Dress scorched lettuce, watercress and baby leeks with the vinaigrette and place around the brill."
    ],
    "tips": [
        
    ],
    "title": "Roast brill with scorched lettuce and fondue of onion with crème fraîche",
    "videos": "[]"
}