{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Italian",
    "description": "This delicious cannelloni recipe is perfect for a vegetarian main course. Each serving contains 587kcal, 32g protein, 32g carbohydrate (of which 10g sugars). 36g fat (of which 17g saturates), 2.5g fibre and 2.6g salt.",
    "dishes": [
        "cannelloni",
        "oven-baked_dishes",
        "pasta",
        "salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roasted_red_pepper_and_18166_16x9.jpg"
    ],
    "ingredients": {
        "For the cannelloni": [
            "500g/1lb 1oz ricotta",
            "300g/10½oz pecorino, grated, plus extra to serve",
            "6 roasted red peppers from a jar",
            "200g/7oz baby spinach",
            "salt and freshly ground black pepper",
            "12 fresh pasta sheets"
        ],
        "For the roasted tomatoes": [
            "400g/1lb cherry tomatoes, halved",
            "3 tbsp olive oil",
            "1 tbsp fresh thyme leaves",
            "dash balsamic vinegar",
            "2 garlic cloves",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "pecorino, shaved",
            "green salad leaves",
            "extra virgin olive oil",
            "balsamic vinegar"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "16",
    "serves": "Serves 6",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Place a roasting tin into the oven to preheat.",
        "Place the tomatoes into the roasting tin, drizzle over the olive oil and roast in the oven for 10 minutes.",
        "Add the thyme leaves, balsamic vinegar, garlic cloves and season with salt and freshly ground black pepper. Roast for a further 15 minutes.",
        "Remove the roasted tomatoes from the oven and keep warm. Reserve some of the olive oil to grease a large ovenproof dish big enough to hold all 12 cannelloni.",
        "Meanwhile for the filling, blend the peppers in a food processor until smooth. Place the peppers into a bowl with the ricotta, pecorino and spinach. Season with salt and freshly ground black pepper. Mix together until well combined.",
        "Lay out the fresh pasta sheets on a clean work surface. Spoon some of the pepper filling along the long edge of the pasta sheet. Roll it into a cylinder shape and place the cannelloni into the greased ovenproof dish. Repeat the process until all of the pasta sheets have been used.",
        "Scatter over the roasted tomatoes over and bake for 15 minutes, or until golden-brown on top and cooked through.",
        "Place shaved pecorino on the cannelloni and serve with a crisp green salad dressed with olive oil and balsamic vinegar."
    ],
    "tips": [
        
    ],
    "title": "Roasted red pepper and tomato cannelloni",
    "videos": "[]"
}