{
    "title": "Butternut squash soup with parsley purée",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6-8",
    "recommendations": "45",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roastedbutternutsqua_65608_16x9.jpg"
    ],
    "description": "Warm-up with our autumnal butternut soup recipe rich with added parmesan and parsley purée. This meal, if served as six portions, provides 259kcal, 5g protein, 22g carbohydrate (of which 14g sugars), 5g fat (of which 3g saturates), 6.5g fibre and 1.6g salt per portion.",
    "author": {
        "antony_worrall_thompson": "Antony Worrall Thompson"
    },
    "show": {
        
    },
    "tips": [
        "You can prepare the soup in advance and reheat it before serving. The parsley purée will keep in the fridge for up to a day, make sure the surface is covered with a layer of olive oil."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1.8kg/4lb wedges of butternut squash",
            "3 tbsp olive oil",
            "6 cloves garlic, 4 whole, unpeeled and 2 finely chopped",
            "2 sprigs of thyme",
            "Salt and freshly ground black pepper",
            "2 onions, finely chopped",
            "2 carrots, finely sliced",
            "2 sticks celery, finely sliced",
            "1 tbsp freshly chopped sage",
            "2 litres/3½ pints hot vegetable stock"
        ],
        "For the parsley purée": [
            "1 bunch flatleaf parsley, roughly chopped",
            "1 clove garlic, crushed",
            "30g/1oz parmesan, finely grated",
            "100ml/3½fl oz extra virgin olive oil",
            "Lemon juice, to taste"
        ]
    },
    "steps": [
        "Preheat the oven to 240C/475F/Gas 9.",
        "Cut the butternut squash (including skin) into 7cm/3in wedges and scoop out the seeds using a large spoon. Brush the wedges with 1 tbsp olive oil, place in a roasting tray and season with salt and pepper. Place in the oven and roast for 45 minutes or until soft and caramelised.",
        "After 25 minutes of cooking, add the unpeeled garlic and the sprigs of thyme.",
        "Meanwhile, heat the remaining olive oil in a large pan. Add the onions, carrots, celery, sage and remaining garlic and cook gently for 10-15 minutes until soft but not brown.",
        "Pour the stock into the vegetables, bring to the boil and simmer for 20 minutes or until the vegetables are tender.",
        "Allow the squash to cool for 5 minutes when cooked. Using a large spoon remove the flesh from the skin and add to the stock. Squeeze the roasted garlic from its skin into the stock and discard the thyme.",
        "Simmer the stock and vegetables for a further 5 minutes or until the squash is beginning to break up.",
        "Place the soup in a blender and blend until smooth. Return the soup to the pan and gently reheat. Check seasoning.",
        "For the parsley purée, place the chopped parsley into a food processor with the garlic and parmesan. Process until smooth. With the motor still running, slowly add the olive oil. Season with salt and pepper.",
        "Ladle the soup into bowls and top each with a spoonful of the parsley purée. Serve immediately with crusty bread."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}