{
    "author": {
        "galton_blackiston": "Galton Blackiston"
    },
    "cookTime": "over 2 hours",
    "description": "This succulent pork and potatoes dish is served with a truffle cream mousse that will require you to get those kitchen gadgets out of the cupboard. Equipment and preparation: for this recipe you will need a blender or a Thermomix, a gas canister gun and a large roasting tin.",
    "dishes": [
        "bun",
        "mousse",
        "oven-baked_dishes",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Jersey Royals": [
            "250g/9oz thumbnail-sized Jersey Royals, just given a little scrape",
            "1 sprig mint",
            "bunch wild garlic leaves, washed",
            "knob of butter"
        ],
        "For the truffle mousse": [
            "300ml/10½fl oz beef jus (or good-quality beef stock)",
            "600ml/20fl oz double cream, plus 2 tbsp to serve",
            "2 black truffles, chopped",
            "150ml/5fl oz truffle oil",
            "dash of cep aroma",
            "2 knobs of butter",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "broad beans"
        ],
        "default": [
            "1 whole suckling pig",
            "salt"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 6-8",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "Place the suckling pig in a roasting tin, and splash all over with cold water before liberally sprinkling with salt.",
        "Place the roasting tin as high up as you can in the preheated oven and roast without opening the oven door for about 45 minutes, by which time the skin should have started to crackle.",
        "Turn the oven down to 190C/375F/Gas 5, and continue to roast for a further two hours and 15 minutes. By now you should have good crackling and moist succulent meat. Check whether the meat is cooked properly with a skewer - the juices should run pink but not bloody. Remove from the oven and allow to rest for 10 minutes in a warm place before carving.",
        "For the truffle mousse, bring the beef jus up to the boil and add the cream, add the chopped truffle and allow to reduce until thickened.",
        "Add the truffle oil and bring to the boil again. Place everything into a Thermomix (or blender) and blend really well. Pass through a fine sieve and add the cep aroma.",
        "Place a good knob of butter and two tablespoons of double cream Into a gas canister gun. Pour in the hot truffle cream, add two chargers and keep warm in a bain marie until ready to serve.",
        "For the Jersey Royals, put the potatoes in a pan of cold water with a good sprig of mint and bring to the boil. Once cooked, drain then add butter, sea salt and pepper. Set aside and keep hot.",
        "At the last minute, fry the wild garlic in a moderately hot pan with butter and season.",
        "Serve some suckling pork on a plate with the truffle mousse, Jersey Royals and wild garlic on the side. Shelled broad beans, if desired, would be a good accompaniment as well."
    ],
    "tips": [
        
    ],
    "title": "Roast whole suckling pig with truffle mousse, Jersey Royals and wild garlic",
    "videos": "[]"
}