{
    "title": "Roast beetroot with goats’ cheese",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "15",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roast_beetroot_with_03767_16x9.jpg"
    ],
    "description": "Beetroot is roasted ‘en papillote’ here, which means it’s packed into a neat package of foil or parchment before being roasted in the oven. The juices are saved for the dressing, which goes beautifully with breadcrumbed French goats’ cheese.",
    "author": {
        "raymond_blanc": "Raymond Blanc"
    },
    "show": {
        "b036zkh2": "Raymond Blanc: How to Cook Well"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the beetroot": [
            "4 beetroot (about 480g/1lb 1oz), washed and trimmed",
            "2 tbsp extra virgin olive oil",
            "1 sprig fresh thyme",
            "1 garlic clove, crushed",
            "salt and freshly ground black pepper"
        ],
        "For the beetroot dressing": [
            "20g/¾oz reserved roasted beetroot juices",
            "1 tbsp extra virgin olive oil",
            "1 tsp red wine vinegar",
            "½ shallot, finely chopped",
            "2 pinches sea salt",
            "1 pinches freshly ground black pepper"
        ],
        "For the goats’ cheese": [
            "50g/1¾oz plain flour",
            "2 free-range eggs, beaten",
            "50g/1¾oz coarse breadcrumbs",
            "20g/½oz extra virgin rapeseed oil",
            "4 whole goats’ cheese, such as 4 crotins or ¼ ragstone cut into 4 pieces"
        ],
        "To finish the salad": [
            "1 chicory, cut into 12 through the root and placed in iced water",
            "1 tbsp finely chopped chives",
            "2 tbsp halved walnuts"
        ]
    },
    "steps": [
        "For the beetroot, preheat your oven to 160C/325F/Gas 3.",
        "Lay a double layer of foil (45 x 45cm/17½ x 17½in) onto a baking tray and top with the beetroot, oil, thyme, garlic and salt and freshly ground black pepper to taste.",
        "Wrap the beetroot in the foil to make a sealed package and roast in the oven for two hours.",
        "Once cooked, remove from the oven and allow to cool slightly before peeling. Reserve the juice that has collected in the foil for the dressing.",
        "Cut the beetroot into even pieces and reserve. (You may wish to use gloves to do this, to protect your hands from staining red.)",
        "For the beetroot dressing, whisk all the ingredients together with a splash of water to loosen. Taste and adjust the seasoning if necessary.",
        "To finish the salad, mix the dressing with the prepared beetroot and chicory leaves. Reserve.",
        "For the goats’ cheese, increase the oven temperature to 230C/450F/Gas 8.",
        "Place the plain flour onto a plate, the eggs into a shallow bowl, and mix the breadcrumbs with the oil in a separate bowl. Roll each cheese in the flour, then dip in the beaten egg and then in the oiled breadcrumbs to cover.",
        "Place the coated cheese rounds on a baking tray lined with greaseproof paper and bake in the oven for six minutes.",
        "To serve, arrange the beetroot salad in the centre of each of four plates, top with the hot goats’ cheese. Garnish with a few chopped chives and walnuts."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}