{
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A fresh salsa verde makes a light spring dinner of this traditional game bird which is now available year-round.",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "salsa",
        "upside-down_cake"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the roast guinea fowl": [
            "1 whole guinea fowl",
            "½ lemon",
            "2 garlic cloves, crushed",
            "1 sprig rosemary",
            "3 sprigs thyme",
            "2-3 knobs of butter"
        ],
        "For the spring green salsa": [
            "70g/2½oz spring greens, blanched",
            "25g/1oz mint, blanched",
            "25g/1oz parsley, blanched",
            "2 garlic cloves, chopped",
            "½ green chilli, deseeded and finely diced",
            "10g/⅓oz salted anchovies",
            "35g/1¼oz capers",
            "1 shallot, chopped",
            "1 tsp salt",
            "¼ tsp cayenne pepper",
            "1 lemon, zest only",
            "150ml/5½fl oz olive oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "steps": [
        "For the roast guinea fowl, preheat the oven to 180C/350F/Gas 4.",
        "Stuff the cavity of the guinea fowl with the lemon, crushed garlic, rosemary and thyme. Tie the bird using cook’s string to secure the cavity.",
        "Butter the skin of the bird and place in a roasting tin. Roast in the hot oven for 35 minutes, or until the leg juices run clear when pierced with a sharp knife.",
        "Remove from the oven and rest the bird upside down for around 25 minutes so that the juices relax back into the meat. Reserve any juices in the roasting tin.",
        "For the spring green salsa, blanch the greens, mint and parsley in boiling salted water for a few minutes until they soften. Drain and refresh in iced water, and drain again.",
        "Chop together the spring greens, mint, parsley, garlic, chilli, anchovies and capers. Transfer to a bowl along with the shallot, salt, cayenne pepper and lemon zest. Mix in the olive oil to make a rough salsa.",
        "To serve, carve the guinea fowl. Pour the reserved juices from the roasting tray back over the bird and also add some to the salsa. Serve the carved guinea fowl then spoon over the salsa."
    ],
    "tips": [
        
    ],
    "title": "Roast guinea fowl with spring green salsa",
    "videos": "[]"
}