{
    "title": "Roast wood pigeon breasts, mango salsa and red wine and sesame reduction",
    "cookTime": "over 2 hours",
    "prepTime": "1-2 hours",
    "serves": "Serves 4",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "",
    "author": {
        "will_holland": "Will Holland"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the orange sugar": [
            "1 orange, zest only",
            "110g/4oz demerara sugar"
        ],
        "For the mango salsa": [
            "1 large mango, peeled, cut into 0.5cm/¼in dice, trimmings reserved",
            "4 spring onions, finely diced",
            "2 red chillies, seeds removed, finely diced",
            "1 lime, zest and juice",
            "handful fresh coriander leaves, finely chopped",
            "2 tsp olive oil",
            "pinch salt",
            "pinch caster sugar"
        ],
        "For the mango purée": [
            "50g/1¾oz caster sugar",
            "50ml/2fl oz water",
            "mango trimmings, from above"
        ],
        "For the red wine and sesame reduction": [
            "1.5 litres/2 pint 12fl oz red wine",
            "35g/1¼oz caster sugar",
            "25ml/1fl oz sesame oil"
        ],
        "For the wood pigeon": [
            "4 wood pigeons crowns, cleaned",
            "salt",
            "2 tsp vegetable oil",
            "25g/1oz butter"
        ],
        "For the crisp leek": [
            "vegetable oil",
            "2 tbsp cornflour",
            "1 leek, white part only, julienned",
            "salt"
        ],
        "To serve": [
            "1 tbsp wasabi",
            "1 punnet coriander cress",
            "pinch sea salt"
        ]
    },
    "steps": [
        "For the orange sugar, dry the orange zest in a very low oven or an airing cupboard until completely dry.",
        "Grind 10g/½oz of the dried orange zest with the sugar in a spice grinder to a fine powder. Set aside.",
        "For the mango salsa, mix all of the mango salsa ingredients, except for the mango trimmings, together in a bowl until well combined. Set aside.",
        "For the mango purée, heat the sugar and water in a saucepan until boiling. Reduce the heat and simmer for 2-3 minutes, or until the mixture is syrupy. Remove the pan from the heat and set aside.",
        "Blend the mango trimmings in a food processor with enough of the sugar syrup to form a smooth purée.",
        "Pass the purée through a fine sieve and transer to a squeezy bottle.",
        "For the red wine and sesame reduction, heat the wine and sugar in a wide saucepan until boiling. Boil the mixture for 30-45 minutes, or until the volume of the liquid has reduced to 110ml/4fl oz of syrup.",
        "Pour the reduced wine into a jug and carefully whisk in the sesame oil. Transfer the red wine and sesame reduction to a squeezy bottle.",
        "For the wood pigeon, preheat the oven to 175C/350F/Gas 3½.",
        "Season the wood pigeon crowns, to taste, with salt.",
        "Heat the oil in an ovenproof frying pan and fry the wood piegon crowns, skin-side down, turning frequently, for 4-5 minutes, or until browned all over.",
        "Carefully turn the wood pigeon crowns over, sprinkle over the orange sugar and add the butter to the pan.",
        "Roast ithe pigeon in the oven for 4-6 minutes, (for medium) or until cooked to your liking. Remove the pan from the oven and set the pigeon aside to rest.",
        "Meanwhile, For the crisp leek, heat the oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
        "Sprinkle the cornflour onto a plate. Dredge the julienned leek in the cornflour and carefully place into the hot oil. Cook for 1-2 minutes, or until crisp and golden-brown. Using a slotted spoon, remove the crisp leek from the pan and set aside to drain on kitchen paper. Season, to taste, with salt.",
        "To serve, remove the 2 pigeon breasts from each pigeon crown and slice each breast into thick rounds.",
        "Using a small pastry brush paint a stripe of wasabi down the centre of each of 4 serving plates. spoon a line of mango salsa on top of the wasabi.",
        "Arrange the piegon breast slices on top of the salsa and sprinkle over sea salt, to taste. Place a few pieces of crisp leek on top of the pigeon breast.",
        "Squeeze a line of mango purée, parallel to the stripe of wasabi, on one side of the plate and squeeze another line of red wine and sesame reduction on the other side of the stripe of wasabi. Garnish each plate with a few sprigs of coriander cress."
    ],
    "howTos": [
        "julienne",
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}