{
    "title": "Roasted vegetable stack with griddled halloumi cheese",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "15",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roastedvegetablestac_86194_16x9.jpg"
    ],
    "description": "This seasonal vegetarian barbecue recipe is perfect for entertaining as it's easy to scale up or down.",
    "author": {
        "neneh_cherry_and_andi_oliver": "Neneh Cherry and Andi Oliver"
    },
    "show": {
        "b00728t5": "Neneh and Andi Dish It Up"
    },
    "tips": [
        "Griddle the halloumi at the last possible minute before serving, as it quickly turns rubbery once cooled."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the dressing": [
            "1 x 200ml/7fl oz pot low-fat crème fraîche",
            "½ handful fresh mint, finely chopped",
            "½ ruby grapefruit, juice and flesh",
            "salt and freshly ground black pepper, to taste"
        ],
        "For the vegetable stack": [
            "1 each red, green, and yellow sweet peppers, quartered, seeds removed",
            "1 medium aubergine, sliced",
            "1 medium courgette, sliced",
            "olive oil",
            "1 x 250g/9oz block halloumi cheese"
        ],
        "To serve": [
            "courgette flowers (if available)",
            "4 mint sprigs"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the dressing, mix the crème fraîche, mint, grapefruit juice and grapefruit flesh in a bowl until well combined. Add salt and freshly ground black pepper, to taste. Set aside until needed.",
        "For the vegetable stack, place the peppers, aubergine and courgette onto a baking tray, drizzle with olive oil and roast for 30-40 minutes, or until the vegetables are tender and slightly crisp on the outside. You can also grill the vegetables on a preheated barbecue, but watch them carefully so they do not burn. Set the vegetables aside.",
        "Cut the halloumi lengthways into eight slices. Brush a griddle pan with oil and place it over a medium heat. Add the halloumi to the griddle pan and cook for 20-30 seconds on each side, or until golden-brown griddle marks appear on both sides.",
        "To serve, place a slice of griddled halloumi onto each of four plates and stack alternate slices of the vegetables on top. Top with another slice of the halloumi. Serve the dressing alongside the vegetable stack. Garnish with a courgette flower (if using) and one of the mint sprigs."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}