{
    "title": "Roasted crown of pheasant with cavolo nero cabbage and chestnut 'stuffing'",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This easy roast dinner cooks in a fraction of the time of a normal roast as it uses pheasant crowns which provide the perfect portion for one.",
    "author": {
        "bryn_williams": "Bryn Williams"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the roast pheasant": [
            "1 tbsp olive oil",
            "4 pheasant crowns"
        ],
        "For the chestnut 'stuffing'": [
            "1 tbsp oil",
            "200g/7oz pancetta, diced",
            "100g/3½oz shelled hazelnuts",
            "100g/3½oz Japanese panko breadcrumbs",
            "4 sprigs fresh thyme, leaves only",
            "200g/7oz cooked chestnuts, grated"
        ],
        "For the cavolo nero": [
            "1 cavolo nero, cut lengthways",
            "1 tbsp butter"
        ],
        "For the mushrooms": [
            "1 tbsp butter",
            "400g/14oz wild mushrooms, cleaned"
        ]
    },
    "steps": [
        "For the roast pheasant with cavolo nero, preheat the oven to 200C/400F/Gas 6.",
        "Heat a large overproof pan and add the oil. Once hot, add the crowns and brown on all sides. Place in the oven to cook for eight minutes, or until the juices from the thickest part of the meat run clear when pierced with a skewer.",
        "For the chestnut stuffing, heat a medium frying pan and add the oil. Once hot add the pancetta and cook until crisp.",
        "Add the hazelnuts, panko breadcrumbs and thyme and cook for a couple of minutes. Add the chestnuts and keep warm.",
        "For the cavolo nero, heat a large pan of boiling water, add the cabbage, blanch for two minutes and then drain.",
        "Heat a large frying pan. Add the butter and cabbage and cook for a minute.",
        "For the mushrooms, in a separate pan, heat the butter and add the mushrooms. Cook for a couple of minutes.",
        "To serve, place the cabbage in the centre of each of four plates. Cut the breasts from the pheasant and place on top.",
        "Top with the stuffing and garnish with the mushrooms."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}