{
    "author": {
        "theo_randall": "Theo Randall"
    },
    "cookTime": "10 to 30 mins",
    "description": "This is a great way to cook red mullet because the fat from the fish melts into the potatoes and makes them taste delicious, as well as giving them a lovely colour and crisp texture.",
    "dishes": [
        "charlotte",
        "oven-baked_dishes"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "12 Charlotte potatoes, peeled",
            "1 large fennel bulb",
            "2 tbsp extra virgin olive oil, plus extra for drizzling",
            "2 whole red mullets, scaled and filleted",
            "2 heaped tbsp pitted black olives, preferably taggiasca",
            "1 tbsp capers in vinegar, drained",
            "2 tbsp chopped parsley",
            "200g/7oz datterini or cherry tomatoes, cut in half",
            "squeeze lemon juice",
            "sea salt and freshly ground black pepper",
            "extra virgin olive oil, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6. Cook the potatoes in a pan of boiling salted water for about 10 minutes until just tender. Drain and set aside until cool enough to handle. Cut into 5mm slices.",
        "While the potatoes are cooking, cut the fennel bulb vertically in half, then cut each half into 1cm half-moon slices. Cook the fennel in another pan of boiling salted water for about 5 minutes until tender, then drain.",
        "Heat the olive oil in a large ovenproof frying pan and fry the potato slices until they start to colour. Add the fennel and fry for a minute longer.",
        "Season the mullet fillets with salt and pepper, then place skin-side up on top of the potatoes and fennel. Scatter the olives, capers, parsley and tomatoes over the fish. Transfer the pan to the oven and roast for 5 minutes.",
        "Remove from the oven and finish with a squeeze of lemon and drizzle of extra virgin olive oil. Serve immediately."
    ],
    "tips": [
        
    ],
    "title": "Roast red mullet fillet with Charlotte potatoes, fennel, olives and capers",
    "videos": "[]"
}