{
    "title": "Roasted salt and pepper pears with walnut and gorgonzola salad",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "over 2 hours",
    "serves": "Serves 6",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "This starter is packed with delicious flavours, a great one for sharing. Savoury roasted pears with homemade focaccia, prosciutto and a walnut and gorgonzola salad.",
    "author": {
        "lesley_waters": "Lesley Waters"
    },
    "show": {
        "b01rycym": "Chefs: Put Your Menu Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the focaccia loaf": [
            "340g/12oz strong white bread flour",
            "1 x 7g packet dried yeast",
            "1 tsp sea salt, plus extra for the topping",
            "3 tbsp olive oil, plus extra to drizzle",
            "about 250-300ml/9-10fl oz warm water",
            "5-6 sprigs rosemary, leaves only"
        ],
        "For the pears": [
            "6 ripe pears, such as Conference",
            "2 tsp cracked black pepper",
            "6 tsp caster sugar",
            "1 tsp sea salt",
            "5 tbsp cider vinegar",
            "2 tbsp olive oil"
        ],
        "To serve": [
            "large handful wild rocket leaves",
            "50ml/2fl oz extra virgin olive oil",
            "salt and freshly ground black pepper",
            "100g/3½oz walnut halves, toasted and broken into pieces",
            "200g/7oz gorgonzola cheese, broken roughly into bite-sized chunks",
            "12 slices prosciutto"
        ]
    },
    "steps": [
        "For the focaccia, in a large bowl stir together the flour, yeast and salt (being careful not to put the yeast into direct contact with the salt at the start of mixing). Mix together the olive oil and water in a separate bowl.",
        "Add enough of the oil and water mixture to bring the dry ingredients together to form a soft dough. Turn out onto a lightly floured work surface and knead for 10 minutes, or until smooth and elastic.",
        "Place the dough in a lightly oiled, large bowl. Cover and leave in a warm place for about 1½ hours, or until doubled in size.",
        "Preheat the oven to 220C/425F/Gas 7",
        "When the dough has risen, knead it again to ‘knock it back’ and shape into a rough circle, approximately the size of a large dinner plate using a rolling pin and your hands. Place on a baking tray, cover with a cloth and allow to prove until 1½ times its original size. When proved, use your fingertips to form dimples in the dough. Brush with a little olive oil and sprinkle with sea salt and rosemary sprigs.",
        "Bake in the oven for 10 minutes, and then reduce the heat to 190C/375F/Gas 5 for a further 25-30 minutes, or until golden-brown and cooked. Place on a wire rack to cool slightly.",
        "This bread is best eaten warm and on the day that you bake it. (Do not refrigerate it.)",
        "For the pears, peel the pears, cut them in half and core them. Lay in a roasting tray, cut-side up. Mix the pepper, sugar and salt in a small bowl. Scatter this mixture over the pears.",
        "Drizzle over the cider vinegar, olive oil and two tablespoons water.",
        "Roast in the oven for 25 minutes. Remove the tray from the oven and turn the pears over, drizzle over a further three tablespoons of water and return to the oven for 15-20 minutes, or until the pears are golden-brown and tender.",
        "To serve, arrange the rocket leaves on a serving plate. Mix the olive oil and seasoning in a bowl and drizzle over the leaves. Scatter over the walnut pieces and arrange the cheese on top. Serve the pears warm alongside and drizzle with the roasting juices. Arrange two slices of prosciutto alongside and serve with the warm focaccia bread."
    ],
    "howTos": [
        "kneading_bread_with_oil"
    ],
    "videos": "[]"
}