{
    "author": {
        "tony_tobin": "Tony Tobin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "",
    "dishes": [
        "bread",
        "gravy",
        "oven-baked_dishes",
        "roast_beef",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the beef": [
            "½ tsp Maldon sea salt",
            "¼ tsp freshly ground black pepper",
            "1 tsp finely chopped fresh rosemary",
            "600g/1lb 5oz Chateaubriand beef (also called filet mignon)",
            "2 tbsp olive oil"
        ],
        "For the potato bread": [
            "450g/1lb potatoes, boiled and puréed",
            "110g/4oz plain flour, plus 4 tbsp for cooking",
            "30g/1oz butter, softened plus extra for cooking",
            "1 tbsp baking powder",
            "1 tbsp horseradish sauce",
            "½ garlic clove",
            "25g/1oz butter"
        ],
        "For the roasted root vegetables": [
            "2 carrots, peeled and cut into 3cm/1in chunks",
            "2 parsnips, peeled and cut into 3cm/1in chunks",
            "2 turnips, peeled and cut into 3cm/1in chunks",
            "1 small sweet potato, peeled and cut into 3cm/1in chunks",
            "150g/5oz butter, plus extra for frying",
            "2 tbsp honey"
        ],
        "To serve": [
            "150ml/5fl oz red wine gravy"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "2",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the beef, heat the oven to 230C/450F/Gas 8 and place a roasting tray inside.",
        "Mix the salt, black pepper and rosemary together in a bowl, then rub the beef with the mixture.",
        "Heat a frying pan over a high heat until hot. Add the oil and beef and fry for 15-20 seconds on each side, until golden-brown all over.",
        "Transfer the beef to the hot roasting tray in the oven and roast for 20-25 minutes (or until cooked to your liking), turning the beef every eight minutes. Remove from the oven, loosely cover with kitchen foil, and leave to rest in a warm place for 15 minutes.",
        "For the potato bread, place the potato, flour, butter, baking powder, horseradish sauce and garlic into a clean bowl and mix thoroughly to combine as a dough.",
        "Dust the bottom of a frying pan with a thin layer of plain flour and place over a medium heat.",
        "Divide the potato bread dough into four equal-sized rounds. Flatten the rounds into patties and place into the hot floured pan to cook for 2-3 minutes on each side, or until golden-brown all over.",
        "Place a little butter into a clean frying pan over a medium heat. When the butter has melted add the potato breads and fry for 1-2 minutes on each side, or until heated through.",
        "For the root vegetables, place the carrots, parsnips, turnips and sweet potato into a large pan of boiling water. Bring the water back to the boil and cook the vegetables for two minutes. Drain the vegetables and transfer to a clean roasting tray. Add the butter and honey and season well with salt and freshly ground black pepper.",
        "Stir the vegetables to combine the ingredients, then place into the oven to roast for 10-15 minutes, or until golden-brown and tender.",
        "To serve, carve the beef into slices and place along the centre of a warmed oval serving dish. Arrange the roasted root vegetables and potato breads around the beef. Serve with red wine gravy."
    ],
    "tips": [
        
    ],
    "title": "Roast beef with horseradish potato bread and roasted root vegetables",
    "videos": "[]"
}