{
    "author": {
        "valentine_warner": "Valentine Warner"
    },
    "cookTime": "over 2 hours",
    "description": "Forget about carving this easy slow-cooked pot roast – pull the fragrant, tender lamb from the bone, rustic style.",
    "dishes": [
        "bun",
        "casserole",
        "oven-baked_dishes",
        "pie",
        "roast_lamb",
        "slow-cooked_dishes"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/roastshoulderoflambw_89776_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1.4kg/3lb shoulder of lamb, trimmed",
            "handful dried camomile (or contents of 4 camomile teabags)",
            "½ bunch fresh thyme, leaves only",
            "4 sprigs fresh rosemary, leaves only",
            "12 fresh sage leaves, roughly chopped",
            "1 tbsp dried oregano",
            "salt and freshly ground black pepper",
            "1 lemon, juice only",
            "1 tbsp good Greek or wild flower clear honey",
            "2 tbsp olive oil",
            "125ml/4fl oz water"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "83",
    "serves": "Serves 4",
    "show": {
        "b00lpbxs": "What to Eat Now"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "With the tip of a sharp knife, make shallow scores through the outer layer of skin and fat of the lamb shoulder, but not into the meat, cross-hatching the entire surface.",
        "Mix the dried camomile, the thyme, rosemary, sage and oregano together in a bowl. Season well with salt and freshly ground black pepper.",
        "Press a handful of the herb mixture into the skin of the lamb, massaging it in well all over the flesh of the lamb.",
        "Sprinkle some of the herb mixture across the bottom of a casserole with a lid. Place the lamb into the casserole, then squeeze the lemon juice over the top, before sprinkling with any remaining herb mix.",
        "Drizzle the honey over the top of the lamb and pour over a little olive oil.",
        "Pour the water into the casserole, then put the lid on. Transfer to the oven and cook for 2½ hours. Check the dish after one hour - the lamb should be taking on a little colour. If the water has evaporated, add a little more to maintain the dish's moisture.",
        "After the 2½ hours cooking the lamb meat should pull away easily from the bone.",
        "Remove from the oven and allow to rest for 4-5 minutes.",
        "To serve, using a knife and fork, pull large pieces of meat away from the bone and arrange on a large serving place. Drizzle the meat with any pan juices and allow guests to help themselves."
    ],
    "tips": [
        
    ],
    "title": "Roast shoulder of lamb with herbs and honey",
    "videos": "[]"
}