{
    "title": "Roasted guinea fowl with parsnip purée, blackberry sauce and cobnuts",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "For a Sunday roast with a difference give guinea fowl a try, top with homemade blackberry sauce for a mouthwatering meal.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the roasted guinea fowl": [
            "1 guinea fowl",
            "2 tbsp olive oil",
            "75g/2¾oz butter"
        ],
        "For the parsnip purée": [
            "500g/1lb 2oz parsnips, peeled and cut into even chunks",
            "500ml/18fl oz full-fat milk"
        ],
        "For the blackberry sauce and cobnuts": [
            "50g/1¾oz unsalted butter",
            "1 shallot, thinly sliced",
            "1 garlic clove",
            "5 sprigs fresh thyme, leaves only",
            "½ fresh bay leaf",
            "1 tbsp caster sugar",
            "150ml/5fl oz chicken stock",
            "150g/5½oz fresh blackberries"
        ],
        "For the cavolo nero": [
            "75g/2¾oz butter",
            "1 head cavolo nero, stalks removed and leaves finely chopped"
        ],
        "To garnish": [
            "100g/3½oz cobnuts, roasted and chopped"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "For the guinea fowl, heat a large frying pan and add the oil and butter. Once hot, add the bird and sear all over.",
        "Put the guinea fowl in a roasting tray and transfer to the oven. Roast for 35-40 minutes until the juices run clear when a skewer is inserted into the thickest part of the thigh.",
        "Meanwhile, place the parsnips in a large saucepan and add the milk. Cook for 8-12 minutes. Drain the parsnips, reserving the milk. Put the parsnips in a blender and blend until smooth, gradually adding the milk, until you achieve a smooth purée.",
        "For the blackberry sauce, heat the butter in a saucepan over a medium heat. When the butter is foaming, add the shallot, garlic and thyme and fry for 2 minutes until softened. Add the remaining sauce ingredients, except the blackberries, and cook, stirring well, for 5-8 minutes until the sauce has thickened. Just before serving add the blackberries.",
        "For the cavolo nero, heat a sauté pan and add the butter, once hot add the calvero nero and a little water. Cook until wilted.",
        "Remove the breasts from the guinea fowl. Divide the purée between 2 serving plates and top with the guinea fowl breasts. Place the cavolo nero on the side and spoon over the blackberry sauce. Garnish with cobnuts and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}