{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "",
    "dishes": [
        "jam",
        "marmalade",
        "oven-baked_dishes"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the cod": [
            "4 x 200g/7oz cod fillet, skin-on",
            "salt and freshly ground black pepper",
            "2 tbsp olive oil"
        ],
        "For the dressing": [
            "2 green peppers, roughly chopped",
            "125ml/4½fl oz water",
            "1 punnet micro cress",
            "1 punnet fennel tops",
            "1 tbsp olive oil"
        ],
        "For the kumquat marmalade": [
            "1 tbsp sunflower oil",
            "1 red onion, sliced",
            "4cm/1½ inch cinnamon stick, snapped in half",
            "500g/1lb 2oz kumquats, sliced in half",
            "75g/3oz light brown sugar",
            "125ml/4½fl oz sherry vinegar"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the kumquat marmalade, place a heavy-based pan on a moderate heat, and when hot, add the sunflower oil, followed by the red onion. Fry for 2-3 minutes until the onion has softened.",
        "Add the cinnamon to the pan and continue frying for a further two minutes.",
        "Tip in the kumquats and cook for 3-4 minutes, until just beginning to soften.",
        "Add the brown sugar and pour over the vinegar.",
        "Cover, and simmer for 8-10 minutes, until the kumquats have completely softened and lost their shape.",
        "Remove the lid and continue boiling for a further 6-8 minutes until the juices have cooked down and the marmalade has thickened.",
        "Remove the pan from the heat and leave to cool.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "Season the cod with salt and black pepper.",
        "Heat a frying pan until hot then add the olive oil and cod, skin-side down.",
        "Cook for two minutes then place in the oven for 5-8 minutes until cooked through.",
        "Meanwhile, to make the green pepper dressing, place the peppers and water into a food processor and blend to a purée.",
        "Strain the mixture through a tea towel into a clean pan.",
        "Place the pan on the heat and bring to a boil.",
        "Reduce the heat and simmer for five minutes until the mixture has thickened.",
        "Place the micro cress and fennel tops into a bowl and toss with the olive oil, salt and black pepper, to taste.",
        "To serve, spoon the kumquat marmalade into the centre of four plates. Place the cod on top and sprinkle the micro cress around the plate. Finish with a drizzle of green pepper dressing."
    ],
    "tips": [
        
    ],
    "title": "Roasted cod with kumquat marmalade and green pepper dressing",
    "videos": "[]"
}