{
    "author": {
        "allegra_mcevedy": "Allegra McEvedy"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "British",
    "description": "A roasted leg of lamb is always a treat but it's even better when studded with garlic and served with fresh mint sauce.",
    "dishes": [
        "bun",
        "oven-baked_dishes",
        "roast_lamb",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the mint sauce": [
            "1 tbsp caster sugar",
            "3 tbsp white wine vinegar",
            "6 sprigs mint, leaves only, finely chopped"
        ],
        "default": [
            "2kg/4lb 8oz leg of lamb",
            "1 bulb garlic",
            "large bunch rosemary",
            "sea salt and black pepper",
            "2 carrots, roughly chopped",
            "3 white onions, quartered",
            "250ml/9fl oz dry white wine",
            "olive oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "11",
    "serves": "Serves 4-6",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Use a small, sharp knife to make 12-14 slits all over the lamb. Peel two garlic cloves and slice them into shards. Roughly squash the remaining garlic and put into the bottom of a large roasting tin.",
        "Push a few slivers of garlic and small sprigs of rosemary down into each slit in the lamb and season with plenty of salt and pepper.",
        "Put the carrots and onions into the roasting tin, drizzle with olive oil and season with salt and pepper. Lay the lamb on top and roast in the preheated oven for 45 minutes.",
        "For the mint sauce, mix together the sugar and vinegar until the sugar is dissolved. Add the mint and mix well. Season with salt and pepper and transfer to the fridge to steep.",
        "Remove the lamb from the oven, pour in the wine then return to the oven and roast for a further 45 minutes.",
        "When cooked, remove the lamb from the oven and transfer to a board. Cover with foil and leave to rest for 15- 20 minutes.",
        "Carve the lamb into thin slices and serve with the mint sauce and roasted vegetables."
    ],
    "tips": [
        
    ],
    "title": "Roast leg of lamb with rosemary and garlic",
    "videos": "[p018g867:p018g86g]"
}