{
    "title": "Roasted strawberry and black pepper scones",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Makes 10",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "Roasting strawberries intensifies the flavour and it forms the fruity note in these delicious scones.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the strawberries": [
            "400g/14oz small strawberries, hulled and halved",
            "2 tsp caster sugar",
            "1 tsp freshly ground black pepper"
        ],
        "For the scones": [
            "500g/1lb 2oz self-raising flour, plus extra for rolling",
            "50g/2oz caster sugar",
            "½ tsp fine sea salt",
            "100g/3½oz cold butter, cubed",
            "300ml/10fl oz full-fat milk, plus extra for brushing",
            "clotted cream, to serve"
        ]
    },
    "steps": [
        "Preheat the oven to 120C/250F/Gas ½.",
        "Place the strawberries on a baking tray lined with greaseproof paper. Sprinkle over the sugar and season with lots of freshly ground black pepper. Roast very slowly in the oven for 1½ hours. Remove from the oven and set aside to cool.",
        "Increase the oven temperature to 200C/400f/Gas 6.",
        "For the scones, put the flour, sugar, salt and butter in a large bowl with the salt and a couple of twists of freshly ground black ground black pepper. Rub the butter into the flour until the mixture resembles coarse breadcrumbs.",
        "Place the dried strawberries into the flour mixture. Add the milk, stirring constantly with a wooden spoon until the mixture comes together and forms a soft, spongy dough.",
        "Turn out onto a well floured surface and knead lightly. Roll until 2cm/¾in thick and cut into 7cm/3in rounds with a deep, plain biscuit cutter. Re-knead and roll the dough as necessary. (You will need to press firmly to cut through any strawberries at the edge of each scone but try not to twist or the scones won’t have straight sides.)",
        "Place the scones on a baking tray lined with greaseproof paper and brush the surface of each one with milk, making sure none drips down the sides. Bake in the centre of the oven for about 15 minutes or until well risen and golden brown.",
        "Serve warm, cut in half and spread with clotted cream."
    ],
    "howTos": [
        "egg_wash"
    ],
    "videos": "[]"
}