{
    "title": "Roasted pheasant salad with pancetta, chestnuts and pomegranate",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "Pheasant is a wonderful meat to use in this flavour-packed salad - if you can't get hold of the unusual salad leaves any good-quality leaves will do.",
    "author": {
        "theo_randall": "Theo Randall"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1kg/2lb 4oz whole ready-to-roast hen pheasant",
            "6 slices pancetta",
            "2 sprigs fresh thyme",
            "1 tbsp vegetable oil",
            "50ml/2fl oz dry Marsala wine",
            "1 head of tardivo radicchio rosso di Treviso, leaves separated",
            "¼ head of castelfranco radicchio, leaves separated",
            "1 bunch dandelion leaves",
            "1 tbsp aged balsamic vinegar",
            "3 tbsp olive oil",
            "1 pomegranate, seeds only",
            "4 leaves fresh mint, chopped",
            "10 whole chestnuts, cut in half and boiled until soft inside",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 160C/140C Fan/Gas 3",
        "Wrap the pheasant in the pancetta and stuff the cavity with thyme. Heat the vegetable oil in an ovenproof pan, or a roasting tin. When hot, brown the pheasant on all sides.",
        "Add the Marsala to the pan then roast for 40 minutes.",
        "Remove from the oven and leave to rest for 10 minutes.",
        "Pour the roasting juices into a bowl, skim off any excess fat, and reserve. Remove the pancetta and reserve.",
        "Remove the breasts and legs from the pheasant. Peel off the skin and cut around the leg bones to remove as much meat as possible. Tear the meat into pieces and add them to the reserved juices. Season with salt and pepper and set aside.",
        "Put the radicchio and dandelion leaves into a large bowl. Mix the balsamic vinegar and olive oil to make a dressing. Season with salt and pepper.",
        "Toss the salad with the dressing and place on a large serving plate.",
        "Scatter over the pieces of pheasant with the juice.",
        "Scoop out the insides of the chestnuts and place them on top. Add the pomegranate seeds and mint. Finally chop the reserved pancetta and sprinkle over the top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}