{
    "title": "Roast sirloin served with a fricassée of girolle mushrooms in a red wine sauce",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Try something new for Sunday lunch with our recipe for roast beef with mushrooms and a red wine gravy.",
    "author": {
        "john_burton_race": "John Burton Race"
    },
    "show": {
        "b01rycym": "Chefs: Put Your Menu Where Your Mouth Is"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the red wine sauce": [
            "1kg/2lb 4oz beef bones",
            "1 carrot, roughly chopped",
            "2 sticks celery, roughly chopped",
            "1 onion, roughly chopped",
            "1 x 750ml bottle red wine",
            "1 litre/1¾ pint chicken stock",
            "salt and freshly ground black pepper",
            "1 tbsp butter"
        ],
        "For the roast beef": [
            "800g/1lb 12oz sirloin, in a piece",
            "olive oil"
        ],
        "For the mushrooms": [
            "200g/7oz wild mushrooms",
            "1 tbsp olive oil",
            "40g/1½oz butter",
            "2 tbsp chopped parsley"
        ],
        "For the potatoes": [
            "8 medium waxy potatoes, peeled and turned",
            "1.2 litres/2 pints double cream (enough to cover)",
            "6 garlic cloves, peeled"
        ],
        "For the beans": [
            "25g/1oz butter",
            "1 shallot, finely chopped",
            "200g/7oz green beans, trimmed, blanched and refreshed"
        ]
    },
    "steps": [
        "Preheat the oven to 220/425F/Gas 7.",
        "For the red wine sauce, place the beef bones into a roasting tray and roast in the oven for 45 minutes or until browned all over.",
        "Remove from the oven and place in a large pan with the chopped onion, carrot and celery. Pour in the red wine and chicken stock, bring to a very low simmer for two hours. Strain the sauce and place back in a pan. Simmer until the sauce is a syrupy consistency. Season with salt and pepper, and whisk in the butter to add shine.",
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the roast beef, place the beef in a deep baking tray, drizzle with olive oil then season well with salt and pepper. Place in the oven and roast for 35-40 minutes then remove from the oven and place on a rack and allow to rest.",
        "For the mushrooms, heat the butter and oil in a large frying pan until foaming, then add the mushrooms, frying until lightly browned. Season with salt and pepper and stir through the parsley.",
        "For the potatoes, add the potatoes to a pan of boiling water and simmer for five minutes until par-boiled. Drain.",
        "Place the drained potatoes into a large pan with the cream and garlic. Simmer gently until the potatoes are tender, then season with salt and white pepper.",
        "For the beans, heat a little butter in a frying pan. Add the shallot and cook for a minute then add the beans. Fry for 1-2 minutes until warmed through, then season with salt and pepper.",
        "To serve, carve the beef into thin slices and serve with the mushrooms, potatoes and green beans. Finally drizzle with a little of the red wine sauce."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}