{
    "title": "Roasted courgettes stuffed with mushroom mousse",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 20",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "Use up a seasonal glut of courgettes with Simon Rimmer's delicious waste-not-want-not canapés.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "4 courgettes",
            "drizzle olive oil",
            "salt and freshly ground black pepper"
        ],
        "For the mousse filling": [
            "2 tbsp olive oil",
            "½ onion, peeled, finely chopped",
            "200g/7¼oz mushrooms, sliced",
            "1 tbsp chopped fresh rosemary",
            "1 tbsp chopped fresh parsley",
            "100g/3½oz cream cheese",
            "10 asparagus spear tips, blanched, cut in half lengthways",
            "1-2 tbsp roasted hazelnuts, crushed"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Trim the courgettes and cut each into five thick, equal-sized slices. Lay the slices on a baking tray. Using a melon baller or teaspoon, scoop a little of the courgette flesh from the top of each slice of courgette.",
        "Place the courgette slices onto a baking tray, drizzle with the oil and season, to taste, with salt and freshly ground black pepper. Roast in the oven for 10-12 minutes, or until they're soft but still retain their shape.",
        "For the filling, heat one tablespoon of the oil in a non-stick frying pan over a medium heat. Fry the onion for 4-5 minutes, or until caramelised, then remove from the heat.",
        "Heat the remaining tablespoon of oil in a separate frying pan over a medium heat. Fry the mushrooms with the chopped rosemary and parsley for 4-5 minutes, or until softened. Drain off the liquid.",
        "Blend the cooked onion, mushrooms and herbs and the cream cheese in a food processor to a smooth purée. Transfer the mixture to a piping bag.",
        "Arrange the roasted courgette slices on a serving platter. Pipe a little of the mushroom mousse into the hollowed-out part of each slice of courgette. Top the mushroom mousse with the asparagus tips. Sprinkle over the crushed hazelnuts and serve."
    ],
    "howTos": [
        "using_piping_bags"
    ],
    "videos": "[]"
}