{
    "author": {
        "andrew_fairlie": "Andrew Fairlie"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "French",
    "description": "This recipe requires skill and effort, but the results are well worth it.",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the ground spices": [
            "¼ cinnamon stick",
            "1 tbsp coriander seeds",
            "1 tbsp cloves",
            "2 tbsp black peppercorns",
            "1 tbsp quatre épices",
            "1 tbsp coarse sea salt"
        ],
        "For the kale and ceps": [
            "150g/5oz kale, tough stalks removed, shredded",
            "150g/5oz small ceps",
            "2 tbsp groundnut oil",
            "50g/2oz butter"
        ],
        "For the marinade": [
            "2 garlic cloves, peeled, sliced",
            "8 black peppercorns, crushed",
            "½ tsp thyme leaves",
            "4 plump juniper berries, crushed",
            "1 fresh bay leaf, shredded",
            "1 tbsp coarse sea salt",
            "pinch caster sugar",
            "300g/11fl oz duck fat, melted"
        ],
        "For the sauce": [
            "1 small carrot, diced",
            "1 shallot, chopped",
            "1 celery stalk, chopped",
            "1 fresh thyme sprig",
            "110ml/4fl oz port",
            "150ml/5fl oz chicken stock or veal stock"
        ],
        "For the squab": [
            "4 x 450g/1lb Anjou squab pigeons",
            "4 tbsp groundnut oil",
            "50g/2oz butter"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the squabs, remove the legs from the squab and set aside.",
        "Carefully remove the wishbones from the birds, break the backbone and remove, leaving the crown intact.",
        "Mix all the ingredients for the marinade together except the duck fat.",
        "Spread half the marinade into the bottom of a shallow dish, place the squab legs on top and cover with the remaining mixture.",
        "Leave to marinade for 3-4 hours. Wash all the marinade off the legs and pat them dry with kitchen paper.",
        "Place the legs in a single layer into a shallow pan, pour over the duck fat and poach very gently for 1½ hours, or until the legs are meltingly tender. Allow the legs to cool in the fat.",
        "Remove the legs from the fat and using a small sharp knife, remove the thighbone.",
        "For the ground spices, toast the cinnamon, coriander seeds, cloves and peppercorns in a frying pan over a gentle heat until aromatic.",
        "Blend the spices in a spice grinder, then sieve into a small bowl. Stir in the quatre épices and salt.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "Season the crowns with the spice mixture",
        "Heat the oil in an ovenproof frying pan over a medium-high heat, and brown the squab crowns, skin-side down. Roast in the oven for 12-14 minutes.",
        "Remove the pan from the oven, add the butter to the pan, allow it to foam then baste the birds for one minute.",
        "Remove the birds from the pan; place onto a wire rack and re-season with the spice mixture.",
        "For the sauce, add the chopped vegetables and thyme to the roasting pan and cook for a few minutes scraping any pieces stuck to the bottom of the pan.",
        "Drain any fat remaining in the pan, then add the port and reduce to a syrup. Add the stock and reduce by half. Strain the sauce through a fine sieve, season with salt and freshly ground black pepper and keep warm.",
        "For the kale and ceps, heat a saucepan over a medium heat, add the ceps and cook till they start to colour, then add the curly kale and wilt. Add the butter and season with salt and freshly ground black pepper.",
        "Fry the squab legs, skin-side down, in a frying pan until the skin is crisp.",
        "To serve, spoon the kale and ceps onto serving plates, remove the breasts from the crowns and place on top. Place the squab legs on top and drizzle with the sauce."
    ],
    "tips": [
        
    ],
    "title": "Roasted breast and confit leg of spiced Anjou squab",
    "videos": "[]"
}