{
    "author": {
        "nic_watt": "Nic Watt"
    },
    "cookTime": "1 to 2 hours",
    "description": "Salmoriglio is a classic Sicilian sauce that goes brilliantly with roast or grilled meats. Use plenty of lemon juice to cut through the richness of the lamb.",
    "dishes": [
        "bun",
        "oven-baked_dishes",
        "roast_lamb",
        "sauce",
        "slow-cooked_dishes"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the almond croquettes": [
            "oil, for frying",
            "2 large potatoes, baked in their skins",
            "2 cloves confit garlic (garlic slow-roasted or braised in olive oil)",
            "2 tbsp chopped flat leaf parsley",
            "pinch fresh grated nutmeg",
            "2 free-range eggs, yolks only",
            "115g/4oz plain flour",
            "3 free-range eggs, beaten",
            "115g/4oz flaked almonds, chopped"
        ],
        "For the lamb": [
            "1 small salt marsh lamb leg, French trimmed",
            "1 small bunch rosemary, sprigged",
            "6 garlic cloves, cut into slivers",
            "sea salt and freshly ground black pepper"
        ],
        "For the sauce": [
            "4 sprigs flat leaf parsley, leaves picked",
            "2 tbsp chopped oregano leaves",
            "4 tbsp chopped mint leaves",
            "2 tbsp capers",
            "2 garlic cloves",
            "2 anchovies",
            "250ml/9fl oz olive oil",
            "lemon juice, to taste"
        ],
        "To serve": [
            "8 cloves confit garlic",
            "1 handful mint leaves, picked"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "5",
    "serves": "Serves 4-6",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the sauce, place all the ingredients in a food processor and pulse to make a coarse paste. Set the sauce aside until ready to use.",
        "For the lamb, preheat the oven to 180C/350F/Gas 4. Stud the lamb leg with the rosemary sprigs and slivers of garlic at 2.5cm/1in intervals. Season liberally with sea salt and freshly ground black pepper.",
        "Roast the lamb leg for 1-1¼ hours, basting regularly with a little of the salmoriglio sauce to make a beautiful glazed coating.",
        "Allow the meat to rest for at least 10 minutes before serving.",
        "For the almond croquettes, heat the oil in a deep fat fryer or large saucepan to 180C/350F. (CAUTION: hot oil can be dangerous. Never leave the pan unattended.)",
        "Pass the hot potatoes through a potato ricer, or remove the flesh from the skins and mash until smooth.",
        "Mash the confit garlic into the potatoes, add the nutmeg, parsley and egg yolks and mix thoroughly. Roll the potato mixture into even tablespoon-sized balls. Dredge the balls with the flour, then dip them into the beaten egg and roll in the flaked almonds.",
        "Gently lower the croquettes into the deep fat fryer with a slotted spoon and fry for 2-3 minutes until golden brown. You may need to do this in batches.",
        "Remove the croquettes from the oil with a slotted spoon and drain on kitchen paper. Set aside and keep warm until ready to serve.",
        "To serve, slice the lamb thinly and serve with hot almond croquettes, the remaining salmoriglio sauce, confit garlic and mint leaves."
    ],
    "tips": [
        
    ],
    "title": "Roast lamb leg, salmoriglio sauce and almond croquettes",
    "videos": "[]"
}