{
    "author": {
        "catherine_fulvio": "Catherine Fulvio"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A salsa made with dates, pomegranate and orange juice is perfect for cutting through the richness of pork. All the more delicious served with fried risotto rice balls with melting cheese hidden within.",
    "dishes": [
        "bread",
        "oven-baked_dishes",
        "pie",
        "risotto",
        "roast_pork",
        "salsa",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the arancine": [
            "pinch saffron",
            "150g/5½oz arborio rice",
            "1 tsp salt",
            "1 medium free-range egg yolk",
            "30g/1oz parmesan cheese, grated",
            "2 free-range egg whites",
            "½ ball buffalo mozzarella, torn into small pieces",
            "50g/1¾oz plain flour, for dredging",
            "125g/4½oz breadcrumbs",
            "sunflower oil, for deep-frying"
        ],
        "For the chard": [
            "dash olive oil",
            "2 garlic cloves, finely chopped",
            "125g/4½ rainbow or Swiss chard",
            "salt and freshly ground black pepper"
        ],
        "For the pork": [
            "2 garlic cloves, finely chopped",
            "½ orange, zest only",
            "1 tsp chopped fresh parsley",
            "salt and freshly ground black pepper",
            "1 red chilli, finely chopped",
            "2 tbsp extra virgin olive oil",
            "1 large pork fillet (tenderloin)"
        ],
        "For the salsa": [
            "75g/2¾oz dates, stoned and chopped",
            "½ pomegranate, seeds only",
            "4 tbsp orange juice",
            "2 tbsp flatleaf parsley, chopped",
            "extra virgin olive oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the pork, preheat the oven to 180C/350F/Gas 4.",
        "Mix the garlic, orange zest, parsley, salt, pepper and chilli with the olive oil and rub it over the pork.",
        "Heat a pan with a little oil and brown the pork on all sides. Transfer to a roasting tin together with the pan juices. Roast for 12-14 minutes, depending how well done you prefer your pork and allow to rest, covered, in a warm place for 10 minutes",
        "For the salsa, mix all the ingredients together in a bowl and set aside.",
        "For the chard, heat a little olive oil. Add the garlic, followed by the chard, salt and pepper. Once wilted, remove from the heat and set aside",
        "For the arancine, soak the saffron in 50ml/2fl oz warm water. Place the rice in a saucepan with the saffron water and add 350ml/12fl oz water. Add the salt and bring the water to the boil. Cover, lower the heat and simmer until the water is absorbed and the rice tender. This will take about 15 minutes. Let the rice cool to room temperature.",
        "Add the egg yolk and grated cheese to the cooked rice and mix well.",
        "Beat the egg whites briefly with a fork in a bowl. Brush about half a teaspoon of egg white on the palm of your hand, press one heaped tablespoons of rice into it, and mould it into a hollow, cuplike shell. Fill the hollow with one piece of the mozzarella.",
        "Cover the filling with one tablespoon of rice and use both hands to seal the filling inside and shape the rice into a ball about the size of a small mandarin orange.",
        "Roll each arancina (ball) first in flour, then in the remaining egg white and finally in the breadcrumbs.",
        "Pour oil into a small saucepan to a depth of about 10cm/4in (Caution: hot oil can be dangerous. Do not leave unattended.)",
        "When the oil is hot, deep-fry the rice balls two or three at a time, and turn occasionally, until golden-brown on all sides. Carefully remove them using a slotted spoon and drain on a paper towel.",
        "To serve, remove the pork from the pan and place on a warm platter. Serve in slices with the chard, arancine and salsa."
    ],
    "tips": [
        
    ],
    "title": "Roast pork fillet with orange, date, pomegranate and herb salsa served with mini arancine",
    "videos": "[]"
}