{
    "title": "Rock salt and star anise baked crayfish tails with lemon butter",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2 as main, 4 as starter",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b0070tcb": "The Hairy Bikers"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "12 large crayfish, whole",
            "2 kg/4lbs 6oz coarse rock salt",
            "20 whole star anise",
            "2 tbsp coriander seeds"
        ],
        "For the lemon butter": [
            "110g/4oz butter",
            "one lemon, zest and 1 tbsp juice only",
            "sprig lemon thyme (ordinary thyme will do if you can't find lemon thyme)",
            "palm sugar or light brown muscovado sugar, to taste (optional)"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/355F/Gas 4 (the Hairy Bikers light an outdoor fire to cook theirs).",
        "Part-fill a large cast iron pan with the rock salt, to a depth of at least 5cm (2in). Bury the star anise and coriander seeds randomly throughout the salt.",
        "Transfer to the oven (or onto the fire) and leave until the salt is hot and the star anise is beginning to fume.",
        "Add the crayfish to the pan, on top of the salt, cover and bake for about 15 minutes.",
        "Meanwhile, prepare the lemon butter. Melt the butter in a pan then add the lemon zest and juice and the sprig of lemon thyme. Leave to infuse for a few minutes. If this is too sour, add a little palm sugar or light brown muscovado sugar, to taste.",
        "When the crayfish are cooked, take the pan out of the oven and serve the crayfish still in the pan with the lemon butter on the side.",
        "Eat the tail meat and dip in the sauce."
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}