{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "over 2 hours",
    "description": "Slow-cooked pork belly is a flavoursome crowd pleaser. Great for a Sunday lunch or dinner with friends.",
    "dishes": [
        "bun",
        "gravy",
        "jam",
        "oven-baked_dishes",
        "pie",
        "roast_pork",
        "sauce",
        "slow-cooked_dishes",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the pork belly": [
            "3kg/6lb 8oz piece of pork belly, ribs removed, excess fat removed, tied into a roll.",
            "25g/1oz coarse salt",
            "2 tbsp fresh thyme leaves",
            "freshly ground black pepper, to taste",
            "2 apples, preferably Bramley, peeled, cored and chopped",
            "50g/1¾oz butter",
            "2-4 tbsp caster sugar, to taste"
        ],
        "For the wilted kale and heritage carrots": [
            "2 bunch baby heritage carrots, trimmed and washed",
            "2 tsp sugar",
            "100g/3½oz unsalted butter",
            "75g/2½oz curly kale, roughly chopped"
        ],
        "To serve": [
            "200ml/7fl oz pork gravy",
            "4 pieces dehydrated pork skin"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 6-8",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the rolled pork belly, preheat the oven to 230C/445F/Gas 8.",
        "Put the pork in a large baking tray. Rub it with the salt and thyme and season with pepper.",
        "Cook for 15 minutes and then turn down the oven to 150C/300F/Gas 2 and cook for three hours. Remove from the oven and set aside to rest for at least half an hour before serving.",
        "To make the apple sauce, put the apples, butter and 2-3 tablespoons of water in a saucepan, cover and cook for 4-5 minutes or until the apples have broken down. Stir in the sugar and season with a little salt. Set aside and keep warm.",
        "For the wilted kale and heritage carrots, put the carrots in a deep frying pan with the sugar and 400ml/14fl oz water and cook for 6-8 minutes, or until tender.",
        "Heat the butter in a frying pan and once melted add the kale with two tablespoons of water and cook until wilted.",
        "Once the meat has rested carve it into 2cm/1in thick slices.",
        "Place the apple sauce on the plates with the kale on top. Put the pork on top of that and lay the carrots alongside. Drizzle the gravy over and around the plate."
    ],
    "tips": [
        
    ],
    "title": "Pork belly with apple sauce, kale and carrots",
    "videos": "[]"
}