{
    "author": {
        "jasmine_and_melissa_hemsley": "Hemsley + Hemsley"
    },
    "cookTime": "10 to 30 mins",
    "description": "These delicious pancakes combine coconut, lemon and blueberry for a lipsmacking dessert that is low in added sugar. This meal provides 406 kcal, 13.5g protein, 40g carbohydrate (of which 18g sugars), 21g fat (of which 14g saturates), 7g fibre and 1.1g salt per portion.",
    "dishes": [
        "oven-baked_dishes",
        "pancake",
        "sausage"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rolled_lemon_pancakes_83289_16x9.jpg"
    ],
    "ingredients": {
        "To serve": [
            "150g/5oz full-fat probiotic yoghurt or coconut-flavoured Greek-style yoghurt",
            "400g/14oz blueberries, washed and drained"
        ],
        "default": [
            "4 tbsp coconut oil or butter",
            "4 free-range eggs, at room temperature",
            "4 tbsp warm (boiled) water",
            "2 tbsp maple syrup",
            "1 tsp vanilla extract",
            "1 unwaxed lemon, juice and zest",
            "pinch salt",
            "4 tbsp coconut flour",
            "½ tsp bicarbonate of soda"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Line a baking tray with baking parchment.",
        "Heat the coconut oil in a frying pan over a low heat until melted, then set aside to cool.",
        "In a mixing bowl, beat the eggs with the water, maple syrup, vanilla extract, lemon juice and zest, and salt until pale and fluffy. Sift in the coconut flour and bicarbonate of soda and whisk until the batter is smooth and thick. Whisk in the melted coconut oil or butter until well combined. Set aside for 5 minutes to rest.",
        "When the batter has rested, use a spatula to evenly redistribute any leftover coconut oil in the reserved frying pan. Heat the pan over a medium heat until the fat is smoking.",
        "Add 2 tablespoonfuls of the batter to the centre of the pan and swirl to evenly distribute. Fry for 1-2 minutes, or until the pancake can be lifted easily. Flip over, then fry on the other side for a further minute, or until cooked through. Remove from the pan and keep warm in the oven. Repeat the process with the remaining batter.",
        "To serve, spoon a dollop of yoghurt into the centre of each pancake, then scatter over a good handful of blueberries. Roll up into a sausage shape and eat."
    ],
    "tips": [
        
    ],
    "title": "Rolled lemon pancakes with blueberries and yoghurt",
    "videos": "[]"
}