{
    "title": "Rose veal meatballs with Bloody Mary sauce",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Rose veal is produced when calves are allowed to roam and graze naturally. Look for the Freedom Food label to ensure welfare standards.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the rose veal meatballs": [
            "2 free-range eggs, beaten",
            "125ml/4½fl oz whole milk",
            "450g/1lb minced rose veal",
            "200g/7oz breadcrumbs",
            "75g/2½oz parmesan, grated",
            "1 garlic clove, crushed",
            "1 tbsp olive oil"
        ],
        "For the Bloody Mary sauce": [
            "100ml/3½fl oz olive oil",
            "1 onion, chopped",
            "1 celery stalk, finely chopped",
            "2 cloves garlic, chopped",
            "50ml/2oz vodka",
            "45g/1½ oz tomato purée",
            "2 x 400g/14oz tinned chopped tomatoes, drained",
            "100ml/3½fl oz chicken stock",
            "salt and freshly ground black pepper",
            "1 tbsp horseradish cream"
        ],
        "To serve": [
            "400g/14oz spaghetti, cooked according to the packet instructions",
            "parmesan, grated"
        ]
    },
    "steps": [
        "For the meatballs, in a bowl beat together the eggs and milk. Add the rest of the meatball ingredients and mix well before moulding into approximately 20 balls.",
        "Cover the meatballs and chill for at least 20 minutes.",
        "Meanwhile for the sauce, heat the olive oil in a large pan and gently fry the onion, celery and garlic until soft. Add the vodka and mix well.",
        "Add the tomato purée and cook for a few minutes before adding the tomatoes, stock and seasoning.",
        "Bring the sauce up to the boil and then turn the heat down low, cover and simmer for about an hour stirring every now and then. For a smooth sauce blend in a food processor and pass through a sieve.",
        "When ready to cook the meatballs, heat some olive oil in a frying pan over a medium heat and fry the meatballs for about eight minutes.",
        "Add the cooked meatballs to the sauce, stir in the horseradish and cook for four minutes.",
        "To serve, spoon some cooked pasta into each of four deep bowls and top with the meatballs and sauce. Top with grated parmesan."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}