{
    "title": "Rosehip iced gem meringues",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Makes 30 little meringues",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rosehip_iced_gems_20742_16x9.jpg"
    ],
    "description": "This is a rather sophisticated version of that childhood favourite - iced gem stars. Flavoured with rosehip syrup and crystallised rose petals, it’s all held together with a dab of white chocolate.",
    "author": {
        "kitty_hope_and_mark_greenwood": "Kitty Hope and Mark Greenwood"
    },
    "show": {
        "b04d9lns": "Sweets Made Simple"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1 egg white",
            "50g/1¾oz caster sugar",
            "pink food colouring paste",
            "50g/1¾oz white chocolate",
            "1 tsp rosehip syrup",
            "1-2 tbsp crystallised rose petals"
        ]
    },
    "steps": [
        "Preheat the oven to 110C/225F/Gas ¼ and line a large baking sheet with baking parchment. Fit a piping bag with a small star nozzle.",
        "Whisk the egg white in a clean, grease-free bowl until stiff and it clings to the side of the bowl. It should be so steady that you can hold the bowl upside down and nothing will slip out.",
        "Continue to whisk, adding the sugar a tablespoon at a time until the sugar has dissolved in the mixture.",
        "Dip a cocktail stick into the food colouring and run it through the meringue to create a ripple effect. Spoon into the piping bag.",
        "Dot a little meringue on the back of each corner of the parchment and press down to secure. Pipe little meringues (about the size of a 10p coin) onto the parchment, working quickly and evenly.",
        "Bake the meringues in the oven for 1 hour 40 minutes until you can lift one easily from the baking parchment. Then allow to cool.",
        "Melt the chocolate in a bowl resting over a pan of simmering water, making sure the base doesn’t touch the water. Add the rosehip syrup into the melted chocolate.",
        "Whizz the rose petals in a mini food processor, until roughly chopped, or use a knife.",
        "Spread the base of each meringue with a little white chocolate then dip in the chopped crystallised rose petals. Allow to set then serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}