{
    "author": {
        "mrs_beeton": "Mrs Beeton"
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "",
    "dishes": [
        "gravy",
        "pastry",
        "pie",
        "steak_and_kidney_pudding"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "900g/2lb rump steak",
            "2 kidneys",
            "salt and black pepper",
            "suet-crust made with milk, in the proportion of 175g/6oz of suet to each 450g/1lb of flour"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 6",
    "show": {
        
    },
    "steps": [
        "Procure some tender rump-steak, and divide it into pieces about 2.5cm/1in square, and cut each kidney into 8 pieces.",
        "Line the basin with crust made with suet and flour in the above proportion, leaving a small piece of crust to overlap the edge.",
        "Then cover the bottom with a piece of the steak and a few pieces of kidney; season with salt and pepper, and then add another layer of steak, kidney and seasoning. Proceed in this manner until the basin is full, when pour in sufficient water to come within 5cm/2in of the top of the basin.",
        "Moisten the edges of the crust, cover the pudding over, press the two crusts together, so that the gravy does not escape, and turn up the overhanging pastry.",
        "Wring out a cloth in hot water, flour it and tie up the pudding; put it int boiling water and let it boil for at least 4 hours. If the water diminishes, always replenish with hot water from a jug, as the pudding should be kept covered all the time, and not allowed to stop boiling.",
        "When the cloth is removed, cut out a round piece in the top of the crust, to prevent the puddign bursting, and send it to table in the basin, either in an ornamental dish or with a napkin pinned round it. Serve quickly."
    ],
    "tips": [
        
    ],
    "title": "Rump steak and kidney pudding",
    "videos": "[]"
}