{
    "title": "Rustic Spanish bread (Pan Rustico)",
    "cookTime": "10 to 30 mins",
    "prepTime": "overnight",
    "serves": "Makes 1 loaf",
    "recommendations": "43",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/rustic_spanish_bread_pan_97488_16x9.jpg"
    ],
    "description": "The Spanish love their bread and after tasting this, so do we! With the starter mix, it’s halfway to a sourdough and it’s a good old-fashioned hearty bread that keeps well.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b01dl8gl": "Hairy Bikers' Bakeation"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the starter dough": [
            "150ml/5fl oz/¼ pint warm water",
            "1 tsp caster sugar",
            "3 tsp fast-action dried yeast",
            "125g/4½oz strong white flour"
        ],
        "For the bread dough": [
            "200ml/7fl oz/⅓ pint warm water",
            "1 tsp caster sugar",
            "1 tsp fast-action dried yeast",
            "225g/8oz strong white flour, plus extra for dusting",
            "100g/3½oz strong wholemeal flour",
            "1 tsp salt",
            "1 tbsp olive oil, plus extra for greasing"
        ]
    },
    "steps": [
        "For the starter, pour the water into a medium bowl and stir in the sugar. Lightly stir in the yeast and leave in a warm place for about 10 minutes or until a beige foam floats on the surface. Stir in the flour to make a thick paste, then cover with cling film and leave at room temperature for 24 hours. At the end of the 24 hours the paste will smell yeasty and slightly fermented – a bit like beer.",
        "For the bread dough, pour the water into a jug and stir in the sugar. Lightly stir in the yeast and leave in a warm place for about 10 minutes or until a beige foam floats on the surface.",
        "Stir the flours and salt together in a large bowl, then make a well in the centre and add the yeast and water mixture, the starter dough and the oil.",
        "Mix with a wooden spoon and then with your hands until the mixture comes together and forms a slightly lumpy and sticky dough. If the dough feels a little dry, add another tablespoon or two of water.",
        "Transfer the dough to a work surface and knead for a good 10 minutes until it’s smooth and elastic. As you knead, push the dough away from you with the heel of your hand to stretch it as long as possible, then fold it back towards you. This will help strengthen the flour and trap air bubbles inside the loaf. Resist the temptation to add too much extra flour as it could make the dough dry. You should feel the dough change in texture as you work, so don’t be afraid to be fairly robust with your stretching and folding. Put the dough in an oiled mixing bowl, cover it loosely with oiled cling film and leave it to rise for about an hour or until it has doubled in size.",
        "Line a baking tray with parchment and dust with flour.",
        "Loosen the dough with a spatula and tip it on to the baking tray. Stretch the dough very gently until it’s about 30cm/12in long, then fold it in half and stretch again. Do the same thing twice more. This should help to give the dough a more holey texture.",
        "After the third stretch, shape the dough into a long loaf shape and slash the top a few times with a sharp knife. Dust with a little flour and leave to prove in a warm place for 45–60 minutes or until it has risen again and feels light and puffy.",
        "Preheat the oven to 240C/450F/Gas 8.",
        "Bake the loaf for 20–25 minutes or until golden-brown and crusty. The base should sound hollow when tapped. Cool on a wire rack."
    ],
    "howTos": [
        "kneading"
    ],
    "videos": "[]"
}