{
    "title": "Rye crispbread",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 6-8",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Crispbreads are simple to make and a lovely thing to serve up when you have friends over. Top with cheese or pâté.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b069hr3q": "The Hairy Bikers' Northern Exposure"
    },
    "tips": [
        "If you fancy making bigger crispbreads then double the quantities and use a dinner plate to cut the crispbreads out."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "300g/10½oz wholemeal rye flour, plus extra for dusting",
            "1 tsp salt",
            "½ tsp baking powder",
            "1 heaped tsp anise seeds or fennel seeds",
            "1 tsp honey",
            "30g/1oz butter, softened"
        ],
        "For the topping (optional)": [
            "1 free-range egg white",
            "mixture of seeds, such as caraway, anise, poppy, sesame"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "Put the flour in a large bowl. Add the salt, baking powder, anise seeds, honey and butter. Mix thoroughly, then start slowly adding 175ml/6fl oz water, stirring until you have a soft dough. Don’t worry if it’s a bit sticky, it will be fine once you start rolling.",
        "Generously flour a work surface and turn out the dough. Roll the dough out thinly.",
        "Cut out 20cm/8in rounds – you should get 6 - 8 rounds. Cut a small hole in the middle of the rounds.",
        "Place the rounds on 3 baking trays and prick the crispbreads all over with a fork.",
        "For the topping, whisk the egg white with 1 tablespoon water and brush over the crispbreads. Sprinkle with your choice of seeds and press down lightly.",
        "Bake for 12-15 minutes. Remove and leave to cool on a wirerack."
    ],
    "howTos": [
        
    ],
    "videos": "[p0344z5z:p0344z65]"
}