{
    "title": "Adaptable sage, onion and sausage stuffing",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 8-10",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sage_onion_and_sausage_33868_16x9.jpg"
    ],
    "description": "Stuffing makes for a glorious Christmas side dish, this recipe can be made in advance to reduce stress on the big day. Want to make this recipe gluten-free or vegetarian? Check the tips section.",
    "author": {
        "deborah_reddihough": "Deborah Reddihough"
    },
    "show": {
        
    },
    "tips": [
        "To make this recipe gluten free, use gluten-free breadcrumbs and sausage meat. You may need to buy gluten-free sausages and remove the meat from their cases. To make this recipe vegetarian, double the amount of breadcrumbs, butter and sage and swap the sausage meat for 1 large free-range egg. Mix and shape as above. It will make about half the amount of stuffing and cook in 25 minutes."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "knob of butter, plus extra for greasing",
            "1 onion (or ½ large onion), finely chopped",
            "375g-400g/13-14oz sausage meat",
            "3 large sage leaves, finely chopped",
            "80g/2¾oz fresh breadcrumbs",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Melt the butter in a large saucepan over a low heat until foaming. Add the onions and fry gently for 8-10 minutes, or until softened. Remove from the heat.",
        "Stir in the remaining ingredients and season generously with salt and pepper. Mix until well combined.",
        "If you are making stuffing balls, lightly grease a baking tray and, using wet hands, shape the stuffing into balls about 2½cm/1in in diameter and place on the prepared tray. If preferred transfer the stuffing mixture to a 20cm/8in square tin and press down to smooth the surface. Cover with cling film and transfer to the fridge for at least 30 minutes, but up to two days (assuming the meat is fresh). (The stuffing can be frozen at this stage, but will need to be thoroughly defrosted before cooking.)",
        "When ready to cook, preheat the oven to 200C/180C Fan/Gas 6.",
        "Roast the stuffing for 30-40 minutes until cooked through (balls will take about 30 minutes, and a tray 40 minutes)."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}