{
    "title": "Salad of two beans, walnuts, radicchio and croûtons with beef fillet",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_tanner": "James Tanner"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the salad": [
            "3 tbsp extra virgin olive oil",
            "50g/2oz bread, crusts removed, cut into cubes",
            "3 sprigs fresh rosemary",
            "2 x 150g/5½oz beef fillet"
        ],
        "For the dressing": [
            "2 slices white bread, torn into pieces",
            "4 tbsp milk",
            "2 garlic cloves",
            "1 lemon, juice and zest only",
            "50g/2oz walnuts",
            "150ml/5½fl oz extra virgin olive oil",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "150g/5½oz radicchio leaves",
            "50g/2oz walnuts",
            "100g/3½oz French beans, cooked",
            "100g/3½oz broad beans, blanched and peeled",
            "1 tsp chopped fresh flatleaf parsley",
            "2 tbsp olive oil",
            "15g/1oz parmesan shavings"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "Heat a frying pan until hot then add the olive oil, cubed bread and rosemary and fry until just golden.",
        "Transfer the croutons onto a baking tray and place in the oven to bake for five minutes, until crisp.",
        "Meanwhile, place a frying pan onto the heat and, when hot, add a little oil and the beef fillets. Fry on each side for two minutes then place in the oven for five minutes, or until cooked to your liking. Remove and allow to rest.",
        "To make the dressing, place the bread and the milk into a food processor and allow to soak together.",
        "Add the garlic, lemon juice and zest and walnuts and blend to a paste.",
        "Add the olive oil and season, to taste, with salt and freshly ground black pepper.",
        "To serve, place the radicchio, walnuts, French beans and broad beans into a bowl and drizzle with the dressing.",
        "Add the parsley and the croutons and mix well.",
        "Divide the salad between two plates, drizzle with olive oil and top with shaved parmesan. Serve with the beef fillet alongside."
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}