{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "Choose super-fresh salmon for this classic Scandinavian starter. It's perfect for a dinner party, as most of the components can be prepared ahead of time. Equipment and preparation: for this recipe you will need a food processor and a chef's blow torch.",
    "dishes": [
        "baguette",
        "jam",
        "ketchup",
        "mayonnaise",
        "pickle",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the croûtons": [
            "50ml/1¾oz olive oil",
            "½ baguette, thinly sliced"
        ],
        "For the mustard mayonnaise": [
            "2 egg yolks",
            "2 tsp white wine vinegar",
            "300ml/10fl oz rapeseed oil",
            "1 tsp Dijon mustard",
            "2 tbsp wholegrain mustard",
            "salt and freshly ground black pepper"
        ],
        "For the pickled cucumber and cucumber ketchup": [
            "2 cucumbers",
            "250ml/9fl oz rice wine vinegar",
            "1 tsp sea salt",
            "2½ tbsp caster sugar",
            "2-3 tsp xanthan gum",
            "1 tbsp black onion seeds"
        ],
        "For the salmon": [
            "250g/9oz caster sugar",
            "250g/9oz fine sea salt",
            "50g/1¾oz fresh dill, chopped",
            "½ side of salmon, about 500g/1lb 2oz, filleted, skinned, pin-boned",
            "2 tbsp coriander cress, to serve"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the salmon, mix the sugar, salt and dill together in a bowl. Sprinkle half the mixture into the bottom of a shallow roasting tray, then lay the salmon on top and sprinkle over the remaining mixture. Cover the tray with cling film and refrigerate overnight.",
        "For the pickled cucumber and cucumber ketchup, slice the edges off the cucumbers to create two long 2cm/¾in square batons, then cut the flesh into cubes and set aside.",
        "Roughly chop the cucumber skins and transfer to a food processor. Add 100ml/3½fl oz rice wine vinegar, the salt and 1 teaspoon sugar and blend to a fine purée, then add the xanthan gum a teaspoon at a time until it thickens.",
        "Put the remaining rice wine vinegar and sugar in a saucepan, add the puree and heat, then drop half the cucumber flesh into the warm pickle.",
        "Put the remaining cucumber flesh on a heavy baking tray and blow torch until charred.",
        "For the mustard mayonnaise, put the eggs and vinegar in a food processor and blend until pale and creamy. With the motor running, pour in the oil in a thin, steady stream until thick and emulsified (you may not need all the oil). Stir in the Dijon and wholegrain mustards and season to taste with salt and pepper.",
        "For the croûtons, heat the oil in a medium frying pan. Fry the baguette slices for 2 minutes on each side, or until golden brown. Drain on kitchen paper.",
        "To serve, rinse the cure off the salmon under cold running water and pat dry with kitchen paper. Slice the gravadlax and place on a serving plate. Sprinkle the black onion seeds over the charred cucumber flesh and serve with the gravad lax, cucumber ketchup, mustard mayonnaise and croûtons, garnished with the coriander cress."
    ],
    "tips": [
        
    ],
    "title": "Salmon gravad lax with pickled cucumber, cucumber ketchup, mustard mayo and croûtons",
    "videos": "[]"
}