{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "less than 10 mins",
    "cusine": "British",
    "description": "This very English dish contrasts rich salmon and cream with bitter, citrussy sorrel and a pepped up green salad.",
    "dishes": [
        "jam",
        "mayonnaise",
        "oven-baked_dishes",
        "salad",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the house dressing (optional)": [
            "1 free-range egg yolk",
            "1 tsp English mustard",
            "2 tsp clear honey",
            "2 tbsp cider vinegar",
            "150ml/5fl oz vegetable oil",
            "1 banana shallot, finely chopped",
            "1 garlic clove, finely chopped",
            "2 tbsp finely chopped fresh flatleaf parsley leaves",
            "1 tbsp finely chopped fresh mint leaves",
            "1 tbsp finely chopped fresh basil leaves",
            "1 tbsp finely chopped fresh thyme leaves",
            "salt and freshly ground black pepper"
        ],
        "For the salmon and sorrel": [
            "40g/1½oz butter, for greasing",
            "200g/7oz salmon fillet, cut lengthways into 8 thin slices",
            "1 shallot, finely sliced",
            "5 tbsp vermouth",
            "5 tbsp white wine",
            "150ml/5fl oz double cream",
            "75g/2½oz fresh sorrel leaves, de-veined, very finely sliced",
            "1 bag green salad leaves, to serve"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "1",
    "serves": "Serves 2",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "For the house dressing, if making, whisk together the egg yolk, mustard, honey and cider vinegar in a bowl until well combined. Gradually add the vegetable oil in a thin stream, whisking continuously, until the mixture thickens to a creamy mayonnaise.",
        "Stir in the shallot, garlic and herbs, then season, to taste, with salt and freshly ground black pepper. Set aside.",
        "For the salmon and sorrel, preheat the grill to its highest setting.",
        "Grease an oven tray with butter, then season with salt and freshly ground black pepper. Lay the salmon slices on the tray, overlapping them slightly, then set aside.",
        "Heat a frying pan over a high heat. Add the shallot, vermouth and white wine and bring to the boil, then reduce the heat until the mixture is simmering and simmer for 4-5 minutes, or until the volume of liquid has reduced by half.",
        "Pour in the double cream and continue to simmer for 2-3 minutes, or until the volume of liquid has reduced slightly and the sauce has thickened. Season, to taste, with salt and freshly ground black pepper, then remove from the heat and stir in the sorrel.",
        "Meanwhile, grill the salmon for 2-3 minutes, or until just cooked through.",
        "To serve, carefully pour a pool of the sorrel and vermouth sauce into the centre of two serving plates. Lay the grilled salmon slices on top. Serve the salad leaves alongside, drizzled with 50ml/2fl oz of the house dressing, if using."
    ],
    "tips": [
        "This recipe makes more house dressing than you will need for the salad. The remaining dressing can be stored in an airtight jar or container in the fridge for up to four days and used on other salads."
    ],
    "title": "Salmon and sorrel with vermouth",
    "videos": "[]"
}