{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This is a regular lunch or supper at casa mia, as anyone who follows me on Twitter or Instagram will recognise. I sometimes poach the salmon and keep it in the fridge (see tips), just so that I can make it even faster when the need hits. It’s quick work anyway, so this is more of an aside than a piece of advice.",
    "dishes": [
        "pie",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the salad": [
            "3 tbsp pumpkin seeds",
            "100g/3½oz watercress",
            "1 tsp organic cloudy apple cider vinegar",
            "1 small ripe avocado",
            "1 tbsp cold-pressed rapeseed oil or extra-virgin olive oil",
            "1 tsp sea salt flakes, or to taste"
        ],
        "For the salmon": [
            "2 wild Alaskan salmon fillets (approximately 250g/9oz total)",
            "2 spring onions, trimmed",
            "1 tsp black peppercorns",
            "2½ tsp lime juice",
            "2 tsp sea salt flakes"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "steps": [
        "Put the salmon fillets in a small frying pan (I use one with a 20cm/8in diameter) and cover with cold water from the tap. Add the spring onions and peppercorns, squeeze in the lime juice and sprinkle in the salt, then bring to the boil, uncovered. When the pan is bubbling, turn the fillets over, then remove the pan from the heat and leave to stand for 7 minutes. Then take the fillets out of the liquid and leave to cool completely, which could take up to 1 hour. Once cool, the salmon will be cooked through, with its flesh desirably tender and coral inside.",
        "While the salmon’s cooling, make a start on the salad. Toast the pumpkin seeds by tossing them in a dry, heavy-based frying pan on the hob. They will start jumping a little, and will darken and get a smokier taste. It doesn’t take long to toast them, so don’t leave the pan and, indeed, keep giving it a quick swirl. Then transfer to a cold plate.",
        "When you’re ready to unite salmon with salad, put the watercress into a large shallow bowl, sprinkle with the vinegar, and toss. Now add the salmon, removing the skin and tearing the fish into bite-sized pieces or shreddy bits, as you wish.",
        "Halve the avocado and remove the stone, then spoon the flesh out onto the salmon and watercress, or cut it into slices if you prefer. Drizzle the oil over the salad, sprinkle with the salt and half of the toasted pumpkin seeds, and toss gently to mix. Scatter the remaining pumpkin seeds on top, and eat."
    ],
    "tips": [
        "The salmon can be cooked up to 3 days ahead. Cool for up to 1 hour, then cover and refrigerate until needed. I like to use wild Alaskan salmon, which accounts for the vivid hue here. It doesn’t have an exceedingly strong taste and it isn’t as expensive as wild Scottish salmon. If you have half an avocado that needs using up, you can put it to excellent use here, as you don’t really need a whole one if this is to feed only two of you. I love our British cold-pressed rapeseed oil, but should that not be available, please don’t make the mistake of using regular vegetable oil in its place, but rather reach for good extra-virgin olive oil instead."
    ],
    "title": "Salmon, avocado, watercress and pumpkin seed salad",
    "videos": "[p039bqm9:p039bqmq]"
}