{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "description": "I love to serve a long platter of these salmon fillets for a summer buffet. They look so pretty and the flavour of the herb sauce really compliments the salmon. This would be the prefect main meal to serve for a special occasion.",
    "dishes": [
        "mayonnaise",
        "oven-baked_dishes",
        "pie",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the sauce": [
            "1 tbsp snipped fresh dill",
            "1 tbsp snipped fresh chives",
            "1 tbsp torn fresh mint leaves",
            "1 tbsp small sprigs parsley",
            "100g/3½oz full-fat crème fraîche",
            "100g/3½oz full-fat Greek yoghurt",
            "150ml/¼ pint light mayonnaise",
            "1 tsp sugar",
            "½ lemon, juice only"
        ],
        "default": [
            "10 x 125g/4½oz single fillets of salmon, cut from the whole fillet, skin on",
            "salt and black pepper",
            "20 fine fresh asparagus tips",
            "5 quails' eggs"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 10",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4 (fan 160C).",
        "Arrange the salmon fillets with a little space between each one, on a buttered roasting tin and sprinkle with black pepper. Cover tightly with aluminium foil and bake for 15 minutes, or until the fish turns an opaque pink colour (no longer shiny pink). Remove the foil and allow to cool, then cover and leave to chill in the refrigerator.",
        "Bring a frying pan with water to the boil, add the asparagus and boil for just three minutes or until tender when pierced with the tip of a knife. Plunge into ice cold water to stop them cooking any further, then drain well.",
        "Bring a small pan of water to the boil and cook the quails' eggs for just two minutes. Plunge into ice cold water to stop them cooking any further, then drain well and peel off the shells.",
        "For the sauce, place all the sauce ingredients in a blender or food processor and blend until smooth. Taste and season with salt and pepper, if necessary.",
        "Spoon a little of the herb sauce on top of each piece of salmon, top with half a quails' egg and two asparagus spears. Serve the remaining sauce in a sauce boat and arrange the remaining quail’s eggs on the serving platter."
    ],
    "tips": [
        "The salmon, asparagus, eggs and sauce can all be prepared up to two days in advance and then assembled no more than two hours before serving. Keep chilled until served. Try to get salmon fillet slices that are all the same thickness. If they are very thin at the sides, fold the sides underneath to prevent over-cooking"
    ],
    "title": "Salmon fillets with herb sauce, quails' eggs and asparagus",
    "videos": "[]"
}