{
    "title": "Salmon and sea bass ceviche",
    "cookTime": "no cooking required",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "Lightning-quick, super-easy and instantly refreshing, try this Latin-style summer fish dish for size. Each serving provides 698kcal, 43g protein, 6g carbohydrate (of which 4g sugars), 55g fat (of which 10gsaturates), 6g fibre and 0.3g salt.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b01qkkjj": "Hairy Bikers Everyday Gourmets"
    },
    "tips": [
        "Use only the freshest fish for this dish, and cut it with a sharp knife."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2oz skinless salmon fillets, flesh sliced as thinly as possible using a sharp knife",
            "2 medium skinless sea bass fillets, flesh sliced as thinly as possible using a sharp knife",
            "1 red onion, peeled, thinly sliced",
            "2 large red chillies, stalks and seeds removed, thinly sliced",
            "1 red pepper, stalk and seeds removed, flesh finely diced",
            "5 limes, juice and zest, plus extra lime wedges to serve",
            "pinch cayenne pepper",
            "4 tbsp extra virgin olive oil, plus extra to serve",
            "handful fresh coriander leaves"
        ],
        "To serve": [
            "2 ripe avocados, peeled, stone removed, cut into thin slices",
            "handful mixed baby salad leaves"
        ]
    },
    "steps": [
        "Put the fish slices into a large shallow serving bowl.",
        "Sprinkle over the red onion slices, chilli and diced red pepper and mix gently using your fingers. Sprinkle over the lime zest.",
        "In a separate bowl, whisk together the lime juice, cayenne pepper and olive oil until well combined.",
        "Pour the marinade over the fish, mix well using your hands and cover the bowl with cling film. Chill in the fridge for at least 30 minutes.",
        "When ready to serve, mix in the chopped coriander",
        "To serve, place one chefs’ ring into the centre of each of four serving plates. Add a double layer of avocado slices to the chefs ring, then spoon in enough ceviche to almost reach the top of the chefs’ rings. Top with the baby salad leaves, drizzle with olive oil and garnish with a wedge of lime. Carefully remove the chefs’ rings before serving."
    ],
    "howTos": [
        
    ],
    "videos": "[p015nmc6:p015nmc8]"
}