{
    "title": "Salmon lasagne with a kale and lemon sauce",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "This fish lasagne is much quicker to prepare than the normal meat version. Serve with a seasonal salad.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the salmon lasagne": [
            "75g/2½oz butter",
            "2 banana shallots, finely chopped",
            "300ml/10fl oz Champagne or dry white wine",
            "300ml/10fl oz fish stock",
            "300ml/10fl oz double cream",
            "1 lemon, zest only",
            "200g/7oz Gruyère cheese, grated",
            "8 leaves curly kale",
            "400g/14oz fresh salmon, thinly sliced",
            "handful basil leaves",
            "400g/14oz fresh lasagne sheets"
        ],
        "For the green salad": [
            "2 bunches fresh rocket",
            "1 bunch watercress",
            "3 tbsp olive oil",
            "1 tbsp white wine vinegar",
            "1 tsp Dijon mustard"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "For the salmon lasagne, heat the butter in a saucepan over a medium heat. Add the shallots and cook for 2-3 minutes until soft and translucent.",
        "Increase the heat, pour in the champagne and cook until the volume of liquid has reduced by half. Add the stock and again reduce by half. Reduce the heat and then add the double cream and cook until reduced and thickened. Stir in the lemon zest and half the cheese. Set aside.",
        "Blanch the kale in a pan of boiling water for 2 minutes, then drain thoroughly. Place on a plate and pat dry using kitchen paper.",
        "In a large oven proof dish, start to layer the lasagne. Spread the sauce on the bottom, add a layer of kale, then salmon, basil, pasta sheets. Repeat the layers until the dish is nearly full. Finish with a layer of sauce and grated cheese. Bake for 20-25 minutes or until bubbling and golden-brown.",
        "For the green salad, mix the rocket and watercress in a large bowl. Beat the oil, vinegar and mustard together in a small bowl. Just before serving add the dressing to the leaves and toss.",
        "To serve, place a slice of salmon lasagne on each serving plate and serve the salad on the side."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}