{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "1 to 2 hours",
    "description": "This is perfect to serve for a summer buffet, for a Sunday lunch or for a stylish dinner party. It is full of flavour, easy to prepare ahead and easy to serve. Just add new potatoes and a side salad.",
    "dishes": [
        "oven-baked_dishes",
        "pastry",
        "pesto",
        "pie",
        "prepare-ahead_desserts",
        "salad",
        "salmon_en_croute",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "how_to_roast_vegetables"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the roasted vegetables": [
            "3 red peppers",
            "2 red onions",
            "3 courgettes",
            "3 tbsp olive oil"
        ],
        "For the salmon en croûte": [
            "2 x 320g/11½oz packs ready-rolled puff pastry",
            "1kg/2lb 4oz side of salmon, cut from the centre",
            "3 tbsp red sundried tomato pesto",
            "1 free-range egg, beaten"
        ],
        "For the sauce": [
            "600ml/1 pint pouring double cream",
            "1 lemon, juice only",
            "4 tbsp red sundried tomato pesto",
            "4 tbsp chopped fresh basil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "28",
    "serves": "Serves 10",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "For the roasted vegetables, cut the red peppers in half, discarding the core and seeds, and place in a large roasting tin. Peel and cut the onions into eight wedges, and cut the courgettes into 1cm/½in thick slices lengthwise.",
        "Add the onion and courgette to the roasting tin with the olive oil and roast for 20-25 minutes, or until the vegetables are charred and tender. Allow to cool, then peel away, and discard the skin from the red peppers and cut into bite-sized pieces.",
        "For the salmon en croute, preheat a large baking tray in the oven.",
        "Unroll one pack of pastry and roll a little longer until it is about 2cm/¾in larger all around than the piece of fish (check that it will fit on the baking tray, you may have to place it diagonally.) Place the pastry on top of a sheet of baking parchment so that you can easily slide the pie onto the hot baking tray. Place the salmon on the centre of the pastry and spread with the pesto, top with the courgettes and onion and lay the red pepper on top. Brush the edge of the pastry with beaten egg.",
        "Roll out the second pack of the pastry to a rectangle slightly larger than the first one so that it drapes over the fish and filling. Carefully lift it over the salmon, trim off any excess and press the edges well to seal. Re-roll the pastry trimmings thinly and cut out pastry decorations if liked – such as little fishes. Brush the pastry with beaten egg.",
        "Carefully slide the pie onto the preheated baking tray on the non-stick baking paper, and bake for 35-40 minutes, or until golden-brown both on top and underneath. Allow to rest for 10 minutes while you make the sauce.",
        "For the sauce, gently heat the cream in a pan, and stir in the lemon juice and pesto. Remove from the heat and then stir in the basil just before serving.",
        "Serve the salmon cut into slices, with the sauce."
    ],
    "tips": [
        "Try to buy a wide piece of fish rather than a long thin fillet, as it will fit in the oven better. It is essential to heat a baking tray in the oven as this instantly starts to cook the pastry preventing a soggy bottom! Use green basil pesto if you prefer."
    ],
    "title": "Salmon en croûte with pesto and roasted vegetables",
    "videos": "[]"
}