{
    "title": "Salmon coulibiac",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "8",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/salmon_coulibiac_10859_16x9.jpg"
    ],
    "description": "This rice, egg and salmon-stuffed fish pie makes a wonderful centre-piece for a dinner party and is easy to make and prepare in advance.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "75g/2½oz butter",
            "1 onion, finely chopped",
            "1 tsp cumin seeds",
            "1 tsp coriander seeds",
            "2 cardamom pods",
            "150g/5½oz closed-cup mushrooms, sliced",
            "100g/3½oz cooked basmati rice (cooked with a pinch of ground turmeric)",
            "1 lemon, zest only",
            "2 tbsp chopped parsley",
            "2 tbsp chopped dill",
            "salt and pepper",
            "500g/1lb 2oz puff pastry",
            "300g/10½oz cooked salmon fillet",
            "3 hard-boiled large eggs, shelled and sliced",
            "1 free-range egg, lightly beaten, to glaze"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Melt the butter in a large frying pan and gently fry the onion until soft but not coloured. Add the cumin, coriander seeds and cardamom pods.",
        "Add the sliced mushrooms and cook until softened. Stir in the cooked rice, lemon zest, parsley and dill. Season with salt and pepper.",
        "Roll out half of the pastry to approximately 22x35cm/8½x14in. Place onto a baking tray.",
        "Spread the rice mixture down the centre of the pastry leaving a 4cm/1½in boarder all the way round. Flake the salmon on top of the rice. Arrange the egg slices over the salmon.",
        "Brush the edges of the pastry with beaten egg. Roll the remaining pastry, slightly larger than the first piece. Sit this over the coulibiac and press the edges to seal the two pieces of pastry together. Trim the edges.",
        "Brush the coulibiac with beaten egg and bake for 30-35 minutes, or until the pastry is crisp and golden-brown. Leave to rest for 10 minutes before slicing."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}