{
    "title": "Salt fish fritters",
    "cookTime": "10 to 30 mins",
    "prepTime": "overnight",
    "serves": "Makes 24 small fritters",
    "recommendations": "3",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/salt_fish_fritters_01411_16x9.jpg"
    ],
    "description": "These West Indian fish cakes are perfect finger food. Serve with plenty of pepper sauce for dipping.",
    "author": {
        "lift_community_trust": "Lift Community Trust"
    },
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "125g/4½oz salt cod, or other saltfish, soaked in water overnight (water changed several times)",
            "100g/3½oz self-raising flour",
            "¼ red pepper, diced",
            "¼ green pepper, diced",
            "¼ onion, finely diced",
            "½ Scotch bonnet chilli, seeded and finely chopped (use ½ green chilli for a milder version )",
            "freshly ground black pepper",
            "vegetable oil, for shallow frying"
        ]
    },
    "steps": [
        "Drain the soaked salt cod and cook in boiling water for 20-25 minutes, or until the fish is flaky and tender. Drain the salt cod and flake the flesh, removing the skin and pin bones.",
        "Tip the flour into a bowl and stir in enough cold water to make a thick paste (about 250ml/9fl oz). Stir in the salt cod, red and green peppers, onions, scotch bonnet pepper and season with freshly ground black pepper.",
        "Heat 2.5cm/1in vegetable oil in a deep heavy-based frying pan until a breadcrumb sizzles and turns brown when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
        "Carefully place spoonfuls of the batter into the hot oil and fry for 2-3 minutes, or until the fritters are crisp and golden-brown (you may need to do this in batches). Remove from the pan with a slotted spoon and set aside to drain on kitchen paper to remove any excess oil."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}