{
    "title": "Salted caramel and coffee éclairs",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Makes 8",
    "recommendations": "4",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/salted_caramel_and_23832_16x9.jpg"
    ],
    "description": "These grown-up éclairs are very straightforward and will have you wowing family and friends. Equipment and preparation: you will need a piping bag fitted with a 1cm/½in plain nozzle.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the choux pastry": [
            "50g/1¾oz unsalted butter, cut into roughly 1cm/½in pieces",
            "1 tsp caster sugar",
            "pinch salt",
            "65g/2¼oz strong white bread flour",
            "2 medium free-range eggs, beaten"
        ],
        "For the coffee filling": [
            "200g/7oz mascarpone",
            "1 tbsp icing sugar",
            "3 tbsp cold strong coffee (espresso is ideal)",
            "250ml/9fl oz double cream"
        ],
        "For the salted caramel icing": [
            "150g/5½oz soft light brown sugar",
            "75g/2½oz soft, unsalted butter",
            "pinch salt",
            "50ml/2fl oz full-fat milk",
            "125g/4½oz icing sugar, sifted"
        ]
    },
    "steps": [
        "Preheat your oven to 190C/375F/Gas 5. Line two baking trays with parchment.",
        "For the choux pastry, put the butter, sugar, salt and 150ml/5fl oz of water into a large saucepan. Heat gently until the butter has melted, then bring to the boil. Immediately remove from the heat and tip in the flour. Beat with a wooden spoon to form a smooth ball of dough that leaves the sides of the pan.",
        "Now vigorously beat the egg into the hot dough, a little at a time. This takes some elbow grease! As you add the egg, the dough will become stiff and glossy. Stop adding the egg if the dough starts to become loose – but you should use up all or most of it. Spoon the mixture into a piping bag fitted with a 1cm/½in plain nozzle. Pipe four sausage shapes, about 12cm/4½in long, on each baking tray, leaving plenty of space for them to spread during cooking.",
        "Bake for 30 minutes, or until well risen and golden-brown. Remove from the oven and split one side of each éclair to allow the steam to escape. Cool on a wire rack.",
        "To make the filling, beat the mascarpone in a bowl until smooth. Beat in the icing sugar and coffee. Whip the cream until it holds soft peaks when the whisk is removed. Fold the cream into the mascarpone mixture. Spoon the mixture into a piping bag fitted with a 1cm/½in plain nozzle and fill each éclair with the mix.",
        "To make the icing, put the sugar, butter and salt into a small saucepan. Gently heat until the butter has melted and the mixture is smooth. Add the milk, bring to the boil and boil for two minutes, stirring occasionally. Remove from the heat and sift in the icing sugar. Stir until smooth. Spread the icing on the éclairs. You’ll need to work quickly before the icing sets but it can be reheated if it sets before you have finished.",
        "Serve the éclairs as soon as the icing is set."
    ],
    "howTos": [
        "making_choux_pastry"
    ],
    "videos": "[]"
}