{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "1 to 2 hours",
    "description": "Vegetarians will love the simple flavours of this elegant dish. It’s just as delicious served hot as it is cold.",
    "dishes": [
        "bread",
        "jam",
        "oven-baked_dishes",
        "pastry",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2oz strong white bread flour, plus extra for dusting",
            "200g/7oz fine sea salt",
            "4 egg whites",
            "1 large celeriac, washed thoroughly",
            "100g/3½oz crème fraîche",
            "2 tbsp extra virgin olive oil",
            "freshly ground black pepper",
            "3 tbsp finely chopped fresh chives",
            "50g/1¾oz watercress, coarse stalks removed",
            "handful chive flowers (optional)"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Mix the flour and salt together in a large bowl. Add the egg whites and 100-125ml/3½-4½fl oz water and stir well until the mixture comes together as a dough. Continue to stir or knead the mixture until you get a soft, smooth dough.",
        "Roll the dough into a ball, then flatten into a 2cm/¾in-thick disc. Wrap in cling film and chill in the fridge for 30 minutes.",
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "Roll the dough out onto a lightly floured work surface to a thickness of 1cm/½in. Tear a small strip from one edge and set aside.",
        "Place the celeriac in the middle of the pastry and wrap the pastry around it to completely cover. Gather the edges of the pastry together at the top of the celeriac and use the trimmed extra length of pastry to ‘tie’ them together.",
        "Place the wrapped celeriac on a baking tray and bake in the oven for 1-1½ hours, or until the pastry is hard and the celeriac tender. To check whether the celeriac is tender, insert a skewer into the centre of it.",
        "Meanwhile, whisk the crème fraîche and olive oil together in a bowl, then season, to taste, with freshly ground black pepper and stir in the chives. Chill in the fridge until needed.",
        "When the celeriac is tender, remove it from the oven and set aside to cool slightly. Once cool enough to handle, break off the pastry case.",
        "To serve, finely slice the celeriac and arrange the slices on a large serving platter. Drizzle over the dressing, then garnish with the watercress and chive flowers, if using."
    ],
    "tips": [
        
    ],
    "title": "Salt-crust baked celariac with crème fraîche",
    "videos": "[p02gs3rr:p02gs3rz]"
}