{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Italian",
    "description": "San Marzano tomatoes have dense flesh and a rich, sweet flavour. They are considered by many chefs to make the best tomato sauce, but good quality plum tomatoes could be substituted.",
    "dishes": [
        "jam",
        "oven-baked_dishes",
        "pie",
        "pizza",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "kneading",
        "how_to_shape_pizza_dough"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/san_marzano_tomato_pizza_17797_16x9.jpg"
    ],
    "ingredients": {
        "For the pizza dough": [
            "800g/1lb 14oz '00' flour",
            "200g/7oz semolina flour",
            "1 tsp salt",
            "1 tbsp caster sugar",
            "14g/½oz dried yeast",
            "4 tbsp extra virgin olive oil",
            "650ml/1 pint 2fl oz water"
        ],
        "For the topping": [
            "2 x 400g/14oz tins San Marzano tomatoes",
            "2 large cow’s milk mozzarella balls, grated",
            "3 tbsp olive oil",
            "3 tbsp peanut oil",
            "sea salt and freshly ground black pepper",
            "1 large handful basil leaves",
            "200g/7oz prosciuto, torn into pieces, optional",
            "50g/1¾oz rocket leaves, optional"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "25",
    "serves": "Makes 4 pizzas",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "To make the dough, place the flours, salt, sugar and yeast into a large bowl and stir. Make a well in the centre of the flour and pour in the water, gradually mixing in the flour to form a soft dough.",
        "Tip out and knead on an oiled work surface for about 10 minutes or until the dough is smooth and elastic. Place it into a bowl, cover and leave to rise for 24 hours.",
        "Preheat the oven to its highest temperature. Place a heavy baking tray or pizza stone in the oven and allow it to heat.",
        "Remove the dough from the bowl and knead for a couple of minutes, then divide into four pieces. Allow to rest for five minutes, then stretch each piece over your hands to form a disc about 5mm/¼in thick.",
        "Place the circles of dough onto upturned floured baking trays or a pizza peel if you have one.",
        "Place the tinned tomatoes into a food processor and blend to a purée. Spoon the tomato purée thinly over the pizzas, scatter over the grated mozzarella, then drizzle over the oils. Season with sea salt and freshly ground black pepper.",
        "Slide each pizza off the baking tray directly onto the heated baking tray or pizza stone in the oven and cook for 5 -10 minutes, or until golden-brown and crisp.",
        "To serve, scatter the basil leaves, rocket and prosciuto (if using) over the pizza and drizzle with a little more peanut oil."
    ],
    "tips": [
        
    ],
    "title": "San Marzano tomato pizza",
    "videos": "[]"
}