{
    "author": {
        "francesco_mazzei": "Francesco Mazzei"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Italian",
    "description": "Fregola, a type of pasta formed into small balls, is a speciality of Sardinia. Here it is cooked with a cornucopia of seafood in a rich sauce.",
    "dishes": [
        "bun",
        "pasta",
        "sauce",
        "seafood",
        "stew",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the fregola": [
            "3 tbsp olive oil",
            "1 garlic clove, finely chopped",
            "1 tbsp shallots, finely chopped",
            "½ red chilli, finely chopped",
            "1 sprig thyme",
            "110g/4oz fregola",
            "300ml/11fl oz fish stock",
            "125g/4½oz clams",
            "175g/6oz mussels",
            "60ml tomato sauce",
            "60g/2¼oz cherry tomatoes, halved",
            "small bunch basil, leaves only",
            "125g/4¼oz shrimps",
            "2 small red mullet fillets",
            "2 scallops, cleaned",
            "1 tsp chives, finely chopped",
            "1 tsp dill, finely chopped",
            "1 tsp tarragon, finely chopped",
            "sea salt and freshly ground black pepper"
        ],
        "For the stewed squid": [
            "1 tsp olive oil",
            "1 tsp garlic oil",
            "1 sprig thyme",
            "50g/2oz shallots, finely sliced",
            "200g/7oz squid, cleaned and cut into small squares",
            "50ml/2fl oz white wine",
            "1 tbsp tomato purée",
            "fine sea salt"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 2",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the squid, heat a frying pan until medium hot, add the olive and garlic oils, thyme and shallots and cook gently for a couple of minutes until the shallot is soft and golden.",
        "Add the squid and as soon as they start to give off their juices add the white wine. Once the alcohol has evaporated, add the tomato purée and simmer for approximately four minutes until squid is tender. Season to taste with the salt and remove the pan from the heat.",
        "For the fregola, heat a sauté pan until medium hot, add half the olive oil and the garlic, shallots, chilli, thyme and cook gently for one minute.",
        "Add the stewed squid, fregola and stock, bring to a simmer then cook for about 10 minutes, adding extra stock or water if necessary to keep the fregola covered.",
        "Add the clams and the mussels and cook for 2-3 minutes, or until they open, then add the tomato sauce, cherry tomatoes, basil and shrimps.",
        "Heat a separate frying pan until hot, add the remaining oil and fry the red mullet fillets on each side until golden then remove from the pan and set aside.",
        "Return the pan to the heat and fry the scallops for one minute on each side.",
        "To serve, stir half the herbs through the fregola then ladle it into bowls. Place the red mullet and scallops on top of the fregola then scatter over with the remaining herbs."
    ],
    "tips": [
        
    ],
    "title": "Sardinian fregola with seafood",
    "videos": "[]"
}