{
    "title": "Sardine and kale spaghetti",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "9",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sardine_and_kale_86512_16x9.jpg"
    ],
    "description": "Not only is this recipe quick and delicious, but it's packed with minerals, vitamins and omega 3 oils. Enjoy! This is designed to be a low cost recipe. Each serving provides 440kcal, 25g protein, 57g carbohydrate (of which 4g sugars), 10.5g fat (of which 2.5 g saturates), 7g fibre and 0.7g salt.",
    "author": {
        "prue_leith": "Prue Leith"
    },
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "tips": [
        "This recipe is designed to be made in conjunction with a low-cost store-cupboard. If you are very fond of sardines you could even use the oil from the tin instead of olive oil."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "300g/10½oz spaghetti",
            "2 tbsp olive oil",
            "2 x 120g/4¼oz tin sardines in olive oil",
            "1 onion, chopped",
            "salt and black pepper",
            "1 garlic clove, finely sliced",
            "½ tsp chilli flakes",
            "200g/7oz curly kale, chopped",
            "1 lemon, juice only"
        ]
    },
    "steps": [
        "Cook the spaghetti in a large saucepan of boiling salted water according to the packet instructions.",
        "Meanwhile, heat a large frying pan over a medium heat. Add 1 tablespoon of oil and, once hot, add the onion and a pinch of salt. Fry gently until soft and golden-brown. Once soft, add the garlic and chilli flakes and cook for a further two minutes.",
        "Break the sardines into bite-sized pieces, discarding any large bones. Add them to the onions together with the remaining oil. Heat through, then add the kale with 3-4 tablespoons of the spaghetti cooking water. Stir to mix well then cover the frying pan with a lid or foil and cook for 3-4 minutes.",
        "Remove the lid and stir until the kale is completely soft.",
        "Drain the spaghetti, reserving a little of the cooking water.",
        "Add the spaghetti to the sauce in the frying pan. Squeeze in the lemon juice and mix through to coat the spaghetti (you may need to add a little of the cooking water to loosen your sauce). Taste and season with salt and black pepper. Serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}