{
    "title": "Sausage burger with caramelised mushrooms, cheese sauce and mushy peas",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "gino_dacampo": "Gino D'Acampo"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the burger": [
            "3 sausages, skins removed",
            "1 free-range egg",
            "25g/1oz breadcrumbs",
            "salt and freshly ground black pepper",
            "1 tbsp olive oil"
        ],
        "For the cheese sauce": [
            "150ml/5fl oz double cream",
            "150g/5oz cheddar cheese, grated",
            "salt and freshly ground black pepper"
        ],
        "For the mushy peas": [
            "250g/9oz frozen peas, cooked",
            "50g/2oz cheddar, grated",
            "50ml/2floz double cream",
            "salt and freshly ground black pepper",
            "1 large slice ciabatta, toasted, to serve"
        ]
    },
    "steps": [
        "For the burger, place the sausage meat, egg and breadcrumbs into a food processor and blend to a rough paste.",
        "Season the sausagemeat mixture well with salt and freshly ground black pepper, then divide into two and shape into two oval patties.",
        "Rub the patties with the oil, season with salt and freshly ground black pepper again, and place into a hot saucepan to fry for 5-6 minutes on each side, or until completely cooked through.",
        "For the cheese sauce, heat the cream in a pan until boiling. Add the cheese and stir well, until the cheese has melted and combined with the cream. Season, to taste, with salt and freshly ground black pepper.",
        "For the mushy peas, place all of the mushy pea ingredients into a bowl, season, to taste, with salt and freshly ground black pepper, then mash to a rough paste with a fork or potato masher.",
        "To serve, place the sausage burgers onto the toasted ciabatta and place onto a plate. Spoon over the cheese sauce and serve the mushy peas in a warm bowl alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}