{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "British",
    "description": "",
    "dishes": [
        "caramel",
        "gravy",
        "sauce",
        "sausage",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the gravy": [
            "700g/1½lb onions, sliced thinly",
            "pinch sugar",
            "2 tbsp sunflower oil",
            "25g/1oz butter",
            "1 tsp plain flour",
            "600ml/1 pint brown ale",
            "600ml/1 pint fresh beef stock",
            "½ star anise",
            "2 cloves",
            "2 fresh bay leaves"
        ],
        "For the mashed potatoes": [
            "900g/2lb floury main crop potatoes,",
            "peeled and cut into chunks",
            "55g/2oz butter",
            "2-3 tbsp milk",
            "salt and freshly ground black pepper"
        ],
        "default": [
            "8 meaty pork sausages",
            "English mustard to serve"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "p0077j91": "Fresh Food"
    },
    "steps": [
        "To make the beer and onion gravy, heat the oil and the butter in a large, heavy based saucepan.",
        "Add the onions and sugar and cook over a low heat for 45 minutes, stirring now and then, until soft and richly caramelised.",
        "Stir in the flour and cook for 1 minute.",
        "Stir in the beer, beef stock, star anise, cloves and bay leaves and boil vigorously until reduced to a rich, glossy sauce - about 20 minutes in a large sauté pan.",
        "Remove the star anise, bayleaves and cloves (if you can find them) from the gravy and season to taste with some salt and pepper.",
        "For the sausages and mashed potato, cook the potatoes in boiling salted water for 20 minutes until soft.",
        "Then after about 10 minutes, heat the oil for the sausages in a large frying pan. Add the sausages and fry them over a medium heat for 8-10 minutes, turning now and then, until nicely browned and cooked through.",
        "Drain the potatoes and mash until smooth - a potato ricer does this really well. Beat in the butter with some seasoning and enough milk to make a smooth, creamy mash.",
        "Spoon the mashed potatoes onto warmed plates and rest the sausages alongside. Pour over some of the gravy and serve with a good spoonful of English mustard."
    ],
    "tips": [
        
    ],
    "title": "Sausages with mashed potatoes, beer and onion gravy and mustard",
    "videos": "[]"
}