{
    "author": {
        "gregg_wallace": "Gregg Wallace"
    },
    "cookTime": "10 to 30 mins",
    "description": "A comforting bowl of hot lentil soup with bite-sized chunks of tasty sausage. Simply a winner. This is designed to be a low cost recipe.",
    "dishes": [
        "pie",
        "sauce",
        "sausage",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1 tbsp olive oil",
            "8 thick pork sausages",
            "25g/1oz butter",
            "1 onion, finely diced",
            "1 carrot, finely diced",
            "2 garlic cloves, peeled and finely chopped",
            "2 sprigs thyme",
            "1 x 410g/14oz tin cooked lentils in water, drained and rinsed",
            "1 litre/1¾ pints stock",
            "salt and pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "steps": [
        "Preheat the grill to medium setting. Place the sausages on a shallow baking tray and grill for 10-15 minutes, or until golden-brown all over. Turn half-way through cooking. (Alternatively heat a dry frying pan over a medium-low heat and fry the sausages until browned on all sides). Allow the sausages to cool slightly before slicing into bite-sized pieces.",
        "Heat a large saucepan over a medium heat and add the butter. Once melted, add the onion and carrot and fry for 8-10 minutes, or until the onions are soft and translucent and the carrot softened. Add the garlic and thyme sprigs, and fry for two minutes or until they become aromatic.",
        "Pour in the lentils and stir round with the vegetables. Add the stock and roughly mash the lentils with a potato masher, then add the sliced sausages and bring to a simmer. Simmer gently over a medium low heat for 10 minutes or until the soup has thickened slightly. Add hot water if the mixture is becoming too thick.",
        "Remove the thyme sprigs, then season to taste with salt and pepper and serve hot."
    ],
    "tips": [
        "In May 2013 this recipe was costed at £3.17 at Asda, £3.69 at Tesco and £3.37 Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "title": "Sausage and lentil soup",
    "videos": "[]"
}