{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Spanish",
    "description": "Simon Rimmer’s version of the classic Spanish pastry makes the perfect snack.",
    "dishes": [
        "bread",
        "oven-baked_dishes",
        "pastry",
        "pasty",
        "sauce",
        "sausage",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "225g/8oz sausages, preferably venison",
            "1 tbsp olive oil",
            "1 onion, finely chopped",
            "1 garlic clove, crushed",
            "1 carrot, diced",
            "1 tbsp tomato purée",
            "¾ tsp ground cumin",
            "1 tsp cocoa powder",
            "1 tsp chilli powder",
            "100ml/3½fl oz beef or game stock",
            "salt and freshly ground black pepper"
        ],
        "For the pastry": [
            "225g/8oz plain flour, plus extra for dusting",
            "½ tsp ground turmeric",
            "½ tsp chilli flakes",
            "75g/2¾oz chilled butter, cut into cubes",
            "pinch salt",
            "50ml/1¾oz milk",
            "1 free-range egg, plus 1 egg yolk"
        ],
        "To serve": [
            "sweet chilli sauce"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Makes 12",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "For the filling, remove the meat from the sausages and discard the skins.",
        "Heat the oil in a frying pan and fry the onion and garlic for 4-5 minutes, or until softened. Add the sausagemeat and fry for a further 4-5 minutes, or until browned.",
        "Add the carrot, tomato purée, cumin, cocoa powder and chilli and cook for a further 3-4 minutes.",
        "Add the stock, bring the mixture to the boil, reduce the heat and simmer for 25 minutes. Season, to taste, with salt and freshly ground black pepper and set aside to cool.",
        "Meanwhile, for the pastry, pulse the flour, turmeric, chilli flakes, butter and salt in a food processor until the mixture resembles breadcrumbs.",
        "Add the milk and egg yolk and pulse until the mixtures comes together as a dough.",
        "Turn the dough out onto a lightly floured surface and knead for a few minutes, then wrap in cling film and chill in the fridge for an hour.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "Roll the pastry out onto a lightly floured work surface and cut out 12 circles of 10cm/4in diameter.",
        "Place a spoonful of the sausage filling into the centre of each pastry circle. Beat the egg in a bowl.",
        "Brush the edge of one half of each of the circles with some of the beaten egg, then fold over the other side and seal - make sure you don't trap any air inside.",
        "Mark around the edges of the sealed pastry with the tines of a fork.",
        "Place the empanadas onto a baking tray and transfer to the oven to cook for 10 minutes, or until the pastry is golden-brown and the filling is hot.",
        "To serve, place the empanadas onto a large serving plate with the sweet chilli dipping sauce in a bowl in the centre."
    ],
    "tips": [
        
    ],
    "title": "Sausage empanadas",
    "videos": "[]"
}