{
    "author": {
        "jos_pizarro": "José Pizarro"
    },
    "cookTime": "less than 10 mins",
    "description": "Quick and tasty, chicken livers make a great light meal. A few fresh herbs and good-quality vinegar will make it something special.",
    "dishes": [
        "bread",
        "caramel",
        "pie",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "3 tbsp extra virgin olive oil",
            "1 banana shallot, finely chopped",
            "2 garlic cloves, finely chopped",
            "50g/1¾oz caramelised onions",
            "400g/14oz free-range chicken livers",
            "2 tbsp sherry vinegar",
            "2 tbsp salted capers, rinsed",
            "5 sprigs flatleaf parsley, leaves picked and chopped",
            "4 slices good-quality bread",
            "1 small red onion, finely sliced",
            "4 sprigs mint, leaves picked and chopped",
            "sea salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Heat the oil in a frying pan and gently fry the shallot, garlic and caramelised onions until soft. Add the livers, season with salt and pepper, and fry for 4 minutes.",
        "Pour in the vinegar and cook for 3 minutes, by which time the vinegar smell should have disappeared. To check the livers are cooked through, remove a piece of liver from the pan and cut it open; it should be moist but no longer bloody (a little tinge of pink is fine). When the livers are cooked, stir in the capers and parsley and remove from the heat.",
        "Toast the bread and cut each slice in half, making two triangles. Arrange on plates and top with the livers. Garnish with a scattering of red onion and chopped mint and serve."
    ],
    "tips": [
        "Take care to cook the livers properly – if they are undercooked there’s a risk of food poisoning but if cooked too long they can be grainy and bitter."
    ],
    "title": "Sautéed chicken livers with capers on toast",
    "videos": "[]"
}