{
    "title": "Sautéed duck with rosti potato and crisp fennel",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_tanner": "James Tanner"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the duck": [
            "1 tbsp butter",
            "½ onion, chopped",
            "1 garlic clove, chopped",
            "¼ fennel bulb, finely chopped",
            "½ red chilli, finely chopped",
            "1 duck breast, skinned and sliced",
            "2 tbsp red wine",
            "sprig fresh thyme, leaves only",
            "salt and freshly ground black pepper"
        ],
        "For the rösti": [
            "150g/5½oz new potatoes, grated",
            "¼ tsp salt",
            "30g/1oz butter"
        ],
        "For the crisp fennel": [
            "100g/3½oz plain flour",
            "2 tbsp cornflour",
            "6-7 tbsp sparkling water",
            "300ml/½ pint vegetable oil, for deep frying",
            "½ fennel bulb, sliced"
        ]
    },
    "steps": [
        "For the duck, heat the butter in a non-stick pan and gently fry the onion until softened but not coloured. Add the garlic and fry for a further minute.",
        "Add the fennel, chilli and the duck breast and fry for 3-4 minutes.",
        "Add the red wine and thyme and simmer for 4-5 minutes, or until the wine has reduced by half and the duck is cooked through. Season, to taste, with salt and freshly ground black pepper and set aside to rest in a warm place.",
        "For the rösti, place the grated potato onto a clean tea towel and squeeze out the excess water. Place the potato into a bowl and season with salt.",
        "Heat the butter in a small non-stick frying pan and press the potato into the base of the pan. Cook over a medium heat until the base is golden-brown. Turn the rösti over with a fish slice and fry until golden-brown on both sides.",
        "For the crisp fennel, place the flour and cornflour into a large bowl and whisk in enough sparkling water to make a thick, smooth batter.",
        "Place the vegetable oil into a deep, heavy-bottomed saucepan and heat until a small cube of bread sizzles and turns golden when dropped into it. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
        "Dip the fennel slices into the batter to coat, shaking off any excess, then carefully place into the hot oil and deep fry until crisp and golden-brown. Remove from the oil with a slotted spoon and drain on kitchen paper.",
        "To serve, place the rösti in the centre of a serving plate and top with the sautéed duck, along with the pan juices, and the crisp fennel."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}