{
    "title": "Savoury pancakes with ham and cheese",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2-3",
    "recommendations": "20",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/savoury_pancakes_with_52388_16x9.jpg"
    ],
    "description": "Why stick to lemon and sugar when these savoury pancakes can kick off a night of batter-based feasting? Flippin' marvellous.",
    "author": {
        
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pancakes": [
            "55g/2oz plain flour",
            "pinch salt",
            "1 free-range egg",
            "140ml/5fl oz milk",
            "oil for frying"
        ],
        "For the cheese sauce": [
            "25g/1oz butter",
            "25g/1oz plain flour",
            "225ml/8fl oz milk",
            "100g/3½ oz Emmental, grated",
            "Freshly ground black pepper, to taste"
        ],
        "To top": [
            "3 spring onions, finely sliced",
            "4 sun-dried tomatoes in oil, drained and chopped",
            "80g/3oz good quality smoked ham"
        ]
    },
    "steps": [
        "Sift the flour and salt into a large bowl. Whisk together the egg and milk in another bowl then, slowly pouring the liquid into the dry ingredients, whisk together until the batter is smooth. Set aside.",
        "For the cheese sauce, melt the butter in a small pan, then whisk in the flour. Cook for one minute, then gradually add the milk whisking continuously. Bring to the boil and reduce the heat to a simmer for one minute until the sauce is thick and smooth. Stir in half of the cheese and season with black pepper.",
        "To make the pancakes, heat a 20cm/8in crêpe or omelette pan until very hot, drizzle in a small amount of oil and tip the pan to swirl the oil around. Ladle in about two tablespoons of batter mix and immediately tilt the pan from side to side to get a thin, even layer of batter to cover the base of the pan. Cook for around 30 seconds until the underside is golden then flip or turn with a pallet knife.",
        "As soon as the pancake is turned scatter over some ham, spring onions and sundried tomatoes. Spoon over some cheese sauce then top with a scattering of the remaining cheese.",
        "Once you’ve topped the pancake the underside will be done. Fold the pancake in half then slip it out of the pan onto a warmed serving plate and keep warm under some foil while you make the remaining pancakes."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}