{
    "title": "Savoury custard tart",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 12",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/savoury_custard_tart_34648_16x9.jpg"
    ],
    "description": "Try a deliciously different custard tart recipe with this savoury version. Serve with a spicy chutney.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "butter, for greasing",
            "3 free-range egg yolks",
            "1 tbsp Dijon mustard",
            "30g/1oz cornflour",
            "1 vanilla pod, split lengthways, seeds scraped out",
            "175ml/6fl oz full-fat milk",
            "225ml/8fl oz double cream",
            "1 tbsp fresh thyme leaves, chopped",
            "300g/10oz ready-made puff pastry",
            "flour, for dusting"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Grease a 12-hole muffin tin with butter.",
        "Heat the eggs yolks, mustard and cornflour in a saucepan over a low to medium heat, whisking continuously until thickened and well combined.",
        "Add the vanilla seeds, then slowly add the milk and cream, whisking continuously, until the mixture is thick, smooth and well combined.",
        "Continue to stir the custard mixture until it comes to the boil, then remove from the heat. Stir in the thyme, then cover the surface with clingfilm to prevent a skin forming and set aside to cool.",
        "Roll the puff pastry out o a floured work surface . Cut the pastry in half and place one sheet on top of the other. Roll the pastry sheets up and cut the roll into twelve slices.",
        "Lay each of the rolled pastry slices flat onto the floured work surface and roll out into 10cm/4in circles.",
        "Press a pastry disc into each of the holes of the muffin tin. Divide the cooled custard equally among the pastry cases.",
        "Bake the tarts for 20 minutes, or until the custard has set and is pale golden-brown and the pastry is crisp and golden-brown. Remove from the oven and set aside to cool slightly."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}