{
    "author": {
        "darina_allen_and_rosemary_kearney": "Darina Allen and Rosemary Kearney"
    },
    "cookTime": "less than 10 mins",
    "description": "Adding melted butter to the batter makes all the difference to the flavour and texture of the pancakes and will make it possible to cook them without greasing the pan each time.",
    "dishes": [
        "crepe",
        "pancake",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/savourypancakebatter_74778_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "175g/6oz tapioca flour",
            "175g/6oz rice flour",
            "½ tsp salt",
            "4 large eggs, preferably free-range, lightly beaten",
            "350ml/12fl oz milk",
            "4 tbsp melted butter"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "1",
    "serves": "Makes 16",
    "show": {
        
    },
    "steps": [
        "Sift the tapioca flour, rice flour and salt into a large bowl. Make a well in the centre and drop in the lightly beaten eggs. Using a whisk and starting in the centre, mix the eggs gradually bringing in the flour mixture. Add the milk slowly and beat until the batter is smooth and covered in bubbles.",
        "Refrigerate the pancake batter for at least one hour. Just before you cook the pancakes, whisk the batter again, as some of the flour will have settled to the bottom, and stir in the melted butter.",
        "To cook the pancakes, heat a heavy cast-iron crèpe pan or a 20-23cm/8-9in non-stick frying pan until very hot. Using a ladle, pour in just enough batter to cover the base of the pan thinly. Loosen the pancake around the edge, flip over with a spatula or thin-bladed fish knife, cook for 1-2 seconds on the other side and slide off the pan onto a plate.",
        "The pancakes may be stacked on top of each other and peeled apart later. Alternatively, they will keep in the fridge for several days or, if a disc of parchment paper is placed between each pancake, they freeze perfectly."
    ],
    "tips": [
        
    ],
    "title": "Gluten-free savoury pancake batter",
    "videos": "[]"
}