{
    "author": {
        "nathan_outlaw": "Nathan Outlaw"
    },
    "cookTime": "over 2 hours",
    "description": "Pickled beetroot and silky homemade mayonnaise accompany the fresh taste of diced scallops with bacon and apple in this dinner party recipe.",
    "dishes": [
        "bread",
        "mayonnaise",
        "pickle",
        "pie",
        "sauce",
        "seafood"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the beetroot": [
            "200g/7oz raw beetroot",
            "2 tsp red wine vinegar",
            "pinch salt",
            "3 tsp sherry vinegar",
            "1 shallot, finely chopped",
            "1 garlic clove, finely chopped",
            "1 tsp chopped thyme",
            "salt and freshly ground black pepper",
            "4 tbsp olive oil"
        ],
        "For the mayonnaise": [
            "3 free-range eggs, yolks only",
            "1 tsp English mustard",
            "½ lemon, juice only or 2 tsp white wine vinegar or cider vinegar",
            "300ml/10fl oz light rapeseed oil",
            "sea salt and freshly ground black pepper"
        ],
        "For the scallops": [
            "4 rashers smoked streaky bacon",
            "12 scallops, cleaned and corals removed, the scallop meat diced into 5mm/¼in pieces",
            "1 apple, peeled, cored, cut into 5mm/¼in dice",
            "1 shallot, finely chopped",
            "2 tsp finely chopped gherkin",
            "2 tsp finely chopped chives",
            "sea salt and freshly ground black pepper"
        ],
        "To serve": [
            "4 slices sourdough bread",
            "handful rocket leaves",
            "lemon wedges",
            "½ quantity mayonnaise, from above"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the mayonnaise, put the egg yolks, mustard and lemon juice or vinegar into a bowl and whisk together for one minute. Now gradually add the oil, drop by drop to begin with, then in a steady stream, whisking constantly, until the mixture is emulsified and thick.",
        "Alternatively, you can make the mayonnaise in a blender or food processor, blending the egg yolks, mustard and lemon juice or vinegar for one minute and then adding the oil slowly through the funnel with the motor running.",
        "Season the mayonnaise with salt and pepper to taste. Cover and refrigerate until ready to serve. It will keep in the fridge for a couple of days.",
        "For the beetroot, place the beetroot in a saucepan, pour on water to cover and add the wine vinegar. Bring to a simmer, add a pinch of salt and cook for 25 minutes.",
        "Leave the beetroot to cool in the water until you are able to handle it, then remove and peel off the skin. Cut the beetroot into 1cm/½in dice, using a sharp knife.",
        "Place in a bowl with the sherry vinegar, shallot, garlic and thyme. Season with salt and pepper and drizzle over the olive oil. Mix well and then cover and leave to marinate for at least two hours.",
        "For the scallops, preheat the grill to high.",
        "Lay the bacon on a grill tray and grill on both sides until very crispy. Allow to cool down and then chop the bacon into small pieces.",
        "Put the scallops and apple into a bowl with the shallot, gherkin, bacon and chives. Add two teaspoons of mayonnaise and mix well. Taste for seasoning and add salt and pepper as required.",
        "To serve, toast the bread on both sides and place on four serving plates. Spoon the scallop tartare neatly on top. Spoon some of the marinated beetroot with a little of its dressing alongside. Scatter over the rocket and serve with lemon wedges and mayonnaise in a bowl on the side for guests to help themselves."
    ],
    "tips": [
        
    ],
    "title": "Scallop tartare with pickled beetroot, bacon and apple",
    "videos": "[]"
}