{
    "title": "Scallops with raw vegetables, almond satay and ponzu",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "When you need a quick starter, scallops are your go-to option. A light Japanese-style dressing and warm almond satay top them off perfectly.",
    "author": {
        "glynn_purnell": "Glynn Purnell"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the ponzu dressing": [
            "75ml/2½fl oz dashi stock (instant dashi powder is available from health food shops)",
            "2 tbsp sugar syrup",
            "2 tbsp rice wine vinegar",
            "4 tsp fish sauce",
            "75ml/2½fl oz lemon juice",
            "100ml/3½fl oz soy sauce"
        ],
        "For the almond satay": [
            "2 shallots, finely chopped",
            "1½ garlic cloves, finely chopped",
            "60g/2¼ oz fresh ginger, finely grated",
            "300g/10½ oz toasted almonds, finely chopped",
            "2 tbsp honey",
            "75ml/2½fl oz soy sauce",
            "1 lime, juice only",
            "1 red chilli, finely chopped",
            "small handful of coriander, finely chopped"
        ],
        "For the scallops and vegetables": [
            "100g/3½oz beansprouts, halved",
            "100g/3½oz mangetout, julienned",
            "100g/3½oz carrot, julienned",
            "1 tbsp sunflower oil, for frying",
            "4 large scallops, roe separated (with shells for serving, if possible)",
            "knob of butter",
            "squeeze lime juice",
            "few sprigs fresh coriander"
        ]
    },
    "steps": [
        "For the ponzu dressing, whisk all the ingredients together in a jug and set aside.",
        "For the almond satay, gently fry the shallot and garlic until softened, but not browned. Add the ginger and gently fry for a further 5 minutes.",
        "Mix in the toasted almonds, honey, soy sauce, lime juice and cook for 2 minutes.",
        "Remove from the heat and add the chilli and the coriander. Set aside in a warm place.",
        "Mix the bean sprouts, mangetout and carrot together in a bowl and set aside.",
        "For the scallops, heat a frying pan over a high heat. Pour the sunflower oil into the hot pan and fry the scallops and for 2 minutes.",
        "Once golden-brown on the one side turn over and continue to fry for a minute. Add a knob of butter to the pan and quickly baste each scallop. Finish with a squeeze of lime juice.",
        "Serve immediately in the scallop shells with the raw vegetables alongside and a spoon of warm almond satay. Spoon over 3 tablespoons of the ponzu dressing, place a sprig of coriander over the top and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}