{
    "title": "Scallop stew",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 3",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Peruvian chef Virgilio Martinez prepares scallops in a wonderful stew flavoured with herbs, white wine and amarillo chilli paste.",
    "author": {
        "virgilio_martinez": "Virgilio Martinez"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the fish stock preparation": [
            "1 pinch dried thyme",
            "2-3 whole peppercorns",
            "1 whole clove",
            "3-4 parsley stems",
            "1 bay leaf",
            "50g/1¾oz unsalted butter",
            "1½ carrots",
            "¼ stick celery, chopped",
            "70g/2½oz finely sliced red onions",
            "1kg/2lb 4oz fish bones",
            "250ml/9fl oz white wine"
        ],
        "For the scallops": [
            "4 medium yellow potatoes (such as Yukon Gold)",
            "2 tsp vegetable oil",
            "10g chopped fresh garlic",
            "40g/1½oz chopped red onions",
            "100g/3½oz 'Ají Amarillo' chilli paste",
            "50g/1¾oz tomato purée",
            "4 tsp white wine",
            "20g/¾oz coriander leaves",
            "24 cleaned scallops",
            "4 tsp lime juice",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Make a bouquet garni by tying the thyme, peppercorns, clove, parsley stems and bay leaf into a piece of muslin.",
        "In a heavy-bottomed stockpot or large saucepan, melt the butter. Add the vegetables, cover with a lid and cook on a low to medium heat for 5 minutes, or until the onions are softened and slightly translucent (the vegetable shouldn’t be browned).",
        "Add the fish bones and cook for another couple of minutes, covered, until the bones are slightly opaque. Add the wine and bring to a simmer. Add the bouquet garni and 1.5 litres/2½ pints water. Simmer for 40-45 minutes. Strain through a seive and set aside.",
        "For the scallops, boil the yellow potatoes for 15-20 minutes until cooked through. When cool enough to handle, peel them, cut into quarters and set aside.",
        "Heat the vegetable oil in a saucepan over medium high heat. Add garlic and red onion and cook for 10 minutes. Add the 'ají amarillo' and tomato purée, stirring constantly.",
        "Add 150ml/5fl oz of the fish stock. Stir in the white wine and coriander leaves. Lower the heat, and cook with the lid on for 15 minutes. Season with salt and pepper and add the cooked potatoes.",
        "Season the scallops with salt and add them to stew. Cover with a lid and let it steam for a few minutes until the scallops are just done (be careful not to overcook them). Add the lime juice and serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}