{
    "title": "Scallops with black pudding, mushroom and caramelised pears",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Scallops with black pudding is a classic combination, James Martin takes it to the next level with mushroom and caramelised pear. Top it all off with a frisée salad for a truly special meal.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the caramelised pears": [
            "75g/2¾oz unsalted butter",
            "25g/1oz caster sugar",
            "2 pears, peeled and sliced into wedges"
        ],
        "For the black pudding, mushroom and scallops": [
            "100ml/3½fl oz olive oil",
            "2 field mushrooms, trimmed",
            "2 thick slices black pudding",
            "100g/3½oz unsalted butter",
            "6 scallops, removed from their shell, roe removed"
        ],
        "For the salad": [
            "1 head frisée lettuce, yellow leaves removed",
            "1 orange, juice and zest only",
            "3 tbsp olive oil",
            "2 tbsp sherry vinegar"
        ],
        "To serve": [
            "100ml/3½fl oz veal jus or beef gravy"
        ]
    },
    "steps": [
        "For the caramelised pears, heat a frying pan and add the butter. Once melted, add the sugar and pear wedges. Cook until caramelised, this should take about 3-4 minutes. Transfer to a warm plate and wash the pan.",
        "For the black pudding, mushroom and scallops, put the pan over a high heat and add half the olive oil. Add the mushrooms and cook for 2-4 minutes. Add the remaining oil and the black pudding. Cook on each side until golden-brown and crisp. Transfer the mushrooms and black pudding to a warm plate and wipe the pan clean.",
        "Heat the butter in the pan, once hot add the scallops and cook on each side for 1-2 minutes (depending on the size of the scallops).",
        "For the salad, put the frisée lettuce in a salad bowl. Put the remaining salad ingredients in a small bowl and whisk. Just before serving pour the dressing over the salad leaves and mix.",
        "To serve, place the mushrooms in the centre of the plates and top with the black pudding, scallops and salad. Place the pear around the plates and pour the jus on top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}