{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "Combine aromatic flavours for a delicious scallop recipe - a perfect treat whatever the weather.",
    "dishes": [
        "bread",
        "bun",
        "jam",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "50g/2oz butter",
            "24 queen scallops, shells cleaned and reserved",
            "1 shallot, finely diced",
            "½ head fennel, finely diced",
            "2 tbsp Pernod, or other anise-flavoured liqueur",
            "75ml/3floz white wine",
            "75ml/3floz double cream",
            "1 small bunch watercress, roughly chopped",
            "2 tbsp roughly chopped flatleaf parsley,",
            "5 tbsp fresh breadcrumbs",
            "2 tbsp cheddar, grated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the grill to high.",
        "Heat a frying pan until hot, add a little of the butter and the scallops and fry for 30 seconds on each side, or until golden-brown on both sides.",
        "Remove the scallops from the pan and set aside.",
        "Add some more butter, the shallots and fennel and fry for 2-3 minutes.",
        "Carefully pour in the Pernod and flambé the liquid by slowly tilting the pan towards the gas flame, or light it with a match. Let the flames flare up then die down. (Caution: keep your face and hair away from the flames. Do not leave unattended.)",
        "Add the white wine and double cream and cook until reduced by half. Season with salt and freshly ground black pepper.",
        "Heat a separate frying pan until hot, add the remaining butter and the watercress and cook until just wilted. Press to remove any excess water.",
        "Let the watercress cool slightly, then chop finely and mix with the parsley, breadcrumbs and cheese.",
        "Place the scallops back into their shells, spoon over some sauce and top with the breadcrumbs.",
        "Place the scallops onto a baking tray and grill for 2-3 minutes, or golden-brown and bubbling."
    ],
    "tips": [
        
    ],
    "title": "Scallops Flintoff",
    "videos": "[]"
}