{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "Scouse is a type of thrifty meat stew, in this case made with lamb. Here Liverpool’s finest stew is topped with a layer of puff pastry to make a homely pie.",
    "dishes": [
        "bun",
        "casserole",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "stew",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/scouse_pie_49004_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 tbsp vegetable oil",
            "1 kg/2lb 4oz neck of lamb, on the bone",
            "2 onions, sliced",
            "2 large carrots, cut into chunks",
            "500g/1lb 2oz potatoes, cut into large chunks",
            "1 litre/1¾fl oz beef stock",
            "1 bay leaf",
            "small bunch thyme",
            "salt and pepper",
            "400g/14oz puff pastry",
            "1 free-range egg, lightly beaten"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "6",
    "serves": "Serves 6",
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "steps": [
        "Heat the oil in a casserole dish and brown the lamb on all sides. Once browned, remove from the pan and leave to one side.",
        "Add the onions to the casserole used to cook the meat and fry until softened, but not browned. Return the lamb to the pan and add all the remaining ingredients, except the pastry and egg.",
        "Bring to the boil, then reduce the heat to a simmer, place on the lid and cook for two hours, or until the lamb is starting to fall off the bone. If the liquid reduces too much during cooking top up with water.",
        "Taste the liquid in the pan and season with more salt and pepper if required.",
        "Pre-heat the oven to 200C/400F/Gas 6.",
        "Roll out the pastry slightly larger than the casserole dish. Cut a line of pastry the size of the circumference of the dish. Place the line of pastry around the rim of the dish. Brush with egg and stick the pastry lid on top, pressing the edges to seal. Brush the top with egg.",
        "Bake in the hot oven for 20-25 minutes, or until golden-brown."
    ],
    "tips": [
        
    ],
    "title": "Scouse pie",
    "videos": "[]"
}