{
    "title": "Sea bream with a courgette salad with fresh mint and rocket",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "15",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sea_bream_with_a_77021_16x9.jpg"
    ],
    "description": "Mediterranean flavours pack in punch here and would work just as well with sea bass or tuna. This meal provides 551 kcal, 39g protein, 11g carbohydrate (of which 8g sugars), 36g fat (of which 4.5g saturates), 2.6g fibre and 1.7g salt per portion.",
    "author": {
        "gennaro_contaldo": "Gennaro Contaldo"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the sea bream": [
            "4 x 200g/7oz sea bream fillets",
            "1 lemon, juice only",
            "6 tbsp extra virgin olive oil, plus extra for drizzling",
            "2 garlic cloves, finely chopped",
            "1 tbsp capers",
            "4 anchovies",
            "200ml/7floz white wine",
            "300g/10½oz cherry tomatoes, halved, deseeded",
            "salt and freshly ground black pepper",
            "150g/5oz black olives, pitted",
            "1 handful parsley, finely chopped",
            "1 pinch oregano"
        ],
        "For the courgette salad": [
            "125ml/4fl oz extra virgin olive oil",
            "4 tbsp balsamic vinegar",
            "1 garlic clove, finely chopped",
            "handful fresh mint, finely chopped",
            "4 small courgettes",
            "2-3 handfuls of rocket leaves"
        ]
    },
    "steps": [
        "For the bream, place the fish fillets in a bowl, squeeze over the lemon juice and leave to marinate for 30 minutes.",
        "Preheat the oven to 200C/400F/Gas 6. Heat the olive oil in a large frying pan, add the garlic, capers and anchovy fillets and cook over a medium heat for five minutes, until the anchovies have dissolved.",
        "Add half of the wine and simmer until it has evaporated, then add the tomatoes, squashing them slightly.",
        "Season with salt and freshly ground black pepper and cook for five minutes, then add the olives and continue to cook for a further 10 minutes.",
        "Place the fish in an ovenproof dish and season with salt and freshly ground black pepper. Add the parsley, the remaining white wine, the sauce, a drizzle of olive oil and the oregano and cover with foil. Bake in the oven for 20 minutes, removing the foil halfway through cooking.",
        "Meanwhile, make the salad. Whisk the olive oil and vinegar together with the garlic and mint in a small bowl and set aside.",
        "Trim the ends of the courgettes and, with a potato peeler or mandolin, slice them lengthways into wafer-thin slices.",
        "Add the courgette slices to the dressing, mix well and leave to marinate for at least 10 minutes.",
        "Mix the rocket with the courgettes and place on serving plates. When the fish is cooked, let it rest for one minute then serve alongside the salad."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}