{
    "title": "Sea bass ceviche",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Martin Morales combines the flavours of Peru to create a a wonderfully fresh ceviche, the perfect light starter for a dinner party. Equipment and preparation: For this recipe you will need a blender to make the chilli paste.",
    "author": {
        "martin_morales": "Martin Morales"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        "If making this for a dinner party, the tiger's milk can be stored in the fridge for up to four hours and the sweet potatoes and red onion can also be prepared in advance to reduce last-minute stress."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the Amarillo chilli paste": [
            "2 tbsp vegetable oil",
            "4 Amarillo chillies, deseeded, diced (available online)",
            "1 white onion, finely diced",
            "3 garlic cloves, finely chopped"
        ],
        "For the sweet potato": [
            "1 sweet potato, peeled, cut into 1cm/½in small cubes",
            "200ml/7fl oz orange juice",
            "1 tsp caster sugar",
            "2 cloves",
            "½ cinnamon stick",
            "1 star anise"
        ],
        "For the Amarillo chilli tiger's milk": [
            "fresh root ginger, approximately 5mm/¼in, peeled, halved",
            "1 small garlic clove, halved",
            "4 coriander sprigs, roughly chopped",
            "8 limes, juice only",
            "½ tsp salt"
        ],
        "For the seabass ceviche": [
            "1 large red onion, thinly sliced",
            "iced water",
            "600g/1lb 5oz sea bass fillet (or other white fish), skinned, trimmed, cut into equal 2x3cm/¾x1¼in strips",
            "1 tsp finely chopped coriander leaves",
            "1 red chilli, deseeded, finely chopped",
            "fine sea salt"
        ]
    },
    "steps": [
        "For the chilli paste, heat the oil in a medium sauté pan. When hot add the chillies, onion and garlic and cook for 5-7 minutes. Leave to cool, then put in a blender and blend until smooth then set aside.",
        "Put the sweet potato in a large pan with the orange juice, sugar and 200ml/7fl oz water and bring to the boil. Add the cloves, cinnamon and star anise and cook over a high heat for 6-8 minutes, or until just tender. Drain and run under cold water. Discard the cloves, cinnamon and star anise. Put the sweet potatoes in a bowl and set aside.",
        "For the chilli tiger’s milk, put the ginger, garlic, coriander and lime juice in a bowl. Stir and leave to infuse for 3 minutes. Strain the mixture through a sieve into another bowl. Add the salt and chilli paste made earlier, and mix.",
        "For the ceviche, wash the red onion and leave to soak in iced water for 5 minutes. Drain thoroughly, spread out on kitchen paper or a clean tea towel to remove any excess water and then put in the fridge until needed. This will reduce the strength of the onions and help to keep them crisp.",
        "Put the fish in a large bowl, add a good pinch of salt and mix together gently with a metal spoon. The salt will help open the fish’s pores. Leave for 2 minutes and then pour over all of the chilli tiger’s milk and combine gently. Leave the fish to ‘cook’ in this marinade for 2 minutes.",
        "Add the onions, coriander, chilli and sweet potato to the fish. Mix together gently and season to taste. Divide between serving bowls and serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}