{
    "title": "Sea bass ceviche on corn husks with a palm heart salad",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Peruvian food is gaining recognition in the UK and this recipe involves wrapping the marinated raw fish in corn-on-the-cob husks and combining it with some surprising South American ingredients.",
    "author": {
        "martin_morales": "Martin Morales"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the chilli paste": [
            "1 tbsp vegetable oil",
            "100g/3½oz fresh amarillo chillies, seeds removed",
            "½ small onion, chopped",
            "2 garlic cloves, chopped"
        ],
        "For the sea bass ceviche on corn husks": [
            "4 sea bass fillets, cut into 2cm/¾in cubes",
            "30 medium-sized clams, washed and dried",
            "2 spring onions, finely chopped",
            "4 garlic cloves, finely chopped",
            "2 white onions, finely chopped",
            "6 amarillo chillies, finely chopped",
            "2 tbsp amarillo chilli paste (see above)",
            "8 large corn-on-the-cob husks"
        ],
        "For the palm heart salad": [
            "200g/7oz tinned palm hearts, drained and cut into 5mm/¼in slices",
            "80g/3oz pitted Peruvian botija olives, chopped",
            "1 amarillo chilli, finely diced",
            "100g/3½oz fresh South American-style cheese or feta, cut into 1cm/½in cubes",
            "4 tbsp extra virgin olive oil",
            "1 lime, juice only",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "1 large bunch coriander, leaves finely chopped",
            "50g/1¾oz baby leaf spinach",
            "2 tbsp alfalfa sprouts"
        ]
    },
    "steps": [
        "For the chilli paste, heat a medium frying pan and add the oil. Once hot, add the chillies and onion and fry for 10 minutes until softened, but not coloured.",
        "Add the garlic and cook for a further five minutes on a low heat. Place in a food processor and blend until smooth. Set aside.",
        "For the sea bass ceviche on corn husks, put the fish, clams, spring onions, garlic, onions, amarillo chilli and two tablespoons of the amarillo paste in a bowl and season to taste with fine sea salt. Stir gently to mix. Any remaining amarillo paste can be stored in an air-tight container in the fridge and used for another recipe.",
        "Prepare a barbecue (a coal one is best for this dish) or a griddle pan. If you are using a griddle pan, ensure it is hot before cooking.",
        "Open two of the corn husks and place them on top of each other. Repeat this four times so that you create four corn husk ‘plates’.",
        "Spoon the fish and clam mixture on top of the husk plates, reserving some of the marinade. Carefully place each of the filled husk plates on the prepared barbecue or griddle pan. Cook for 5–7 minutes over a low to medium heat.",
        "For the palm heart salad, place the palm hearts, olives, chilli and cheese in a large bowl and mix together.",
        "Whisk together the oil and lime juice with salt and freshly ground black pepper in a small bowl. Pour the dressing over the salad ingredients and stir.",
        "To serve, carefully lift the filled husks off the barbecue (avoiding any spillage) and place them on a serving dish. Drizzle with the reserved marinade and sprinkle with coriander before serving. Divide the spinach leaves among the serving plates and top with the dressed salad. Sprinkle with alfalfa sprouts."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}