{
    "title": "Seafood bhaji",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "300g/10½oz plain flour",
            "150ml/5fl oz water (approx)",
            "1 green chilli, finely chopped",
            "2 tbsp vegetable oil, to shallow fry",
            "1 large onion, sliced",
            "100g/3½oz king prawns, cooked",
            "100g/3½oz salmon, cooked",
            "100g/3½oz haddock, cooked",
            "400ml/14fl oz vegetable oil, to deep fry"
        ],
        "To serve": [
            "large handful fresh coriander leaves, chopped",
            "mango chutney",
            "plain yoghurt, garnished with fresh mint leaves"
        ]
    },
    "steps": [
        "Place the flour into a large bowl. Gradually add the water, whisking constantly, until a thick batter is formed. Add the chilli and mix in well.",
        "Heat the two tablespoons of vegetable oil in a frying pan over a medium heat. Add the onion and fry until soft, then remove with a slotted spoon.",
        "Place the prawns, salmon and haddock into a clean bowl and add cooked onion, stirring well to combine.",
        "Heat the 400ml/14fl oz of vegetable oil in a deep, heavy-bottomed saucepan until a breadcrumb sizzles and turns brown when dropped in it. (CAUTION: hot oil can be dangerous - do not leave unattended!).",
        "Using a tablespoon, take even amounts of the fish mixture and dip into the batter mixture, then carefully place into the hot oil. Deep-fry for 8-10 minutes, or until crisp and golden and completely cooked through, then carefully remove with a slotted spoon and drain on kitchen paper.",
        "To serve, place the bhajis into a serving bowl with the coriander, mango chutney and yoghurt in bowls alongside for dipping."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}