{
    "title": "Seared stuffed lamb with ratatouille vegetables and basil sauce served with herbed couscous",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the steaks": [
            "1x200g/7oz lamb steak",
            "small handful basil leaves, torn",
            "5 mini mozzarella balls",
            "1 tbsp olive oil",
            "salt and freshly ground black pepper"
        ],
        "For the sauce": [
            "3 tbsp red wine",
            "1 tbsp basil leaves, torn"
        ],
        "For the vegetables": [
            "1 tbsp olive oil",
            "¼ onion, finely chopped",
            "½ aubergine, cut into cubes",
            "½ romero pepper, cut into cubes"
        ],
        "For the couscous": [
            "45g/1½oz dried couscous",
            "100ml/3½fl oz boiling water",
            "1 tbsp basil, torn",
            "1 tbsp parsley, chopped"
        ]
    },
    "steps": [
        "For the lamb, make a slit in the side of the lamb steak and stuff with the basil, mozzarella and season with salt and freshly ground black pepper. Secure with a cocktail stick.",
        "Heat the olive oil in a frying pan over a high heat. Add the lamb steak and fry for six minutes, until brown and cooked through. Remove from pan and keep warm.",
        "Add the red wine to the pan and reduce the liquid by half. Stir through the basil and keep warm.",
        "For the vegetables, heat the olive oil in a frying pan over a medium heat. Add the onion, aubergine, and pepper and fry until the vegetables have softened.",
        "For the couscous, place it into a bowl with the boiling water as per packet instructions. Stir through the herbs and plenty of salt and freshly ground black pepper. When it is ready, press it into a small timbale or mould.",
        "To serve, place the lamb into the centre of a serving plate. Arrange the vegtables to one side of the meat and carefully tip the timbale of couscous out on the other side. Drizzle with sauce and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}