{
    "title": "Seared tuna steak with an apricot and beetroot glaze, pickled vegetable and beetroot purée",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Pickled beetroot, radish, carrots and shallots make a fine accompaniment to a sweet glazed fresh tuna steak in this simple, yet impressive recipe.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pickled vegetables": [
            "5 baby beetroots, peeled",
            "200g/7oz caster sugar",
            "200ml/7fl oz Pedro Ximenez sherry vinegar",
            "pinch salt",
            "½ bunch breakfast radishes",
            "1 carrot, cut into thin strips",
            "100g/3½oz round shallots, thinly sliced"
        ],
        "For the beetroot purée": [
            "400ml/14fl oz beetroot juice",
            "salt and freshly ground black pepper",
            "½ tsp xanthan gum"
        ],
        "For the seared tuna steak with an apricot and beetroot glaze": [
            "2 tbsp vegetable oil",
            "4 x 200g/7oz tuna steaks",
            "2 tbsp apricot jam",
            "100ml/3½fl oz beetroot juice",
            "2 tbsp micro herbs"
        ]
    },
    "steps": [
        "For the pickled vegetables, slice the beetroot thinly using a mandoline. Set aside.",
        "Place 400ml/14fl oz water, and the sugar, vinegar and a pinch of salt into a non-reactive pan and bring to the boil. Split the pickling liquor into two different pans. Add the beetroot to one pan and the rest of the vegetables to the other, then remove from the heat and set both aside to cool in the pickling liquid.",
        "For the beetroot purée, place the beetroot juice in a pan and season with salt and freshly ground black pepper. Add the xantham gum and heat the pan gently, whisking until thick, then set aside.",
        "For the seared tuna steak, place the apricot jam and beetroot juice in a bowl and add the tuna.",
        "Heat a large frying pan and when hot add the oil. Place the steaks in the hot oil and cook for 1-2 minutes on each side. Remove from the pan and allow to rest for a few minutes. Just before serving slice the steak.",
        "To serve, brush the purée on the plate and place the sliced tuna on top with the pickled vegetables on the top and garnish with the micro herbs."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}