{
    "title": "Seared tuna with watermelon, ginger pickle purée and baby leaves",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Griddled watermelons add colour to this unusual dish.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the ginger pickle purée": [
            "3 tbsp rapeseed oil",
            "1 tsp cumin seeds",
            "2 tsp sesame seeds",
            "200g/7oz root ginger, thinly sliced",
            "1 green chilli, slit open",
            "1 tsp red chilli powder",
            "salt",
            "100g/3½oz tamarind paste",
            "100g/3½oz palm sugar",
            "pinch asafoetida",
            "1 dried red chilli",
            "½ tsp mustard seeds",
            "5-6 curry leaves"
        ],
        "For the seared tuna and watermelon": [
            "2 tbsp rapeseed oil",
            "500g/1lb 2oz piece fresh tuna, sliced into four pieces",
            "¼ watermelon, cut into bite-sized pieces"
        ],
        "To serve": [
            "10g/⅓oz salad mache (lamb's lettuce)",
            "2 tbsp coriander cress",
            "½ bunch breakfast radishes",
            "2 tbsp baby sorrel leaves"
        ]
    },
    "steps": [
        "For the pickled ginger purée, heat two tablespoons of the oil in a frying pan, fry the cumin seeds for 1-2 minutes, then add the sesame seeds, ginger, green chilli and chilli powder. Season with a little salt.",
        "Stir for 2-3 minutes and then cover with a circle of greaseproof paper and let the mixture cook slowly for 40-45 minutes, or until the ginger is almost cooked.",
        "Let the mixture cool, then transfer to a food processor and blend to a fine paste with the tamarind paste and palm sugar.",
        "Heat the remaining oil in a separate pan, add the asafoetida, dried chilli and mustard seeds. As the mustard seeds pop, carefully add the curry leaves, keeping your face clear of the mustard seeds. Stir for 30 seconds and then pour into the ginger mixture and mix well. Set aside.",
        "For the seared tuna and watermelon, heat a large griddle pan and oil the tuna and watermelon.",
        "Place the tuna on the griddle first and cook for approximately one minute on each side, or until cooked to your liking. Add the watermelon to the griddle and cook until bar marks appear on all sides.",
        "To serve, smear a line of the purée on each plate and arrange the tuna and watermelon on top. Dress with the leaves and radishes."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}