{
    "title": "Seared beef fillet with watercress, gorgonzola and parmesan dressing",
    "cookTime": "less than 10 mins",
    "prepTime": "overnight",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "john_torode": "John Torode"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the beef": [
            "400g/14oz beef fillet",
            "12 black peppercorns",
            "½ tsp sea salt",
            "few sprigs fresh thyme, leaves only",
            "5 tbsp extra virgin olive oil"
        ],
        "For the dressing": [
            "1 free-range egg yolk",
            "2 tsp vinegar",
            "2 tsp water",
            "20g/¾oz parmesan, freshly grated",
            "2 tbsp olive oil",
            "110ml/4fl oz vegetable oil",
            "4 tsp double cream",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "2 lemons, juice only",
            "110g/4oz gorgonzola",
            "50g/2oz watercress"
        ]
    },
    "steps": [
        "For the beef, place the beef fillet onto a sheet of cling film and roll into a sausage shape. Place into the fridge overnight to set the shape.",
        "Grind the peppercorns, salt and thyme together in a pestle and mortar. Remove the cling film from the fillet, then rub lightly with a tablespoon of the olive oil. Rub the pepper mixture into the beef. Heat a frying pan until very hot, then add the beef and sear on all sides.",
        "Remove the beef from the heat. Using a long, sharp knife, slice the beef as thinly as possible. Place the slices onto a board and press with the flat side of the knife to extend each slice.",
        "Take a large, cold serving plate and drizzle with the remaining olive oil. Rub the oil over the plate with your fingers and then spread the beef slices over the plate.",
        "For the dressing, place the egg yolks, vinegar, water and parmesan into a bowl and beat well until pale. Gradually add the olive and vegetable oils, whisking all the time so that it doesn't split. When all the oil has been incorporated, stir in the cream and season, to taste, with salt and freshly ground black pepper.",
        "To serve, squeeze the lemon juice over the meat, crumble over the gorgonzola and top with the watercress. Drizzle over 1-2 tablespoons of the dressing. Any leftover dressing can be kept, covered, in the fridge for up to two days and used as a dip for warm bread."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}