{
    "title": "Seared spiced tuna with chinese leaf salad",
    "cookTime": "less than 10 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 4",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "This Asian-style tuna recipe is low in fat but full of flavour.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the tuna": [
            "4 x 200g/7oz fresh tuna steak",
            "110g/4oz apricot jam",
            "1 tbsp soy sauce",
            "1 tsp coriander seeds, lightly crushed",
            "1 tsp cumin seeds, lightly crushed"
        ],
        "For the salad": [
            "400g/14oz mixed Chinese leaves, roughly chopped",
            "75g/3oz mooli (daikon), finely sliced",
            "200g/7oz chinese long beans, sliced, blanched",
            "2 red chillies, finely sliced on the diagonal",
            "3 tbsp fresh mint leaves",
            "3 tbsp fresh coriander leaves",
            "1 lime, juice only",
            "1 tbsp fish sauce",
            "1 tbsp soy sauce",
            "1 tbsp palm sugar"
        ]
    },
    "steps": [
        "For the tuna, place the tuna onto a plate.",
        "Whisk the apricot jam, soy sauce, coriander seeds and cumin seeds together in a bowl with salt and freshly ground black pepper. Pour the mixture over the tuna and turn it over to ensure it is well coated in the marinade.",
        "Set aside to marinade for 30 minutes.",
        "Heat a griddle pan until hot. Place the tuna onto the griddle and cook for one minute, turn it 90 degrees and cook for a further minute. Turn the fish over and cook for another 1-1½ minutes (for rare). Remove the tuna from the pan and set aside to rest for one minute.",
        "For the salad, place the salad leaves, mooli, beans, chillies, mint and coriander leaves into a bowl and toss to combine.",
        "Whisk the lime juice, fish and soy sauces and palm sugar together in a bowl, then drizzle over the salad.",
        "Add a little dressing to the salad and mix until well combined.",
        "To serve, carve the tuna into thick slices, arrange on a serving plate and pile the salad alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}