{
    "title": "Seared cod salad with ‘scad the beggars’, potato farls and wild garlic",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "‘Scad the beggars’ is a Northern Irish dish of oats fried in bacon fat - used here as an alternative to croutons in this hearty salad.",
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the potato farls": [
            "60g/2¼oz plain flour, plus a little extra if required",
            "salt, to taste",
            "60g/2¼oz butter",
            "3 tbsp chives, chopped",
            "750g/1lb 10oz mashed potatoes, warm",
            "melted butter or bacon fat, to serve"
        ],
        "For the ‘scad the beggars’": [
            "150g/5½oz bacon lardons, preferably cut from belly pork",
            "1 tbsp vegetable oil",
            "100g/3½oz jumbo oats",
            "salt and pepper"
        ],
        "For the cod": [
            "400g/14oz thick cod loin",
            "2 tbsp light olive oil",
            "handful of wild garlic, optional",
            "handful of lamb’s leaf salad",
            "250g/9oz crème fraîche",
            "4 tbsp vinaigrette (made from 2 tbsp reserved bacon fat, 1 tbsp olive oil, 1 tbsp white wine vinegar, 1 tsp Dijon mustard, salt and pepper)"
        ]
    },
    "steps": [
        "For the potato farls, preheat a pancake griddle or a heavy frying pan over a low-medium heat.",
        "Sprinkle the flour, salt, butter and chives onto the potatoes and knead briefly (not too much or the dough will become tough). If your potatoes are a little wet you may need a little more four.",
        "Divide the dough into two balls and roll each out into a large circle a bit less than 1cm/½in thick.",
        "Cook on the dry griddle for 3-4 minutes on each side until lightly browned.",
        "Brush with a little melted butter or bacon fat and cut into eight wedges. Keep warm until ready to serve.",
        "For the ‘scad the beggars’, fry the bacon in the oil until nicely browned, this will take about 5-6 minutes.",
        "Tip the bacon into a sieve, reserving the bacon fat. Set aside two tablespoons of fat for the vinaigrette and pour the rest back into the pan and add the oats.",
        "Fry for about three minutes until lightly toasted then add the bacon back into the toasted oats and season with salt and pepper. Keep warm while you cook the cod.",
        "For the cod, cut the cod loins into about 8-12 pieces.",
        "Season with salt and pepper and toss in the oil. Fry in a hot non-stick pan for two minutes on each side. Add the wild garlic leaves and remove from the heat.",
        "To serve, place two teaspoons of crème fraîche on each plate and then add two pieces of potato farls. Top the farls with some cod pieces, the wild garlic leaves and salad leaves. Arrange the ‘scad the beggars’ around each plate and drizzle with a little vinaigrette."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}