{
    "title": "Seashell caramels",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Makes 20 chocolates",
    "recommendations": "2",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/seashell_caramels_89965_16x9.jpg"
    ],
    "description": "These pretty dark chocolate shells are filled with caramel and sealed with a white chocolate base. Equipment: You will need 20 assorted seashell or similar chocolate moulds and a sugar thermometer.",
    "author": {
        "kitty_hope_and_mark_greenwood": "Kitty Hope and Mark Greenwood"
    },
    "show": {
        "b04d9lns": "Sweets Made Simple"
    },
    "tips": [
        "You will not need all the dark chocolate but it's easier to temper chocolate in larger quantities. Any leftover chocolate can be cooled in a heatproof container and used later in other recipes."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "300g/10½oz dark chocolate (use a good bar of chocolate, not chocolate chips), chopped finely",
            "55ml/2fl oz double cream",
            "½ tbsp dark muscovado sugar",
            "15g/½oz caster sugar",
            "good pinch of sea salt crystals",
            "100g/3½oz white chocolate"
        ]
    },
    "steps": [
        "Put the dark chocolate into a bowl over a pan of some simmering water. Don’t let the bowl touch the water or the chocolate will burn, and don’t let any water into the chocolate or the chocolate will seize.",
        "Use a chocolate thermometer and bring the temperature up to 42C/110F. Then take it off heat and let it cool to 32C/90F. Use a brush or a teaspoon to coat and line the seashell moulds with the chocolate (you will not need all the chocolate). You’ll need to do this quickly before the chocolate sets.",
        "Use a sharp knife or chocolate scraper tongue to tidy up any messy bits around the chocolate shells. Scrape any dark chocolate that you haven’t used into a bowl and save it to use again.",
        "Slide the moulds into the fridge to set for around 20 minutes.",
        "To make the salted caramel, put the cream and dark muscovado sugar into a heavy-based pan and warm over a low heat.",
        "Meanwhile put the caster sugar into a small heavy-based pan and heat gently, stirring, to melt the sugar. Once melted, continue to cook without stirring until it is a dark golden-brown.",
        "Take the pan off the heat and add in the warmed cream and muscovado sugar, taking care as it will bubble up. Once the initial bubbling subsides, stir quickly with a wooden spoon to make a caramel. Let it cool a little, then stir in the sea salt. Allow the caramel to cool completely until thick.",
        "When the caramel has cooled, take the chocolate moulds out of the fridge and place a teaspoon of the caramel in each of the chocolate shells. Do not overfill. Set aside in the fridge to firm up.",
        "Melt the white chocolate, as before. Then spoon the chocolate over the caramel to cover. Chill again for 15 minutes. When hard, gently turn the chocolates out of the mould.",
        "Store in an airtight container in the fridge for up to five days."
    ],
    "howTos": [
        "how_to_make_caramel_and_praline",
        "how_to_temper_chocolate"
    ],
    "videos": "[]"
}