{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "description": "If you don’t have seed and grain bread flour, use the same quantity of white bread flour and add two tablespoons of mixed seeds such as sesame, sunflower and pumpkin seeds.",
    "dishes": [
        "bread",
        "breadsticks",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "250g/9oz white seed and grain bread flour",
            "1 tsp salt",
            "1 tsp sugar",
            "1 tsp fast-action yeast",
            "2 tbsp olive oil, plus extra for oiling",
            "a little semolina or polenta, or sesame and poppy seeds, for rolling the breadsticks in",
            "sea salt, to sprinkle"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "4",
    "serves": "Makes about 18 breadsticks",
    "show": {
        "p01s4q10": "Mary Berry Cooks"
    },
    "steps": [
        "Put the flour, salt and sugar into a mixing bowl and stir in the yeast. Mix the oil with 150ml/5fl oz lukewarm water and add to the flour. Mix well until it forms a soft dough, then turn out on the work surface and knead for 10 minutes (or for 4-5 minutes in a mixer with a dough hook).",
        "Sprinkle the work top with the semolina or polenta, or sesame and poppy seeds and roll out the dough as thinly as possible into a rectangle. Cut the dough into 1cm/½in-wide strips. Roll each one between your hands to a pencil shape and place on two lightly oiled baking trays, spaced a little apart. Cover with cling film and leave in a warm place to prove for about 15-20 minutes, or until risen a little. Sprinkle with a little sea salt.",
        "Preheat the oven to 220C/425F/Gas 7 (200C fan). Bake the bread sticks for 10 minutes, or until golden-brown and crisp. They will be soft at this stage. If you prefer drier grissini style-sticks, bake for a further three minutes. Allow to cool completely, then store in a tin for up to three days."
    ],
    "tips": [
        
    ],
    "title": "Seeded breadsticks",
    "videos": "[]"
}