{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "If you want a smart, but easy, make-ahead dessert this is a winner. And it’s just as beautiful when served simply in slices with a hot drink.",
    "dishes": [
        "cake",
        "caramel",
        "jam",
        "oven-baked_dishes",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the caramel sauce": [
            "110g/4oz dark soft brown sugar",
            "110g/4oz butter",
            "½ tsp sea salt",
            "175ml/6fl oz double cream"
        ],
        "For the semolina cake": [
            "300g/10½oz semolina",
            "175g/6oz soft brown sugar",
            "175g/6oz plain flour",
            "40g/1½oz ground almonds",
            "1½ tsp baking powder",
            "1 orange, zest only",
            "75g/2½oz butter, melted and cooled slightly, plus extra for greasing",
            "225ml/8fl oz milk",
            "16 blanched almonds"
        ],
        "To serve": [
            "200g/7oz crème fraîche",
            "4 sprigs fresh mint"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 8 (makes 1 cake)",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the semolina cake, preheat the oven to 180C/160C Fan/Gas 4 and grease a 20cm/8in loose-bottomed square baking tin with butter. (If you don’t have a square baking tin, a 23cm/9in round cake tin will also work.)",
        "Mix the semolina, sugar, flour, ground almonds, baking powder and orange zest together in a bowl until well combined.",
        "Gradually stir in the melted butter and milk until you have a smooth batter.",
        "Pour the batter into the greased tin and arrange the almonds on top in four rows.",
        "Bake for 30-40 minutes, or until the cake is golden-brown on top and a skewer inserted into the middle comes out clean. Cool in the tin for a few minutes before turning out onto a cooling rack to cool completely.",
        "For the caramel sauce, place the sugar, butter and salt in a saucepan and heat until the sugar has melted, then stir in the cream. Bring it to the boil and let it simmer for 3 minutes until thick. Set aside to cool slightly before serving (the sauce can also be served cold).",
        "To serve, serve the cake in slices with the caramel sauce and a dollop of crème fraiche. Garnish with a few mint leaves."
    ],
    "tips": [
        "You can make this cake gluten-free by using gluten-free plain flour and baking powder."
    ],
    "title": "Semolina and orange cake with caramel sauce and crème fraiche",
    "videos": "[]"
}