{
    "author": {
        "richard_phillips": "Richard Phillips"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "biscuit",
        "caramel",
        "icing",
        "oven-baked_dishes",
        "shortbread"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "kneading"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the caramelised oranges": [
            "2 oranges, peeled and sliced into thin rounds",
            "2 tbsp soft brown sugar"
        ],
        "For the shortbread biscuits": [
            "300g/10½oz plain flour, plus extra for dusting",
            "200g/7oz butter",
            "100g/3½oz caster sugar",
            "1 free-range egg yolk"
        ],
        "For the vanilla yoghurt": [
            "100ml/3½fl oz yoghurt",
            "½ lime, juice only",
            "1 vanilla pod, seeds only"
        ],
        "To serve": [
            "icing sugar, for dusting",
            "1 sprig fresh mint, to garnish"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the shortbread biscuits, place the shortbread ingredients together in a food processor and blend until it forms a ball of dough.",
        "Place the dough onto a floured work surface, knead together and then roll out to ½cm/¼in thick. Using a 7cm/3in round cutter, stamp out three rounds. Place on a baking sheet and bake in the oven for 8-10 minutes or until the biscuits are pale golden in colour. Remove and leave to cool on a cooling rack.",
        "For the vanilla yoghurt, mix the yoghurt, lime and vanilla seeds together in a bowl.",
        "For the caramelised oranges, place the orange slices onto a baking sheet and sprinkle over the brown sugar. Carefully caramelise the tops using a blow torch. (Alternatively, you could place the baking sheet with the oranges and sugar under a hot grill until the sugar has melted and caramelised.)",
        "To serve, place a small spoonful of yoghurt on the base of a plate, and place one biscuit on top of the yoghurt. Place another layer of yoghurt on top, then the oranges and shortbread. Repeat and finish with the oranges on top. Dust with icing sugar and garnish with the mint."
    ],
    "tips": [
        
    ],
    "title": "Shortbread biscuits with caramelised oranges and vanilla yoghurt",
    "videos": "[]"
}