{
    "title": "Shredded sprouts with bacon and chestnuts",
    "cookTime": "no cooking required",
    "prepTime": "less than 30 mins",
    "serves": "",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This dish is super quick to finish at the last minute and it's nothing like the water-logged versions that have given sprouts such a bad name. It's still lovely without the breadcrumbs but they do add a pleasing crunch.",
    "author": {
        "deborah_reddihough": "Deborah Reddihough"
    },
    "show": {
        "b0520lz9": "Eat Well for Less?"
    },
    "tips": [
        "It’s really important that fresh sprouts are used because frozen ones are far too mushy."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "2 tbsp olive oil",
            "200g/7oz bacon lardons, or sliced streaky bacon",
            "180g/6oz pack ready-to-eat chestnuts, roughly chopped",
            "500g/1lb 2oz fresh Brussels sprouts, shredded in a food processor",
            "1 lemon, juice only",
            "salt and freshly ground black pepper"
        ],
        "For the breadcrumbs (optional)": [
            "large knob of butter or 2 tbsp olive oil",
            "100g/3½oz fresh breadcrumbs",
            "1 lemon, zest only"
        ]
    },
    "steps": [
        "Heat 1 tbsp of the oil in a frying pan. Fry the bacon until very crisp and the fat has rendered off. Remove from the heat and stir in the chestnuts. Transfer to a bowl or plastic tub, taking care to include as much of the oil from the pan as possible. Cool, then store in the fridge for up to 3 days.",
        "Trim the sprouts to remove any blemished leaves or stalks. Set up a food processor with the shredder attachment and shred the sprouts. Transfer to a food bag, seal and store in the fridge for up to 24 hours.",
        "When ready to cook, add the remaining olive oil to a large frying pan or sauté pan (if you’re pan isn’t big enough, cook the sprouts in 2 batches). Add the bacon, chestnuts and any fat and fry for 1-2 minutes. Tip in the sprouts and fry for 3-5 minutes (depending on how crunchy you like your veg), stirring all the time. Add the lemon juice and season with salt and pepper.",
        "If making the breadcrumbs, fry them in butter or oil with the lemon zest until golden-brown and crisp (about 3 minutes). Stir into the sprouts and serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}