{
    "title": "Sichuan steak",
    "cookTime": "10 to 30 mins",
    "prepTime": "overnight",
    "serves": "Serves 2",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "This recipe is all in the preparation - marinate the meat and make the dressing in advance, then it takes just 10 minutes to fry the steak and chop the salad.",
    "author": {
        "wolfgang_puck": "Wolfgang Puck"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the Sichuan marinade": [
            "4 tbsp Worcestershire sauce",
            "4 tbsp mirin",
            "120ml/4fl oz soy sauce",
            "1 large piece fresh root ginger, smashed",
            "2 tbsp ketchup",
            "37g/1¼oz garlic, peeled and chopped",
            "80ml/2½fl oz honey",
            "38g/1¼oz shallots, peeled and chopped",
            "2 tbsp lemon juice",
            "2 tbsp chili sambal",
            "1 tbsp black pepper",
            "2 x 150-200g/5½-7oz eye end cuts of rib-eye steak"
        ],
        "For the honey mustard vinaigrette": [
            "1 bunch spring onions, white bottoms only",
            "2 tbsp Chinese dry mustard, whipped to a paste with a little water",
            "50g/1¾oz pickled ginger",
            "4 tbsp lime juice",
            "½ tbsp finely chopped garlic",
            "1 tbsp finely chopped shallots",
            "4 tsp honey",
            "80ml/2½fl oz soy sauce",
            "4 tsp ginger vinegar",
            "1¾ tbsp chili oil",
            "1¼ tbsp sesame oil",
            "240ml/8½fl oz peanut oil"
        ],
        "For the Asian cabbage salad": [
            "¼ green cabbage, cut into quarters, cored and shredded",
            "½ radicchio, cut in half, cored and shredded",
            "1 medium carrot, peeled, very thinly sliced and julienned",
            "½ daikon, peeled, very thinly sliced and julienned",
            "½ pack daikon sprouts",
            "1 red peppers, seeds removed, sliced into fine strips",
            "1 yellow pepper, seeds removed, sliced into fine strips",
            "2 Japanese cucumbers, ends cut off, seeds removed, julienned"
        ]
    },
    "steps": [
        "For the Sichuan marinade, place all the ingredients in a non-reactive bowl and add the steak. Marinade for 24 hours in the fridge.",
        "For the honey mustard vinaigrette, in a food processor, blend the spring onions, mustard, pickled ginger, lime juice, garlic, shallots, honey, soy sauce and ginger vinegar to a smooth paste. With the motor running, slowly add the oils in a thin steady stream until emulsified.",
        "For the Asian cabbage salad, combine all the ingredients in a large bowl.",
        "Remove from the fridge and wipe off the marinade. Allow the steak to come up to room temperature. When you are ready to cook the steak, heat a griddle pan until hot. Add the steak and cook for 2-3 minutes on each side. Allow to rest for a few minutes before serving.",
        "To serve, gently toss the salad in the vinaigrette. Slice the steak and serve with the dressed salad."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}