{
    "author": {
        "antonio_carluccio_and_gennaro_contaldo": "Antonio Carluccio and Gennaro Contaldo"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Italian",
    "description": "A pasta and pesto dish from Liguria, home of the best basil in Italy, giving us the famous pesto al Genovese.",
    "dishes": [
        "bun",
        "pasta",
        "pesto",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the pasta": [
            "250g/9oz Italian ‘00’ flour, plus extra for dusting",
            "1 free-range egg",
            "3 free-range eggs, yolks only",
            "2 tbsp olive oil",
            "pinch salt"
        ],
        "For the pesto": [
            "large bunch of small-leaved basil, about 50 leaves",
            "about 10g/¼oz coarse sea salt",
            "40g/1½oz pine kernels",
            "4 garlic cloves, peeled",
            "100ml/3½fl oz olive oil",
            "80g/3oz parmesan or pecorino, freshly grated"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "18",
    "serves": "Serves 4",
    "show": {
        "b01gk0b2": "Two Greedy Italians"
    },
    "steps": [
        "For the pasta, place the flour in a bowl or on a work surface, and make a well in the centre. Add the egg, yolks, half the oil and a pinch of salt. Firstly with a fork and then with your hands, gradually mix the flour with the eggs and oil until you obtain a rough paste. If necessary, add a splash of water. Knead the dough on a lightly floured surface for a few minutes until it is smooth, not sticky. Cover with a cloth and leave to rest for 15–30 minutes.",
        "Divide the dough into quarters. If you have a pasta machine, put the dough through the rollers gradually, starting with the thickest setting, working down to the thinnest, until you have silky sheets about 1mm thick, or less. Cut the sheets of pasta into large squares, about 15x15cm/6x6in, and dust with flour to prevent them sticking together.",
        "For the pesto, put the basil leaves in a large mortar with the salt, pine kernels and garlic. Grind down with the pestle until it becomes a fine pulp. Start to add the oil and continue grinding until the mixture is smooth. Add the parmesan and mix well.",
        "To cook the pasta, put the pasta sheets one by one into a saucepan with plenty of lightly salted boiling water, and add the remaining oil. Cook until al dente, about three minutes or so.",
        "Put about 3-4 tablespoons of pesto in a large pan and warm up gently with 3-4 tablespoons of cooking water from the pasta pan.",
        "Remove the pasta sheets from the water using a perforated scoop, and put them into the sauce. Add the rest of the sauce, mix well, and serve with a few extra basil leaves to garnish."
    ],
    "tips": [
        
    ],
    "title": "Silk handkerchief pasta with pesto",
    "videos": "[]"
}