{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "",
    "dishes": [
        "jelly",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "100g/3½oz caster sugar",
            "150g/5oz fresh blackberries, rinsed",
            "5 sheets leaf gelatine",
            "500ml/17fl oz dry sparkling cider"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b019g1qg": "Hairy Bikers' Best of British"
    },
    "steps": [
        "Place four tumblers into the freezer for 30 minutes.",
        "Meanwhile put the sugar and 100ml/3½fl oz cold water in a saucepan and cook over a low heat until dissolved, stirring regularly. Bring to the boil for 30 seconds. Remove from the heat and stir in the blackberries. Set aside for 15 minutes.",
        "Remove the blackberries from the pan with a fork and put on a plate. Set aside. Place the gelatine in a bowl and cover with cold water. Leave to stand for five minutes until very soft. Squeeze the gelatine over the bowl to remove the excess water and place it into the pan with the sugar syrup. Stir with a wooden spoon until dissolved.",
        "Slowly pour the cider down the side of the pan (this will help retain the bubbles) into the gelatine mixture. Stir lightly then carefully pour the mixture into the glasses, reserving around 125ml/4½fl oz of liquid in the pan. Chill the jellies in freezer for one hour.",
        "Remove the jellies from the freezer and stir with a fork in a folding motion to trap small air bubbles in the jelly. Place the blackberries on top of the jelly.",
        "Warm the reserved jelly very gently until it becomes runny but not too hot and pour over the blackberries. It will settle on the top of the bubbly jelly to make a smooth finish to the desserts. Chill in the fridge for 3-4 hours, or until set. If leaving for longer, cover the glasses with clingfilm."
    ],
    "tips": [
        
    ],
    "title": "Simple cider jelly with blackberries",
    "videos": "[]"
}