{
    "title": "Simple tortilla pizzas",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 4 19cm/8in pizzas",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "These tasty tortilla pizza bites are just the trick for an easy cheat’s pizza. Each pizza provides 371 kcal, 18.5g protein, 42g carbohydrate (of which 8g sugars), 14g fat (of which 7.5g saturates), 4g fibre and 1.4g salt.",
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "show": {
        "b04hcm51": "Lorraine Pascale: How to be a Better Cook"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "spray oil",
            "4 wholewheat, plain flour or corn tortillas (about 19cm/7½in diameter)",
            "1 small garlic clove, halved",
            "400g tin chopped tomatoes (preferably with herbs)",
            "¼-½ tsp chilli flakes (optional)",
            "125g/4½oz pecorino cheese (or a mature cheddar), coarsely grated",
            "280g jar roasted red and yellow peppers, drained (about 175g/6oz of actual peppers)",
            "70g/2½oz rocket",
            "small handful fresh basil leaves (optional)",
            "2-3 tsp balsamic vinegar (optional)",
            "2-3 tsp extra virgin olive oil (optional)",
            "flaked sea salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Turn the oven ideally as high as it will go, making sure two shelves are in place - about 240C/220C Fan/Gas 8. Spray a bit of oil on two large baking trays and put two tortillas on each. Spray a little more on top of the tortillas and then rub the cut side of the garlic all over the tortillas - this gives the pizza extra flavour.",
        "Divide the chopped tomatoes evenly between the 4 tortillas, spreading them out but leaving a 1.5cm/¾in border. Scatter over the chilli flakes, if using, and divide the cheese and peppers evenly over the top.",
        "Pop both trays into the oven to bake for about 4-6 minutes (depending on how hot your oven is), or until the cheese has melted and the tortillas are crisp and golden-brown on their edges. Swap the trays around on the shelves half way through for even cooking.",
        "Remove the tortillas from the oven and slide onto serving plates. Top with the rocket and basil (if using). Season with a little scattering of salt and pepper, then drizzle with balsamic vinegar and some extra virgin olive oil, if you fancy it."
    ],
    "howTos": [
        
    ],
    "videos": "[p026wqc8:p026wqcb]"
}