{
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Japanese",
    "description": "Serve the family something different for dinner: a rich miso and mushroom broth with golden tofu and soft-boiled eggs. This meal provides 550 kcal, 33g protein, 45g carbohydrate (of which 4.5g sugars), 27g fat (of which 5.7g saturates), 6g fibre and 4g salt per portion.",
    "dishes": [
        "broth",
        "noodle_soup",
        "pie",
        "sauce",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "how_to_boil_eggs"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/simple_miso_tofu_and_03158_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "15g/½oz dried wild mushrooms, such as porcini",
            "1.4 litres/2½ pints just-boiled water",
            "2 tbsp dark soy sauce, plus extra to serve",
            "1 vegetable stock cube",
            "4 tbsp brown miso paste",
            "200g/7oz medium dried egg noodles",
            "396g pack firm tofu, drained, dried, cut into 8 rectangular slices",
            "2-3 tsp sunflower oil",
            "4 large free-range eggs",
            "150g/5oz chestnut mushrooms, thinly sliced",
            "2 pak choi, roots trimmed, leaves separated and washed",
            "100g/3½oz fresh beansprouts, rinsed and drained",
            "6 spring onions, trimmed, very thinly sliced",
            "50g/2oz roasted cashew nuts, roughly chopped",
            "dried flaked chillies, to serve (optional)"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Put the dried mushrooms in a large, heavy-based saucepan and cover with the water. Add the soy sauce, stock cube and miso paste and stir until the stock cube has dissolved. Set aside for 30 minutes to rehydrate and infuse.",
        "Meanwhile, half-fill a saucepan with water and bring to the boil. Add the noodles and cook for 3-4 minutes, or until just tender, stirring occasionally to break up the strands. Drain well, then rinse under running water until cold.",
        "Half-fill the same pan with water and bring to the boil. Add the eggs to the boiling water and cook for 5 minutes.",
        "Heat 2 teaspoons of the oil in a large, non-stick frying pan over a medium heat. Add the tofu pieces and fry carefully for 3-4 minutes on each side, or until pale golden-brown on both sides. Turn off the heat but keep the pan on the hob so that the tofu stays warm.",
        "Stir the noodles into the mushroom broth and bring to the boil. Reduce the heat until the mixture is simmering, add the chestnut mushrooms and pak choi and continue to simmer for a further 2-3 minutes. Stir in the beansprouts and spring onions, remove from the heat.",
        "Drain the eggs then rinse under cold water. Crack and peel off the shells, cut in half.",
        "Divide the broth, noodles and vegetables between 4 serving bowls. Top with the tofu and eggs. Sprinkle over the cashew nuts and chilli flakes. Season with extra soy sauce."
    ],
    "tips": [
        "Tip 1: Frying the tofu gives it a firmer texture and added flavour, but you can gently warm the tofu in the simmering stock if you prefer. This recipe also works well with marinated tofu. Tip 2: If any of your dried mushrooms are on the large side, finely slice them after soaking."
    ],
    "title": "Simple miso, tofu and mushroom ramen",
    "videos": "[]"
}