{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Thai_and_South-East_Asian",
    "description": "",
    "dishes": [
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "75ml/2¾fl oz hoi sin sauce",
            "1 red chilli, finely chopped",
            "1 tbsp black rice vinegar (available from some Asian supermarkets)",
            "1 tbsp light soy sauce",
            "1 tbsp crushed garlic",
            "250g/9oz boneless pork chop, trimmed, sliced into strips",
            "150g/5½ oz baby shrimp, shells removed, de-veined",
            "3-4 tbsp vegetable oil",
            "8 spring onions, trimmed, sliced",
            "100g/3½oz fresh beansprouts",
            "200g/7oz pak choi, leaves separated",
            "250g/9oz fresh fine egg noodles, cooked according to packet instructions",
            "1 free-range egg, beaten"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "In a bowl, mix together the hoi sin sauce, chopped chilli, rice vinegar, soy sauce and crushed garlic until well combined. Add the pork strips and baby shrimp and mix until completely covered in the marinade mixture. Set aside to marinate for at least 30 minutes.",
        "When the pork and shrimp have marinated, heat two tablespoons of the oil in a wok over a high heat. When the oil is smoking, add the marinated pork and shrimp, in batches, and stir fry for 3-4 minutes, or until cooked through. Remove from the wok using a slotted spoon and set aside.",
        "Add the remaining oil to the wok and heat until smoking. Add the spring onions, beansprouts, pak choi and cooked noodles and stir fry for 1-2 minutes, or until the pak choi leaves have wilted and the noodles have warmed through.",
        "Return the cooked prawn and pork to the wok, then crack in the egg and stir fry until cooked.",
        "To serve, divide the Singapore-style noodles equally among four serving plates."
    ],
    "tips": [
        
    ],
    "title": "Singapore-style noodles",
    "videos": "[]"
}