{
    "author": {
        "john_torode": "John Torode"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Thai_and_South-East_Asian",
    "description": "You'll need to take a trip to an oriental supermarket to find all the ingredients for this seafood stir-fry.",
    "dishes": [
        "pie",
        "prepare-ahead_desserts",
        "sauce",
        "seafood",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the black bean chilli paste": [
            "20g/¾oz dried red chillies, half deseeded and half left whole, soaked in boiling water and drained",
            "50g/1¾oz salted black beans, soaked and drained",
            "3 garlic cloves, peeled",
            "100ml/3½oz vegetable oil, warmed"
        ],
        "For the garnish": [
            "½ handful Chinese chives",
            "½ handful Chinese coriander (also known as sawtooth or long-leaf coriander)",
            "½ handful Thai basil",
            "½ handful King (purple) basil",
            "½ handful coriander"
        ],
        "For the pepper and chilli paste": [
            "1 large piece root ginger, peeled and shredded",
            "8 garlic cloves, peeled",
            "6 coriander roots",
            "2 fresh turmeric roots",
            "2 sprigs fresh green peppercorns, berries picked",
            "3 tbsp caster sugar",
            "1 large dried bird’s-eye chilli"
        ],
        "default": [
            "1 x 1.4kg/3lb 3oz cooked brown crab",
            "2 tbsp vegetable oil, for frying",
            "3cm/1¼in piece root ginger, peeled and cut into matchsticks",
            "1 tbsp caster sugar",
            "1 tsp fish sauce",
            "1 tsp vinegar"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006t1k5": "MasterChef"
    },
    "steps": [
        "Separate the crab head from the body. Discard the dead man’s fingers. Cut the body into four pieces. Cut off the claws and split them without removing the meat. Cut the head into two, reserving any juice from the crab.",
        "For the chilli and black bean paste, blend all the ingredients together in a food processor to form a paste.",
        "For the pepper and chilli paste, place the ginger, garlic, coriander roots, fresh turmeric, green peppercorns, caster sugar and dried chilli in a pestle and mortar. Pound to form a paste.",
        "To prepare the garnish, separate the greens from the whites of the Chinese chives and coriander. Keep separate and chop.",
        "Heat a wok until hot, add a glug of vegetable oil. Briefly fry the black bean chilli paste followed by the pepper and chilli paste. Cook the ginger with the whites of the Chinese chives. Add the crab pieces and toss in the sauce. Add the whites of the coriander and the sugar, fish sauce and vinegar. Add any reserved crab juices and the greens from Chinese chives and Chinese coriander. Garnish with the remaining herbs."
    ],
    "tips": [
        
    ],
    "title": "Singapore chilli crab",
    "videos": "[]"
}