{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "10 to 30 mins",
    "description": "Cupcakes are all the rage but they can make you fat. Don’t miss out on all the fun, give these low-cal versions a whirl. Just eat one mind, not the whole batch. 167 calories per cupcake",
    "dishes": [
        "cake",
        "cupcakes",
        "icing",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/skinny_lemon_cupcakes_15650_16x9.jpg"
    ],
    "ingredients": {
        "For the lemon icing": [
            "100g/3½oz icing sugar",
            "4 tsp fresh lemon juice"
        ],
        "default": [
            "200g/7oz self-raising flour",
            "1 tsp bicarbonate of soda",
            "75g/3oz golden caster sugar",
            "100g/3½oz blueberries",
            "1 unwaxed lemon, zest finely grated",
            "2 free-range eggs",
            "150ml/¼ pint low-fat natural yoghurt",
            "2 tbsp semi-skimmed milk",
            "50ml/2fl oz sunflower oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "50",
    "serves": "Makes 12",
    "show": {
        "p00vq8c6": "Hairy Dieters: How to Love Food and Lose Weight"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Line a 12-hole deep muffin tin with some non-stick paper cases or folded squares of baking parchment.",
        "Sift the flour and bicarbonate of soda into a large bowl and stir in the sugar, blueberries and lemon zest. Make a well in the centre. Beat the eggs with a large whisk until smooth, then beat in the yoghurt, milk and oil until well combined. Stir into the flour mixture with a large metal spoon until very lightly mixed.",
        "Working quickly, divide the batter between the paper cases. Bake in the centre of the oven for 16–18 minutes or until the cupcakes are well risen and golden brown. Transfer them to a wire rack and leave to cool.",
        "To make the lemon icing, mix the icing sugar and lemon juice in a small bowl until smooth and runny. Using a spoon, drizzle the icing over the cupcakes and leave to set for at least 30 minutes before serving."
    ],
    "tips": [
        "Tip: You can make these skinny cupcakes with plain dark chocolate instead of blueberries if you like. Use 100g/3½ oz roughly chopped dark chocolate or drops or buttons and you will add about 43 calories to each cupcake. You can also flavour the cakes with ½ tsp vanilla extract instead of lemon zest and use water instead of lemon juice to make the icing."
    ],
    "title": "Skinny lemon cupcakes with drizzly icing",
    "videos": "[]"
}