{
    "title": "Slow cooker chilli con carne",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "47",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/slow_cooker_chilli_con_13029_16x9.jpg"
    ],
    "description": "Chocolate added at the end gives a richness to this slow-cooked chilli. You can store any leftovers in the freezer for 2 months. Try it with soured cream, fluffy rice and a scoop of guacamole.",
    "author": {
        "jane_hornby": "Jane Hornby"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1 onion, sliced",
            "1 red pepper, deseeded and thickly sliced",
            "small bunch fresh coriander, stalks finely chopped",
            "1 tbsp sunflower oil",
            "500g/1lb 2oz beef brisket, trimmed of excess fat and cut into matchbox-size pieces",
            "salt and freshly ground black pepper",
            "2 fat garlic cloves, crushed",
            "1 tsp ground cumin",
            "1 tsp ground coriander",
            "2 tsp hot chilli powder",
            "1 tsp dried oregano",
            "2 tbsp tomato purée",
            "400g/14oz can chopped tomatoes",
            "300ml/½ pint hot beef stock",
            "2 x 400g/14oz can red kidney beans in water, rinsed and drained",
            "1 cube good quality dark chocolate, minimum 70% cocoa solids"
        ]
    },
    "steps": [
        "Place the onion, red pepper and coriander stalks into a slow cooker. Heat the oil in a large non-stick frying pan, season the beef with salt and freshly ground black pepper, then fry in two batches until golden-brown, transferring to the slow cooker when ready.",
        "Add the garlic, spices and oregano to the pan juices and fry for one minute until fragrant. Stir in the tomato purée, tomatoes and stock then bring to a boil. Pour the hot sauce over the meat, then cover with a lid and cook on low for seven hours. Stir in the beans, then cook for an hour more until the meat is very tender.",
        "Pop the chocolate into the sauce, let it melt, then stir it in. Season the sauce to your taste, then scatter with the coriander leaves and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}