{
    "title": "Slow-roasted fennel seed and chilli-crusted pork with Hispi cabbage and crème fraîche mash",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the pork": [
            "3.5kg/7lb 11oz boneless shoulder of pork",
            "2 tbsp fennel seeds",
            "2 tbsp rough sea salt",
            "2 red chillies, roughly chopped",
            "2 lemons, zest only",
            "150ml/5fl oz water"
        ],
        "For the chive and crème fraîche mash": [
            "1kg/2lb 3oz King Edward potatoes, peeled and cut into chunks",
            "2 cloves garlic, peeled",
            "4-5 tbsp extra virgin olive oil",
            "50-75g/2-3oz crème fraîche",
            "5 tbsp finely chopped fresh chives",
            "salt and freshly ground black pepper"
        ],
        "For the cabbage": [
            "50g/2oz butter",
            "1 head Hispi cabbage, finely sliced",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 150C/300F/Gas 2.",
        "For the pork, score the skin of the pork shoulder all over in a diamond pattern with the tip of a sharp knife. Place the pork onto a rack set over the sink, or over a deep tray, then pour a kettle of boiling water over the pork. Pat the pork dry with kitchen paper.",
        "Place the fennel seeds, rough sea salt, chopped chillies and lemon zest into a pestle and mortar or small food processor and pound or blend to a rough paste. Rub the mixture all over the pork, including in the cavity where the shoulder blade would have been, and the flesh underneath.",
        "Place the pork in a deep roasting tray with the water and cook in the oven for four hours, or until golden-brown all over and very tender. Turn the oven onto the grill function and grill for 2-3 minutes, or until the skin becomes crisp. Remove from the oven and rest for ten minutes before serving.",
        "For the mash, place the potatoes and garlic cloves into a pan of salted water and bring to the boil. Reduce the heat and simmer for 15 minutes, or until the potatoes are tender.",
        "Drain the potatoes and garlic, then return them to the pan and place back over a high heat to drive off any excess moisture. Pass the potatoes and garlic through a potato ricer, or mash well, then beat in the olive oil, crème fraîche and stir in the chives. Season, to taste, with salt and freshly ground black pepper.",
        "For the cabbage, melt the butter in a frying pan until foaming, then add the cabbage and fry for 2-3 minutes, or until tender. Season, to taste, with salt and freshly ground black pepper.",
        "To serve, remove the crackling from the pork shoulder and roughly break into pieces. Carve the pork into thick slices. Spoon the mash onto serving plates, then place a portion of the cabbage alongside. Arrange the slices of pork next to the cabbage and place the crackling on top."
    ],
    "howTos": [
        "carving_pork",
        "scoring_skin",
        "zesting_citrus_fruit"
    ],
    "videos": "[]"
}