{
    "title": "Slow roast leg of lamb with chardonnay, rosemary, sage and bay",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "101",
    "images": [
        
    ],
    "description": "Now, this is a slow cook but very fast prep dish. I made this at home one Sunday and literally just lobbed all the ingredients in the pan and left it to cook for ages. I was not expecting anything amazing, just a bit of lamb for dinner. But when I tasted it, still on the kitchen counter, I almost ate the whole darn lot myself and did that little dance people do when something tastes really good.",
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "show": {
        "b01m28pp": "Lorraine's Fast, Fresh and Easy Food"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "½ leg of lamb (the thick fillet end) with bone in (about 1Kg/2lb 4oz)",
            "salt and pepper",
            "2 red onions",
            "8 garlic cloves",
            "4 rosemary sprigs",
            "4 sage leaves",
            "2 bay leaves",
            "400ml/14fl oz white wine",
            "couple squidges of honey",
            "1kg/2lb 4oz potatoes, peeled and cut for roasties",
            "olive oil, for drizzling",
            "300g/11oz frozen peas"
        ]
    },
    "steps": [
        "Remove the lamb from the fridge 30 minutes before cooking (to bring it to room temperature). Preheat the oven to 150C/300F/Gas 2 and make sure the shelves are set to fit a casserole pot and roasting tray in.",
        "Place the lamb in a big casserole pot and season it really well with salt and pepper. Cut the onions into quarters, keeping the root intact, peel off the skin and throw them in with the (unpeeled) garlic cloves, rosemary sprigs, sage and bay leaves. Pour in the white wine and drizzle the honey over.",
        "Put the lid on and place the whole thing in the oven, leaving it for about four hours. Set a timer for 2 hours 30 minutes as that’s when you need to add the potatoes.",
        "When the timer goes, toss the potatoes in a roasting tin with a good drizzle of oil and leave them to sit. (They won’t go brown with the oil on.)",
        "Season the potatoes with salt and pepper, drizzle a bit more oil on them if they have sucked it all up and place them in the oven for the remaining hour and a half. Give them a toss about every so often.",
        "Finally, 10 minutes before the meat is ready, throw the peas into the lamb cooking juices.",
        "Once everything is cooked remove them from the oven. The meat should be falling off the bone and the potatoes crisp and golden brown. There is no need to rest the meat after this long cooking time, so simply dish up and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[p00xz74j:]"
}