{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "over 2 hours",
    "description": "Instead of being boiled and then transferred to a hot oven to be glazed, I cook the ham so, so slowly, in the oven, wrapped in foil, so that it steams sweetly in the low heat. I then remove the ham from the oven, take off the rind, stud the layer of fat on top with cloves and cover with a mustardy black treacle glaze, and put the joint briefly back in a very hot oven. Cooked like this, the meat is astonishingly tender and carves into thin slices with ease; there is also very little shrinkage, and no wrangling with large joints of meat in boiling liquid.",
    "dishes": [
        "ham",
        "oven-baked_dishes",
        "pie",
        "sandwich",
        "slow-cooked_dishes"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the glaze": [
            "approx. 1 tbsp whole cloves",
            "4 tbsp black treacle",
            "4 tbsp demerara sugar",
            "1 x tbsp Dijon mustard"
        ],
        "default": [
            "3.5kg/7lb 10oz joint boneless gammon, rind on",
            "150g/5½oz black treacle"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "",
    "serves": "Serves 10-12",
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "steps": [
        "Preheat the oven to 250C/230C Fan/Gas 9. Let your gammon come to room temperature.",
        "Line a large roasting tin with a layer of foil, and then sit a wire rack on top of this foil. Tear off a large piece of foil (big enough to wrap around the ham) and place this over the rack on the roasting tin. Tear off a second, large piece of foil and place on top, but in the opposite way to the first, so you have 4 corners of foil ready to wrap your ham in.",
        "Sit the gammon on the foil and then pour the black treacle over it, straight onto the rind, letting it run down both sides. Don’t worry too much about spreading it over the ham, as once it’s in the heat of the oven, it will coat the ham well enough.",
        "Now lift up the sides and ends of the first layer of foil and make a seal at the top, leaving some room around the gammon, then seal the ends. Then take up the other piece of foil and do the same: you are trying to create a good seal around the gammon, so pinch together any open gaps that remain. Finally, tear off another piece of foil and put over the top of the whole parcel, making sure it’s well sealed.",
        "Put carefully into the oven and let it cook for 30 minutes, then turn the oven down to 100C/80C Fan/Gas ¼ and leave for a further 12–24 hours.",
        "The following day, take the gammon out of the oven and open up the foil seal. It will have made some liquid, which you can reserve to moisten the carved meat later. Carefully lift the gammon out onto a board, remove the string and peel off the rind to leave a good layer of fat.",
        "Increase the oven temperature to 200C/180C Fan/Gas 6. Using a sharp knife, cut a diamond pattern in the fat layer, drawing lines one way and then the opposite way, about 2cm/¾in apart.",
        "Stud the centre of each diamond with a clove, then mix together the black treacle, demerara sugar and Dijon mustard in a bowl and spread over the fat on the ham. It will dribble off a bit, so just spoon it back over the gammon before putting back in the oven for 20 minutes, by which time the glaze will be burnished and blistered in the heat. Remove from the oven, and transfer to a board. Let it rest for 10–20 minutes before carving into thin slices."
    ],
    "tips": [
        "I always like a ham on Christmas Eve, which means that there is cold ham as well as cold turkey for Boxing Day (and general sandwich duty), and this is the way to cook it to make your life easier. And if the 12–24 hours’ cooking doesn’t suit you, you can cook it for 5 hours in a 180C/160C Fan/ Gas 4 oven instead, before proceeding with the glaze. The juices that collect from the first step of cooking are gorgeously flavoured, but very intense. I pour a little of them over the cut slices of meat, but go sparingly. You will notice that I don’t soak the gammon joint first: this is because I no longer find that the gammon I buy is salty enough to require soaking, but obviously you can, if you or your butcher feel it necessary. Whether you choose a smoked or “green” gammon is entirely a matter of your own taste. When you measure out your treacle, it’ll make life a lot easier if you oil your receptacle first. Cool leftovers as quickly as possible, then cover (or wrap tightly in foil) and refrigerate within 2 hours of making. Will keep in fridge for up to 3 days. Freeze in an airtight container (or wrapped in foil, and then put in a resealable bag) for up to 2 months. Defrost overnight in fridge before using."
    ],
    "title": "Slow-cooked black treacle ham",
    "videos": "[p03c17zb:p03c17zd]"
}