{
    "author": {
        "miss_south": "Miss South"
    },
    "cookTime": "over 2 hours",
    "cusine": "American",
    "description": "To get perfectly fudgy, squishy brownies with minimal effort, pop the cake mixture into a slow-cooker - here's how. Equipment and preparation: for this recipe you will need a slow cooker.",
    "dishes": [
        "cake",
        "chocolate_brownies",
        "sauce",
        "slow-cooked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "90g/3¼oz good-quality plain chocolate",
            "115g/4oz butter, cubed",
            "275g/9¾oz caster sugar",
            "2 free-range eggs",
            "1 tsp vanilla extract",
            "90g/3¼oz plain flour",
            "75g/2¾ full-fat cream cheese",
            "1 heaped tbsp condensed milk or dulce de leche"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Makes 20-24",
    "show": {
        "b03mzc66": "Food & Drink"
    },
    "steps": [
        "Line the base of a slow cooker with baking parchment.",
        "Suspend a heatproof bowl over a pan of simmering water, making sure the base of the bowl does not touch the water. Add the chocolate and butter and stir until smooth and melted.",
        "Remove the bowl from the heat, then beat in the sugar until well combined (it will look slightly lumpy, but don’t worry).",
        "Beat in each egg, one at a time, until well combined, then stir in the vanilla extract and fold in the flour. Pour the brownie mixture into the slow cooker.",
        "In the same bowl, mix the cream cheese with the condensed milk (it might look almost curdled, but again, don’t worry). Drop teaspoonfuls of the cream cheese mixture on top of the brownie mixture, one at a time, swirling each through the mixture using a skewer to create a marbled effect. (Don’t mix in the cream cheese completely.)",
        "Put the lid onto the slow cooker and cook the brownies on a high heat for 2-2½ hours, testing them after 2 hours by inserting a skewer into the centre - if the skewer comes out clean, and the top of the brownies look cooked (see tip), the brownies are ready.",
        "Lift the brownies out of the slow cooker using the paper lining to help you and transfer to a wire rack to cool. Do not try to peel the greaseproof paper from the brownies until they have completely cooled.",
        "To serve, cut the brownies into 20-24 small squares. The brownies should be sticky and fudgy inside with crisp, chewy edges."
    ],
    "tips": [
        "Tip 1: Melt the chocolate in a heatproof bowl that fits over a saucepan of simmering water; that way, you will only have one bowl to wash up. Tip 2: Make sure the top of the brownies look cooked before you lift them out of the slow cooker - even if this means cooking them for an extra 20-30 minutes more than you think."
    ],
    "title": "Slow-cooker cream cheese brownies",
    "videos": "[]"
}