{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "no cooking required",
    "cusine": "British",
    "description": "This 1970's classic was a dinner-party favourite for a reason - it looks mighty impressive and tastes amazing. For this recipe you will need a piping bag fitted with a large plain nozzle.",
    "dishes": [
        "jam",
        "mousse"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1 tsp rapeseed oil, for greasing",
            "1 large cucumber, peeled and very finely sliced",
            "400g/14oz smoked salmon fillet (unsliced), chopped",
            "1 lemon, juice only, plus extra lemon wedges to serve",
            "200g/7oz full-fat cream cheese",
            "450ml/16fl oz double cream",
            "300g/10½oz cooked tiger prawns, shells removed, de-veined, plus 6 extra tiger prawns, shells left on",
            "50g/1¾oz watercress leaves",
            "Melba toast, cut into quarters, to serve",
            "sea salt and freshly ground black pepper"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "5",
    "serves": "Serves 6",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Grease a 22cm/9in savarin mould with a little rapeseed oil, then line it with cling film, making sure the cling firm overlaps the edges of the mould all the way around.",
        "Arrange three-quarters of the cucumber slices in overlapping layers to cover all of the inside of the mould (the effect should resemble fish scales). Set aside.",
        "Blend the chopped smoked salmon with the lemon juice in a food processor until smooth. Add the cream cheese and blend once more to combine.",
        "With the motor still running, gradually pour in the double cream until the mixture thickens to a mousse, scraping the sides of the food processor with a spatula halfway through blending. Season, to taste, with salt and freshly ground black pepper, and more lemon juice if desired.",
        "Carefully spoon the mousse into a piping bag, then pipe half of it into the bottom of the cucumber-lined mould. Arrange a layer of prawns all over the surface of the mousse, then pipe over the remaining mousse and smooth the top using a palette knife. Arrange the remaining cucumber slices on top, then cover with cling film and chill in the fridge for at least 30 minutes, or until ready to serve.",
        "To serve, peel away the cling film, then invert the savarin mould onto a serving plate. Gently lift away the mould and peel off the cling film that was lining the mould. Pile the watercress into the centre of the ring of mousse and top the watercress with the extra tiger prawns. Serve the mousse in slices with lemon wedges and Melba toast."
    ],
    "tips": [
        "If you don’t want to make your own Melba toast, you can buy it from supermarkets and delicatessens."
    ],
    "title": "Smoked salmon, prawn and cucumber mousse",
    "videos": "[p02gg1s5:p02gg1sc]"
}