{
    "author": {
        "kevin_dundon": "Kevin Dundon"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bun",
        "chips",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the creamed corn": [
            "2 tbsp olive oil",
            "1 shallot, finely chopped",
            "110g/4oz tinned sweetcorn, drained",
            "50ml/2fl oz white wine",
            "50ml/2fl oz double cream",
            "salt and freshly ground black pepper"
        ],
        "For the salad": [
            "2 lemons, segmented",
            "1 small bunch celery leaves",
            "1 small bunch flatleaf parsley, leaves only",
            "50ml/1¾fl oz olive oil",
            "salt and freshly ground black pepper"
        ],
        "For the smoked cockles": [
            "200g/7oz oak wood chips",
            "40g/1½oz raspberries",
            "500g/1lb 2oz cockle meat (or 1kg/2lb 2oz whole cockles, cooked)",
            "50g/2oz semolina flour",
            "2tbsp olive oil"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Place a wok on a high heat and add the oak wood chips. Once the wood starts to smoke, add the raspberries. String the cockles together with a needle and thread. Suspend the string over the wood chips and cover with a lid. Leave to smoke for about 5-6 minutes. (CAUTION: Food-smoking generates a great deal of smoke. Cook in a well-ventilated place and open the windows.)",
        "Remove the cockles and de-string.",
        "Toss the cockles in the semolina flour. Heat a high sided frying pan until hot then add enough olive oil to cover the bottom of the pan, 2cm/½in deep. Add the cockles and shallow fry for one minute. Remove and drain onto kitchen paper.",
        "Meanwhile, for the creamed corn, heat a frying pan until warm then add the olive oil.",
        "Add the shallots and sweat for one minute until soft but not coloured. Add the sweetcorn and white wine, and cook until the wine is reduced by half.",
        "Add the double cream and again reduce by half. Season to taste and remove from the heat.",
        "Place the lemon segments, celery leaves, parsley and olive oil in a bowl and mix together. Season to taste.",
        "To serve - place a spoon of the creamed corn in the middle of the plate, place the salad on top and top with the smoked cockles."
    ],
    "tips": [
        
    ],
    "title": "Smoked cockles on a bed of creamed corn and lemon salad",
    "videos": "[]"
}