{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "jam",
        "oven-baked_dishes",
        "pastry",
        "pesto",
        "pie",
        "salad",
        "tarts"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the salad": [
            "150g/5oz watercress",
            "2 tbsp walnut oil",
            "2 tsp red wine vinegar",
            "salt and freshly ground black pepper"
        ],
        "For the tart": [
            "500g/1lb 2oz ready-made puff pastry",
            "500g/1lb 2oz baby leaf spinach, washed and well drained",
            "salt and freshly ground black pepper",
            "pinch freshly grated nutmeg",
            "250g/9oz crème fraîche",
            "1 free-range egg",
            "325g/11½oz smoked salmon, sliced"
        ],
        "For the watercress pesto": [
            "110g/4oz watercress",
            "20g/¾oz walnuts, shells removed",
            "75ml/3fl oz extra virgin olive oil",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the tart, roll the pastry out to 5mm/¼in thick. Cut out four 15cm/6in circles. Place onto a baking tray and pierce several times with a fork to prevent the pastry from rising too much.",
        "Transfer to the oven and bake for ten minutes, or until golden-brown and risen.",
        "Meanwhile, place the spinach into a pan and cook gently until wilted. Season, to taste, with salt and freshly ground black pepper and a pinch of nutmeg. Remove from the pan and squeeze out any excess water.",
        "In a bowl, whisk the crème fraîche and egg together and season with salt and freshly ground black pepper.",
        "Divide the spinach among the pastry circles and spoon over some of the crème fraîche mixture. Top with the smoked salmon slices.",
        "Return to the oven for five minutes, until warmed through.",
        "Meanwhile, for the pesto, place the watercress and walnuts into a food processor and blend. Gradually add the olive oil until a thick paste forms. Season, to taste, with salt and freshly ground black pepper.",
        "For the salad, place the watercress into a bowl, drizzle over the walnut oil and vinegar and season, to taste, with salt and freshly ground black pepper.",
        "To serve, place the tarts onto serving plates with the watercress salad and drizzle over the pesto."
    ],
    "tips": [
        
    ],
    "title": "Smoked salmon and spinach tart with watercress pesto and salad",
    "videos": "[]"
}