{
    "title": "Smoked eel cakes with herb, mustard and horseradish mayonnaise",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Swap fish cakes for smoked eel cakes - a taste of something a little off the beaten track.",
    "author": {
        "brian_turner": "Brian Turner"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the smoked eel cakes": [
            "sunflower oil, for deep-frying",
            "100g/3½oz smoked eel fillet, finely chopped",
            "1 tsp freshly grated horseradish",
            "250g/9oz cold mashed potato",
            "1 tsp chopped parsley",
            "1 free-range egg, plus 1 egg yolk",
            "25g/1oz plain flour",
            "100g/3½oz panko breadcrumbs",
            "salt and freshly ground black pepper"
        ],
        "For the mustard and horseradish mayonnaise": [
            "6 tbsp mayonnaise",
            "2 tbsp crème fraiche",
            "1 lemon, finely grated zest and juice",
            "2 tsp freshly grated horseradish",
            "1 tsp grain mustard",
            "2 tbsp chopped dill"
        ],
        "To serve": [
            "pea shoots"
        ]
    },
    "steps": [
        "For the smoked eel cakes, preheat a deep-fat fryer to 180C. Alternatively, heat the oil in a deep-sided, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)",
        "Place the smoked eel in a large bowl and add the horseradish, cold mashed potato and parsley. Season with salt and pepper and mould into even golfball-sized balls.",
        "Whisk together the egg yolk, egg and a splash of water in a separate bowl.",
        "Dip the eel balls into flour, shake off excess and then dip into the egg mixture to coat it. Shake off excess and dip into panko breadcrumbs and cover completely, shaking off the excess. Flatten them into fish cake shapes.",
        "Carefully place the fish cakes into the deep-fat fryer and fry for 3-4 minutes, until golden-brown and cooked through.",
        "Removed with a slotted spoon and leave to drain on kitchen paper, and keep warm.",
        "Meanwhile mix the mayonnaise and crème fraiche together. Add the lemon zest and juice with the horseradish, mustard and dill. Mix well and season with salt and pepper.",
        "To serve, place the ell cakes onto a serving plate and spoon the mayonnaise into a dipping bowl. Garnish with pea shoots and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}