{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "A quick and easy twist on duck a l'orange, with home-smoked duck breasts in a rich, orange-flavoured sauce.",
    "dishes": [
        "caramel",
        "jam",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        "julienne"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the bigarade sauce": [
            "2 oranges, 1 segmented",
            "2 tbsp caster sugar",
            "2 tbsp sherry vinegar",
            "200ml/7fl oz dark chicken stock",
            "50g/1¾oz butter"
        ],
        "default": [
            "150g/5½oz demerara sugar",
            "200g/7oz rice",
            "75g/2½oz Earl Grey tea leaves",
            "3 duck breasts",
            "salt and pepper",
            "50g/1¾oz butter",
            "300g/10½oz new potatoes, boiled until cooked, drained"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 2-3",
    "show": {
        "b03bhng2": "James Martin's Food Map of Britain"
    },
    "steps": [
        "Mix the demerara sugar, rice and tea together.",
        "Cover the bottom of a large frying pan with aluminium foil and spread the tea mixture over. Cover with more foil and lay the duck breasts on top. Season with salt and pepper, cover the pan with foil (or a tight fitting lid) and cook for 10 minutes.",
        "Meanwhile to make the bigarade sauce, squeeze the juice from the whole orange and julienne the zest.",
        "In a large pan, melt the sugar until a golden-brown caramel forms. Add the orange juice, zest, vinegar and stock. Stir to break up any lumps of caramel and then simmer until the volume of liquid has reduced by half. Add half the butter and the orange segments. Season to taste with salt and pepper and warm through the orange segments.",
        "Fry the potatoes in melted butter until hot and golden-brown.",
        "To serve, divide the potatoes between serving plates, slice the duck breasts and lay alongside. Spoon over the sauce."
    ],
    "tips": [
        
    ],
    "title": "Smoked tea duck with bigarade sauce",
    "videos": "[p01gys3p:p01gys46]"
}