{
    "author": {
        
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Italian",
    "description": "Serve this smoked salmon frittata for a simple supper. Add peas and broccoli to help you on your way to five a day. A tasty nutritious meal that costs less than £2.50 per portion, proving you can eat well for less. Find out how you could cut your food bills with the Eat Well for Less quiz.",
    "dishes": [
        "chips",
        "frittata",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/smoked_salmon_pea_and_28907_16x9.jpg"
    ],
    "ingredients": {
        "For the chips": [
            "3 large floury potatoes, cut into 1cm/½in chips",
            "drizzle of rapeseed oil"
        ],
        "For the frittata": [
            "6 free-range eggs",
            "2 tbsp milk",
            "60g/2¼oz smoked salmon trimmings",
            "1 tbsp oil",
            "85g/3oz broccoli (about one quarter of a broccoli head), florets thinly sliced",
            "100g/3½oz frozen peas",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "10",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 200C/Fan 180C/Gas 6.",
        "Spread the chips on a large baking tray in a single layer, drizzle with oil, then season well with salt and pepper. Bake for 45 minutes, turning from time to time, or until golden-brown and crisp.",
        "Meanwhile, crack the eggs into a bowl, add the milk and a pinch of salt and pepper, then whisk. Stir in the smoked salmon.",
        "Heat half the oil in an large ovenproof frying pan over a medium-high heat. Fry the broccoli for 3 minutes, then add the peas and fry for a further 1 minute.",
        "Add the remaining oil, shake the pan to evenly distribute the greens, and turn the heat up to high. Pour in the egg mixture and cook for 1 minute.",
        "Reduce the heat to medium and fry for 2-3 minutes, or until the base is cooked and golden.",
        "Bake the frittata for 10-12 minutes, or until the top is bubbled up and the frittata is fairly firm. Leave to cool.",
        "Slide the frittata onto a plate, cut it into slices and serve with the chips."
    ],
    "tips": [
        
    ],
    "title": "Smoked salmon, pea and broccoli frittata with homemade chips",
    "videos": "[]"
}