{
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "Soft, smoky haddock encased in crisp pastry makes a lighter version of these typically meaty parcels. Equipment and preparation: for this recipe you will need a freestanding food mixer.",
    "dishes": [
        "bread",
        "oven-baked_dishes",
        "pastry",
        "pasty",
        "pie",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "200g/7oz waxy new potatoes, such as Jersey Royals, peeled or scrubbed and sliced into 3-5mm thick pieces",
            "250g/9oz swede, peeled and sliced into 3-5mm thick pieces",
            "1 onion, chopped",
            "1 tbsp cracked black pepper",
            "pinch salt",
            "4 tbsp chopped flatleaf parsley",
            "500g/1lb 2oz smoked haddock, skinned, pin boned and cut into 1cm/½in chunks",
            "4 knobs of butter"
        ],
        "For the pastry": [
            "750g/1lb 10oz strong white bread flour",
            "1½ tsp salt",
            "75g/2¾oz cold butter, diced",
            "100g/3½oz cold lard, diced",
            "1 free-range egg, plus one yolk, beaten for glaze",
            "½ tsp flaky sea salt"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "",
    "serves": "Makes 4 pasties",
    "show": {
        "b04ksltb": "Tom Kerridge's Best Ever Dishes"
    },
    "steps": [
        "Place the flour and salt in a freestanding food mixer. Add the butter and lard and mix together using the beater attachment. When the mixture starts to look like breadcrumbs, change the beater attachment to a dough hook and add 3-4 tablespoons of cold water. Start to mix with the dough hook to form a dough. You will need to gradually add 220-260ml/8-9fl oz water to get the consistency that you are looking for, but don’t add it all at once as you may not need all the water. Once the mixture comes together to form a dough continue to knead in the mixer for 4-5 minutes, or until smooth and quite elastic. Remove from the mixing bowl, wrap in cling film and place the dough into the fridge to rest for at least one hour.",
        "While the dough is resting, make the filling. Place the sliced vegetables in a bowl and add the onion, cracked black pepper, salt and flatleaf parsley. Mix together then carefully stir in the haddock.",
        "Preheat the oven to 180C/350F/Gas 4 and line a baking tray with baking parchment.",
        "After one hour, take the dough out of the fridge and divide it into four equal pieces. Shape each piece into a ball with your hands.",
        "Lightly dust the work surface with a little flour and roll each ball out into a rough circle, about 25cm/10in wide. Spoon a quarter of the filling onto half of each disc, leaving the other half clear. Top the filling with a knob of butter, then carefully fold each round of pastry in half and join the edges, sealing them with a little beaten egg. Crimp the edges together to make sure the filling is held inside - you can do this with a fork or make small twists along the edges and then fold the ends underneath.",
        "Put the pasties on the prepared baking tray and brush the tops with the beaten egg mixture. Sprinkle each pasty with a little flaky sea salt.",
        "Bake for 40 minutes until golden-brown. Leave to cool on the tray for 10 minutes, then serve."
    ],
    "tips": [
        
    ],
    "title": "Smoked haddock pasties",
    "videos": "[]"
}