{
    "title": "Smoked salmon and cucumber timbale with a winter leaf salad and house dressing",
    "cookTime": "10 to 30 mins",
    "prepTime": "1-2 hours",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Cucumber wrapped parcels of salmon and soft cheese makes an elegant starter that can be made up to a day in advance.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b04v6210": "Christmas Kitchen with James Martin"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the smoked salmon": [
            "vegetable oil, for greasing",
            "1 cucumber, peeled and cut into long strips using a vegetable peeler",
            "115g/4oz ricotta cheese",
            "1 egg yolk, beaten",
            "125g/4½oz salmon fillet, skinned and cut into small pieces",
            "50g/1¾oz smoked salmon, cut into small pieces",
            "2 tsp chopped fresh dill",
            "½ lemon, juice only"
        ],
        "For the winter leaf salad": [
            "20g/¾oz baby spinach leaves",
            "20g/¾oz frisée lettuce, central leaves removed",
            "20g/¾oz French dressing",
            "30g/1oz honey",
            "30ml/1fl oz white balsamic vinegar",
            "500ml/18fl oz vegetable oil",
            "5g finely chopped shallot",
            "½ garlic clove, finely sliced",
            "1 tsp chopped fresh basil",
            "1 tsp chopped fresh thyme leaves",
            "1 tsp chopped chives",
            "1 tsp chopped fresh parsley",
            "dash herb oil (optional)"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4. Grease and line two ramekins with cling film.",
        "Lightly oil the strips of cucumber. Line the ramekins with the cucumber leaving an overhang at the sides (this will be folded over to cover the top later).",
        "Mix together the ricotta cheese, egg yolk, salmon and smoked salmon, dill and lemon juice. Use this to fill the ramekins and smooth the tops.",
        "Fold over the cucumber and cling film to seal and place in the fridge for at least an hour.",
        "Put the ramekins in a deep ovenproof dish. Add enough boiling water to come half way up the sides of the ramekins. Cook for 15-20 minutes, then set aside to cool.",
        "For the salad, put the spinach and frisée in a large bowl.",
        "Combine all the other ingredients in a blender until smooth. Just before serving, toss the salad leaves in the some of the dressing. (Any leftover dressing can be kept in the fridge for a few days.)",
        "To serve, turn out the timbale onto plates and serve the dressed salad alongside. Dress the plate with the herb oil, if using."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}