{
    "author": {
        "the_lindsay-millican_family": "The Lindsay-Millican Family"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "British",
    "description": "Cook these hearty Scottish potato stovies with a bubbling cheese topping and wholesome oatcakes on an autumn evening.",
    "dishes": [
        "cake",
        "casserole",
        "gratin",
        "jam",
        "oatcake",
        "roux",
        "salad",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the autumn salad": [
            "knob of butter",
            "handful walnut halves",
            "large handful rocket leaves",
            "handful blackberries",
            "handful gooseberries, halved",
            "1 red onion, sliced"
        ],
        "For the dressing": [
            "6 tbsp groundnut oil",
            "1-2 tbsp white wine vinegar, or to taste",
            "2 tbsp spiced winter berry cordial",
            "¼ -½ tsp chilli powder"
        ],
        "For the oatcakes": [
            "100g/4oz coarse oatmeal",
            "100g/4oz fine oatmeal",
            "1 tbsp oat flour or plain flour",
            "large knob of butter"
        ],
        "For the smoked mackerel stovies": [
            "50g/2oz butter",
            "1 small leek, white part and green part separated, both finely sliced",
            "500g/1lb 2oz Maris Piper or other clear-skinned floury potatoes, skin left on, cut into small cubes",
            "4 fillets hot-smoked peppered mackerel",
            "25g/1oz plain flour",
            "450ml/16fl oz milk",
            "150g/5oz parmesan, Grana Padano or very mature Cheddar, grated",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 2",
    "show": {
        "b00sy9ws": "The Hairy Bikers' Cook Off"
    },
    "steps": [
        "For the oatcakes, tip the oatmeals, flour and a pinch of salt into a mixing bowl. Melt the butter then stir into the oatmeal. Gradually add enough hot water to form a stiff, smooth dough. Roll out small balls of the dough and flatten with your hands to form cakes.",
        "Heat a large non-stick frying pan over a medium heat then add the oatcakes, in batches if necessary, and cook for 8-10 minutes on each side, or until golden-brown on both sides.",
        "For the smoked mackerel stovies, melt half of the butter in a large saucepan over a low-medium heat, add the white part of the leek and cook gently for five minutes until softened. Add the potatoes, stir to coat with the butter then pour in 150ml/5fl oz of boiling water.",
        "Increase the heat to high and cover the pan with a lid. Cook for about 20 minutes, regularly scraping up the golden-brown bits from the bottom of the pan and adding a splash more water, as necessary, to prevent it from burning.",
        "Preheat the grill to its highest setting. Arrange the mackerel on a grill pan and place under the grill for 4-5 minutes, or until sizzling and heated through. Leave to cool slightly then flake into large chunks and discard the skin.",
        "Melt the remaining butter in a pan then stir in the flour to make a roux. Cook over a low heat, stirring constantly, for five minutes. Stir the green part of the leek into the roux then gradually add the milk, bit by bit, stirring thoroughly after each addition to get rid of any lumps. Simmer for 5-10 minutes, stirring occasionally, until you have a thick, smooth sauce. Remove from the heat and stir in about two-thirds of the cheese. Season with salt and freshly ground black pepper.",
        "To assemble the stovies, arrange a layer of potatoes, then one of flaked mackerel in two individual casseroles or one large gratin dish. Pour over the cheese sauce and sprinkle with the remaining cheese. Place under the grill for five minutes, or until golden-brown and bubbling.",
        "Meanwhile, for the autumn salad, melt the butter in a small frying pan over a medium heat and lightly fry the walnuts for 3-4 minutes until just golden. Leave to cool then combine with all the other autumn salad ingredients.",
        "For the dressing, pour the oil, vinegar and cordial into a food processor and blend to combine (alternatively pour into a jam jar, screw the lid on tightly and shake vigorously to combine). Season, to taste, with chilli powder, salt and freshly ground black pepper.",
        "To serve, toss the salad with the dressing until the leaves are coated. Warm the oatcakes under the grill for one minute then serve alongside the stovies and salad."
    ],
    "tips": [
        
    ],
    "title": "Smoked mackerel stovies with autumn salad and oatcakes",
    "videos": "[]"
}