{
    "author": {
        "nigel_slater": "Nigel Slater"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Italian",
    "description": "Roasting the tomatoes first gives this quick tomato sauce a smoky edge. Stir through pasta with a handful of olives. This meal, if served as three portions, provides 164kcal, 3g protein, 16g carbohydrate (of which 16g sugars), 9g fat (of which 1.5g saturates), 5g fibre and 0.2g salt per portion.",
    "dishes": [
        "pasta",
        "pasta_sauce",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/smokytomatosauceforp_92376_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "10-15 tomatoes",
            "a good glug fruity olive oil",
            "salt and freshly ground black pepper",
            "1 small handful fresh thyme sprigs, leaves only",
            "1 handful fresh basil leaves, roughly torn",
            "splash of red wine vinegar, or pinch of sugar, to taste",
            "1 handful black olives, stones removed",
            "cooked spaghetti, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "18",
    "serves": "Serves 2-3",
    "show": {
        "b00vt10m": "Nigel Slater's Simple Suppers"
    },
    "steps": [
        "Preheat the grill to high. Cut the tomatoes in half and place on a baking tray cut-sides up so they fit, trickle with olive oil and season generously with salt and freshly ground black pepper. Scatter over the thyme leaves and place under the grill until the skins have blackened a little (this gives them a lovely smoky flavour).",
        "By now they will be slightly charred and squashy, releasing their luscious juices. Pour the tomatoes and all their juices into a bowl and roughly crush the tomatoes using the back of a fork before stirring in the torn basil leaves. Add a little red wine vinegar for sharpness if the tomatoes are too sweet, or a little sugar if they are too sharp. Finish the sauce by stirring in the olives.",
        "Serve the cooked spaghetti topped with the sauce, tossing well to coat evenly.",
        "Instead of olives, sliced salami or mozzarella work well, too."
    ],
    "tips": [
        
    ],
    "title": "Smoky tomato sauce for pasta",
    "videos": "[]"
}