{
    "title": "Smoked Texan chicken wings",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "over 2 hours",
    "serves": "Serves 6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Great for lunch, a barbecue or picnic, these wings have a hint of chilli but are warmly smoky rather than a flaming firecracker. Chicken wings consisting of just the wing joint without the tip are best for this dish. You’ll need to marinate this dish for at least 2 hours before cooking.",
    "author": {
        "mary_berry": "Mary Berry"
    },
    "show": {
        "b06z8bw3": "Mary Berry's Foolproof Cooking"
    },
    "tips": [
        "If bought fresh, the chicken wings can be left to marinate, covered and chilled in the fridge, up to a day ahead."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1kg/2lb 4oz chicken wings (tips removed)",
            "1 tbsp light muscovado sugar",
            "1 tbsp tomato ketchup",
            "2 tsp sweet smoked paprika",
            "1 garlic clove, crushed",
            "1 fresh red chilli, deseeded and finely chopped",
            "2 tbsp Worcestershire sauce",
            "2 tbsp olive oil",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Put the chicken in a large bowl and season with salt and pepper. Put the remaining ingredients in another bowl and mix.",
        "Pour the marinade over the chicken and toss to coat. Cover with cling film and marinate in the fridge for at least 2 hours or overnight.",
        "When you are ready to cook the chicken, preheat the oven to 220C/200C Fan/Gas 7 or heat up the barbecue. If you are using a barbecue, allow the flames to flare up and die down until the coals are just glowing before you start to cook the chicken.",
        "If cooking in the oven, transfer the chicken and marinade to a roasting tin in a single layer. Roast or barbecue for about 30 minutes, turning once halfway through, or until cooked through and a deep golden-brown.",
        "Serve hot or cold with salad and coleslaw."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}