{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "Smoked haddock topped with a cheesy rarebit sauce served with richly flavoured confit tomatoes.",
    "dishes": [
        "bread",
        "jam",
        "oven-baked_dishes",
        "sauce",
        "stir-fries",
        "welsh_rarebit"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chive oil": [
            "10g fresh chives",
            "100ml/3½fl oz olive oil"
        ],
        "For the confit tomato": [
            "4 plum tomatoes, deseeded and skinned and cut into petals",
            "50ml/2fl oz olive oil",
            "2 garlic cloves, thinly sliced",
            "2 sprigs thyme, leaves only"
        ],
        "For the smoked haddock rarebit": [
            "4 x 200g/7oz smoked haddock fillets",
            "1 tbsp olive oil",
            "25g/1oz unsalted butter, diced",
            "25g/1oz plain flour",
            "200ml/7fl oz full-fat milk",
            "200g/7oz strong Cheddar cheese",
            "1 tsp Dijon mustard",
            "1 free-range egg, yolk only",
            "2 tbsp fresh breadcrumbs",
            "1 tsp Worcestershire sauce",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "5",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the confit tomato preheat the oven to 90C/70C Fan/Gas ¼. Line a baking tray with parchment.",
        "Mix all the ingredients in a large bowl. Spread the mixture out on the lined baking tray and place in the oven for 2 hours, checking to make sure it doesn’t dry out completely.",
        "For the chive oil, blend the chives and oil in a liquidiser until smooth.",
        "For the smoked haddock rarebit, season the haddock with salt and pepper and place in a hot frying pan with a little olive oil and cook for 5-6 minutes.",
        "In a separate pan, melt the butter and add the flour. Cook for a couple of minutes. Gradually add the milk, whisking constantly until you have a smooth white sauce.",
        "Whisk in the cheese and add the mustard, egg yolk, breadcrumbs and Worcestershire sauce and stir.",
        "Preheat the grill to high. Top the haddock with the rarebit mixture and place under the grill until golden-brown on top.",
        "To serve, remove the haddock from the grill and place in the centre of the plate and put the confit tomatoes around the edge, and season with salt and black pepper. Drizzle the chive oil over the top."
    ],
    "tips": [
        
    ],
    "title": "Smoked haddock rarebit, confit tomatoes and chive oil",
    "videos": "[]"
}