{
    "title": "Smoked trout with green salad, a tarragon and cream dressing",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Serves 6",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "Tea smoking is a simple way of injecting a unique flavour into foods. Use this technique to enhance sustainable, affordable trout.",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the smoked trout": [
            "225g/8oz uncooked rice",
            "225g/8oz demerara sugar",
            "8 tea bags, torn open",
            "2 trout, cleaned and scales removed",
            "1 lemon, sliced"
        ],
        "For the salad and tarragon dressing": [
            "150g/5½oz pancetta lardons",
            "1 head frisée, centre leaves removed",
            "2 heads Little Gem lettuce",
            "6 tbsp double cream",
            "1 lemon, juice only",
            "2 sprigs fresh tarragon, leaves picked and chopped"
        ]
    },
    "steps": [
        "For the smoked trout, line a lidded wok or a pan for smoking with foil.",
        "Place the rice and sugar in the bottom and scatter the tea leaves over the top.",
        "Place a rack over the top and lay the trout on the rack, place the lemon slices on top.",
        "Place the pan on a high heat until the tea begins to smoke. Place a tight fitting lid on top and smoke for 15 minutes. (CAUTION: Tea smoking generates a lot of smoke, so ensure you maintain good ventilation in the kitchen.)",
        "Take the pan outside, if you are able, when you open it to remove the fish.",
        "For the salad and tarragon dressing, heat a small frying pan, then add the pancetta and cook for a couple of minutes until crisp. Set aside to drain on kitchen paper.",
        "Place the frisée and Little Gem into a large bowl and add the cooked pancetta.",
        "In a small bowl, whip the cream until it has thickened, then add the lemon juice and chopped tarragon.",
        "Pour the dressing over the salad and toss to mix, sprinkling the lardons over the top.",
        "To serve, place the smoked fish onto a plate and serve the salad next to it."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}