{
    "title": "Snail porridge",
    "cookTime": "over 2 hours",
    "prepTime": "overnight",
    "serves": "Serves 6",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "heston_blumenthal": "Heston Blumenthal"
    },
    "show": {
        "p0077hpp": "Full on Food"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the snail butter": [
            "25g/1oz garlic cloves, peeled",
            "40g/1½oz button mushrooms, finely chopped",
            "40g/1½oz shallots, finely chopped",
            "200g/7¼oz butter, at room temperature",
            "25g/1oz Dijon mustard",
            "20g/¾oz ground almonds",
            "5g salt",
            "100g/37frac12;oz flatleaf parsley, chopped",
            "40g/1½oz Parma ham"
        ],
        "For the snails": [
            "72 cooked snails (this allows for about 12 per person, but can be reduced)",
            "1 carrot, peeled and thinly sliced",
            "1 onion, peeled and thinly sliced",
            "1 fennel bulb, finely sliced",
            "1 stick of celery, finely sliced",
            "100g/3½oz button mushrooms, finely sliced",
            "2 garlic cloves",
            "bouquet garni made from bay leaves, thyme and rosemary"
        ],
        "For the porridge": [
            "10g/½oz Parma ham",
            "1 small fennel bulb",
            "200ml/7¼fl oz snail cooking stock",
            "60g/2¼oz porridge oats",
            "70g/2½oz snail butter",
            "the cooked snails",
            "knob of butter",
            "1 tsp sherry",
            "3 tsp walnut oil"
        ]
    },
    "steps": [
        "For the snail butter, blanch and refresh the garlic three to four times.",
        "Heat 50g/1¾oz of the butter in a frying pan, and sweat the mushrooms and shallots for 5-10 minutes until softened. Keep to one side.",
        "Put the remaining snail butter ingredients in a food processor and purée until smooth.",
        "Rub the mix through a fine-meshed sieve, then mix in the Parma ham, mushrooms and shallots.",
        "Mix in the Parma ham, mushrooms and shallots.",
        "Place on a sheet of cling film and roll into a cylinder. Store in the fridge to harden.",
        "To cook the snails, add them to a pan of boiling water and bring it back to the boil. Skim the surface and reduce the heat so that the water simmers very gently.",
        "Add the rest of the ingredients and simmer for three hours, remove from the heat and leave to cool a little before straining through muslin.",
        "Reserve the snails.",
        "Finely shred the Parma ham, and slice the fennel as thinly as possible.",
        "Heat the stock in a saucepan and when it's simmering add the oats. Stir until all of the liquid has been absorbed. Remove from the heat and beat in the snail butter.",
        "Season generously.",
        "Sauté the snails in butter and drain.",
        "To serve, spoon the porridge onto the plates and top with the sliced ham. Top the porridge and ham with the sautéed snails. Toss the fennel with the vinegar and walnut oil, and season. Place the fennel on top of the porridge and serve."
    ],
    "howTos": [
        "skimming_stock"
    ],
    "videos": "[]"
}