{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "This sophisticated dish takes a lesser known part of the fish and jazzes it up as a sensational starter. Equipment and preparation: for this recipe you will need a food processor.",
    "dishes": [
        "bread",
        "jam",
        "salsa",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the cod cheeks": [
            "150g/5½oz stale sourdough bread, roughly chopped",
            "1 unwaxed lemon, finely grated zest only, plus extra lemon wedges to serve",
            "75g/2½oz plain flour",
            "3 free-range eggs, lightly beaten",
            "20 cod cheeks, cleaned, membranes removed (available from fishmongers or online specialists)",
            "vegetable oil (or vegetable oil mixed with beef dripping), for deep-frying"
        ],
        "For the salsa": [
            "300g/10½oz frozen peas, defrosted",
            "3 tbsp roughly chopped fresh mint leaves",
            "2 green chillies, de-seeded and roughly chopped",
            "2 limes, juice only",
            "100g/3½oz crème fraîche",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "For the cod cheeks, blend the bread to crumbs in a food processor, then add the lemon zest and pulse again to combine. Tip the mixture into a shallow bowl and clean the food processor.",
        "Sprinkle the flour onto a plate and season with salt and freshly ground black pepper. Beat the eggs in a bowl.",
        "In batches, dust the cod cheeks in the flour, then dip them in the beaten egg, then roll them in the breadcrumb mixture until completely coated. Place each breaded cod cheek on a plate. Cover with cling film and chill in the fridge until needed.",
        "For the salsa, blend the peas, mint, chillies, lime juice and crème fraîche in the food processor to a rough paste. Tip it into a serving bowl, cover and chill until needed.",
        "Heat the oil (and dripping, if using) in a deep-fat fryer to 190C. Alternatively, heat the oil in a deep, heavy-based saucepan until a breadcrumb sizzles and turns golden-brown when dropped into it. (CAUTION: Hot oil can be dangerous. Do not leave unattended.)",
        "Carefully lower the cod cheeks into the hot fat in batches, and fry for 2-3 minutes, or until golden-brown and cooked through. Remove from the oil using a slotted spoon and set aside to drain on kitchen paper. Repeat the process with the remaining cod cheeks.",
        "To serve, pile the breaded cod cheeks onto a serving platter. Place the lemon wedges and the bowl of pea salsa alongside."
    ],
    "tips": [
        "Tip 1: Cod cheeks are solid lumps of meat with a membrane running through them, which needs to be removed - ask your fishmonger to do this for you. If you can’t get hold of cod cheeks, cod fillets will do. Tip 2: Both the cod cheeks and the salsa can be prepared one day in advance and chilled to make your dinner party run smoothly."
    ],
    "title": "Sourdough cod cheeks with spicy pea salsa",
    "videos": "[p02fjgsk:p02fjgss]"
}