{
    "author": {
        "atul_kochhar": "Atul Kochhar"
    },
    "cookTime": "less than 10 mins",
    "cusine": "Indian",
    "description": "This dish brings together the aromatic spices of South India. The crisp chicken is perfect paired with homemade tomato chutney.",
    "dishes": [
        "chicken_curry",
        "chutney",
        "curry"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the spiced fried chicken": [
            "600g/1lb 5oz chicken thighs, boned, skinned and cut into 2.5cm/1in cubes",
            "1 tsp salt",
            "2 tsp ginger and garlic paste",
            "2 lemons, juice only",
            "1 tbsp red chili paste or red chilli powder",
            "20 curry leaves, chopped",
            "75g/2¾oz gram flour",
            "150g/5½oz rice flour",
            "50g/1¾oz refined plain flour",
            "1 tsp red chili powder",
            "1 tsp salt",
            "vegetable oil, for deep frying",
            "2 tsp South Indian garam masala"
        ],
        "For the tomato chutney": [
            "8 curry leaves",
            "3 garlic cloves, chopped",
            "2 tbsp chopped coriander",
            "1 banana shallot, chopped",
            "1 tsp salt",
            "½ tsp chilli powder",
            "1 tsp cumin seeds",
            "2 large tomatoes, cut into wedges",
            "1 lemon, juice only"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "2",
    "serves": "Serves 4-5",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Season the chicken with salt, ginger and garlic paste, lemon juice, red chili paste and curry leaves. Cover the chicken and place in the fridge for an hour.",
        "Meanwhile in a mixing bowl add gram flour, rice flour, plain flour, red chilli powder and salt.",
        "Dust the marinated chicken cubes in the seasoned flour mixture.",
        "Heat a deep fat fryer to 180C/350F (CAUTION: hot oil can be dangerous. Do not leave unattended.) Deep fry the chicken until crisp and cooked through. Sprinkle the chicken with garam masala.",
        "For the tomato chutney, heat some oil in a small frying pan and lightly sauté the curry leaves. Drain on kitchen paper.",
        "Place the curry leaves, garlic, coriander, shallot, salt, chilli powder, cumin seeds in a stone pestle and mortar. Crush the mixture gently. Add tomato wedges and lemon juice, blending them in to the mixture.",
        "Season to taste with more salt and lemon juice.",
        "Place the fried chicken on a serving plate with the pounded chutney alongside."
    ],
    "tips": [
        
    ],
    "title": "South Indian spice fried chicken with tomato chutney",
    "videos": "[]"
}