{
    "author": {
        "anjum_anand": "Anjum Anand"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Indian",
    "description": "This recipe is deceptively easy and adapts to most vegetables.",
    "dishes": [
        "curry",
        "pie",
        "stir-fries",
        "vegetable_curry"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "2½ tbsp vegetable oil",
            "1 tsp cumin seeds",
            "½ medium onion, sliced",
            "1-2 green chillies, sliced in half lengthwise",
            "¾ tsp ground turmeric",
            "salt, to taste",
            "2 medium carrots, peeled and chopped",
            "2 medium potatoes, peeled and cut into chunks",
            "½ cucumber, halved lengthwise, seeds removed, chopped into 1cm/½in pieces",
            "100g/3½oz green beans, topped, tailed and chopped into thirds",
            "50g/2oz shallots, peeled and halved",
            "10g/½oz fresh ginger, peeled and roughly chopped",
            "60g/2½oz desiccated coconut, soaked in water to just cover",
            "2 small handfuls frozen peas",
            "12 fresh or dried curry leaves",
            "5-6 tbsp plain yoghurt",
            "1 tbsp coconut oil (optional)"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "10",
    "serves": "Serves 6",
    "show": {
        "b007szxr": "Indian Food Made Easy"
    },
    "steps": [
        "Heat the oil in a large non-stick pan. Add the cumin, onion and chillies and cook until the onions are soft and beginning to colour.",
        "When the onions are cooked, stir in the turmeric, salt, carrots and potatoes. Cover the pan and cook over a low heat, stirring often. If necessary, add a splash of water to prevent the vegetables from burning.",
        "After about 15 minutes, add the cucumber and beans. Cover the pan again and cook for a further 5-10 minutes until all the vegetables are tender.",
        "Meanwhile, place the shallots, ginger and coconut (complete with its soaking liquid) into a blender. Blend to a fine paste before adding to the pan, along with the peas. Cook for a further five minutes, stirring thoroughly. Tear the curry leaves into the pan and stir in the yoghurt.",
        "To serve, take the pan off the heat and pour the coconut oil over the vegetables, if using. Spoon the mixture on to six serving plates and serve with basmati rice."
    ],
    "tips": [
        
    ],
    "title": "Southern Indian mixed vegetable curry (Avial)",
    "videos": "[]"
}