{
    "title": "Soy and honey chicken with coconut brown rice",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "62",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/soy_and_honey_chicken_37066_16x9.jpg"
    ],
    "description": "This quick, easy recipe by MasterChef’s Monica Galetti is inspired by her mother’s home cooking back in New Zealand. Each serving provides 359kcal, 28g protein, 35g carbohydrate (of which 7g sugars), 11g fat (of which 2.5g saturates), 2g fibre and 1.2g salt.",
    "author": {
        "monica_galetti": "Monica Galetti"
    },
    "show": {
        "b03mzc66": "Food & Drink"
    },
    "tips": [
        "It's important to start cooking the chicken in a cold pan so that meat stews as it cooks. If the pan is hot, the honey and soy sauce will caramelise before the meat is cooked through."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "4 tsp clear honey",
            "4 tsp soy sauce",
            "450g/1 lb boneless, skinless chicken thighs",
            "150g/5oz brown rice",
            "pinch salt",
            "½ tsp coconut oil",
            "1 tsp black sesame seeds",
            "handful fresh coriander leaves",
            "1 tsp pumpkin seeds, chopped"
        ],
        "To serve": [
            "1 tbsp sesame oil",
            "1 tbsp rapeseed oil",
            "2 heads of bok choi, halved"
        ]
    },
    "steps": [
        "In a bowl, mix together the honey and soy sauce. Add the chicken thighs and mix until completely coated in the marinade.",
        "Place the coated chicken thighs into a cold, deep, heavy-based saucepan. Place the pan onto a medium heat and cook until the chicken is cooked through and the honey and soy coating has thickened to a glossy glaze.",
        "Meanwhile, add the rice, 300ml/10½fl oz water and salt to a separate pan and bring to the boil. Once the water is boiling, reduce the heat and simmer the rice, covered, until tender (about 30 minutes).",
        "For the bok choi, heat the sesame and rapeseed oil in a large frying pan over a medium heat. Add the bok choi and cook for 3-5 minutes, or until the leaves have wilted.",
        "When the rice is cooked, fluff it with a fork, then stir through the coconut oil, sesame seeds and coriander. Sprinkle over the chopped pumpkin seeds.",
        "To serve, spoon the rice onto serving plates and top with the soy and honey chicken. Place the bok choi alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}