{
    "title": "Hairy Bikers' spaghetti bolognese",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 5-6",
    "recommendations": "56",
    "images": [
        
    ],
    "description": "The Hairy Bikers give us their simple recipe for a classic spaghetti Bolognese, a firm family favourite for decades.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "tips": [
        "If serving at the table, it’s a good idea to toss the spaghetti with a tiny amount of oil before transferring it to a serving dish as this will stop the pasta sticking together. Make sure you don’t add too much though, or the sauce will slide off the spaghetti."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2 oz lean minced beef",
            "1 medium onion, finely chopped",
            "2 celery sticks, trimmed and finely sliced",
            "2 medium carrots, finely diced",
            "2 cloves garlic, finely chopped",
            "150g/5oz small portobello or chestnut mushrooms, wiped and sliced",
            "1 tbsp plain flour",
            "150ml/5 fl oz red wine",
            "1 x 400g/14oz can chopped tomatoes",
            "2 tbsp tomato purée",
            "1 beef stock cube",
            "1 tsp caster sugar",
            "1 tsp dried oregano or 1 tsp dried mixed herbs",
            "2 bay leaves",
            "375–450g/13oz-1lb dried spaghetti",
            "salt and freshly ground black pepper",
            "freshly grated parmesan cheese, for serving"
        ]
    },
    "steps": [
        "Place the mince in a large non-stick saucepan with the onion, celery, carrots and garlic.",
        "Dry-fry over a medium heat, stirring from time to time with a wooden spoon for 8–10 minutes, or until the beef is no longer pink and the vegetables are beginning to brown.",
        "Add the mushrooms and fry with the mince and vegetables for another 2–3 minutes.",
        "Sprinkle over the flour and stir well, then add the wine, tomatoes and tomato purée, along with 300ml/12fl oz cold water.",
        "Crumble the stock cube over the top then add the caster sugar and herbs.",
        "Season with a few twists of freshly ground black pepper, stir well and bring to a simmer.",
        "When the liquid is bubbling, reduce the heat and simmer very gently for 30–40 minutes, uncovered, stirring occasionally.",
        "Bring a large pan of salted water to the boil. As soon as the water is boiling, add the spaghetti and push it down with a wooden spoon to encourage the strands to separate. It’s important to use lots of water so the spaghetti can move freely without sticking together.",
        "Cook for 10–12 minutes, or according to the packet instructions.",
        "While the spaghetti is cooking, increase the heat under the sauce and simmer for another 10 minutes or until the liquid is reduced and the sauce is rich and thick. Stir regularly and season to taste with salt and freshly ground black pepper.",
        "Drain the spaghetti in a colander and divide between warmed bowls.",
        "Spoon the Bolognese sauce on top, sprinkle with freshly grated parmesan cheese and serve immediately."
    ],
    "howTos": [
        "how_to_brown_mince"
    ],
    "videos": "[]"
}