{
    "author": {
        "allegra_mcevedy": "Allegra McEvedy"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Italian",
    "description": "A crowd-pleaser if ever there was one - eggs, cheese, bacon and pasta. Save the egg whites for meringues or chocolate mousse. This is designed to be a low cost recipe.",
    "dishes": [
        "meringue",
        "mousse",
        "pasta",
        "sauce",
        "spaghetti_carbonara"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "400g/14oz spaghetti",
            "1 tbsp olive oil",
            "200g/7oz bacon, cut into matchsticks",
            "1 garlic clove, peeled and finely chopped",
            "4 egg yolks",
            "50g/1¾oz grated parmesan or pecorino",
            "50ml/1¾fl oz full-fat milk",
            "salt and pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "8",
    "serves": "Serves 4",
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "steps": [
        "Cook the spaghetti in a large saucepan of salted boiling water according to the packet instructions.",
        "Meanwhile, heat a large frying pan over a medium heat. Add the oil and, once hot, add the bacon and fry for 2-3 minutes, or until cooked through but not colouring. Add the garlic and cook for a further minute and then remove the pan from the heat.",
        "In a bowl, mix together the egg yolks, three-quarters of the parmesan (or pecorino) and the milk. Season with a pinch of salt and a decent amount of pepper. Mix well.",
        "Once the spaghetti is cooked, drain it, reserving a teacup of the cooking water. Pour the drained spaghetti into the frying pan (still off the heat) with the bacon and garlic. Immediately pour over the egg mixture and mix really well, tossing the pasta so that it is all coated in the egg. If it looks to be getting too thick or sticky then loosen with a little of the pasta cooking water.",
        "Serve immediately sprinkled with the remaining cheese."
    ],
    "tips": [
        "In May 2013 this recipe was costed at £2.67 at Asda, £3.02 at Tesco and £3.89 Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "title": "Spaghetti carbonara",
    "videos": "[]"
}