{
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Italian",
    "description": "This meaty Bolognese hides lots of lovely vegetables, making it a healthy recipe for all the family. Equipment and preparation: For this recipe you will need a hand-held blender or a food processor. This meal when served as six portions provides 355 kcal, 26g protein, 42g carbohydrate (of which 7.5g sugars), 9.5g fat (of which 4g saturates), 4g fibre and 0.6g salt per portion.",
    "dishes": [
        "crumble",
        "sauce",
        "spaghetti_bolognese",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spaghetti_bolognese_with_23409_16x9.jpg"
    ],
    "ingredients": {
        "To serve": [
            "grated Parmesan cheese, or similar hard Italian cheese"
        ],
        "default": [
            "1 onion, roughly chopped",
            "1 carrot, peeled, finely grated",
            "1 courgette, trimmed, finely grated",
            "1 red pepper, deseeded, thinly sliced",
            "500g/1lb 2oz lean beef mince",
            "400g tin chopped tomatoes",
            "2 tbsp tomato purée",
            "1 tsp dried oregano or dried mixed herbs",
            "1 beef stock cube",
            "1 bay leaf",
            "300g/10½oz dried spaghetti",
            "freshly ground black pepper",
            "salt"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 4-6",
    "show": {
        
    },
    "steps": [
        "Put the vegetables in a large, heavy-based saucepan and cover with 500ml/18fl oz water. Bring to the boil, then simmer for 8-10 minutes, or until the onion and pepper are very soft. Remove from the heat and blend the contents to a smooth purée using a hand-held blender. Set aside and keep warm.",
        "Heat a separate, non-stick, lidded saucepan over a medium heat. Dry-fry the beef mince for 3-5 minutes, stirring with a wooden spoon to break up any large clumps, until lightly browned on the outside.",
        "Add the puréed vegetables, chopped tomatoes, tomato purée and dried herbs to the pan, stirring well to combine. Crumble over the stock cube and add the bay leaf. Season with pepper and stir again.",
        "Bring to the boil, then reduce the heat until it is simmering. Half-cover the pan with the lid and continue to simmer gently for 25-30 minutes, stirring the sauce more and more regularly as it thickens.",
        "Meanwhile, bring a large pot of salted water to the boil. Add the spaghetti and cook until al dente.",
        "Divide the spaghetti between bowls and top with the Bolognese. Season with black pepper and Parmesan."
    ],
    "tips": [
        "If you don’t own a hand-held blender, set the sauce aside to cool slightly, then transfer it to a food processor and blend until smooth."
    ],
    "title": "Spaghetti Bolognese with hidden veggies",
    "videos": "[]"
}