{
    "author": {
        "emily_angle": "Emily Angle"
    },
    "cookTime": "10 to 30 mins",
    "description": "This is a real store cupboard saviour. Pork mince can vary wildly in fat content, so make sure you check before buying. You could add more vegetables to this stew if you like - spinach, sweet potato, carrot or celery would all work. Chickpeas are a nice substitution for the beans, too. Each serving provides 366 kcal, 27g protein, 44g carbohydrate (of which 7.5g sugars), 7.5g fat (of which 3g saturates), 7g fibre and 0.6g salt.",
    "dishes": [
        "bread",
        "meatballs",
        "sauce",
        "stew",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "250g/9oz lean pork mince (8% fat or less)",
            "25g/1oz dried breadcrumbs",
            "1 tsp garlic granules",
            "1 tsp ground cumin",
            "1 onion, grated",
            "spray oil, for frying",
            "20g/¾oz chopped chorizo",
            "1 x 400g tin chopped tomatoes",
            "1 x 400g tin cannellini beans, drained",
            "200g/7oz roasted red peppers from a jar (not in oil), drained weight, chopped",
            "100g/3½oz basmati rice",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b0725d98": "Food: Truth or Scare"
    },
    "steps": [
        "Mix together the pork mince, breadcrumbs, garlic granules, cumin, half the grated onion, plus a little salt and black pepper in a mixing bowl. Shape into 16 small meatballs and set aside.",
        "Spray a large, lidded pan with a little spray oil and add the chorizo. Fry until the chorizo begins to create a little more oil in the pan, then add the rest of the onion and fry gently for a minute.",
        "Add the tinned tomatoes, beans, chopped red pepper and half a tomato tin of water to the pan. Stir everything together and bring to a simmer. Put the meatballs carefully in the sauce, pushing them down with a spoon into the sauce.",
        "Season with more black pepper, then partially cover the pan and simmer for 20 minutes. Uncover the stew as you cook the basmati rice according to the packet instructions. Serve the stew with the rice alongside."
    ],
    "tips": [
        
    ],
    "title": "Spanish meatball stew",
    "videos": "[]"
}