{
    "author": {
        "anthony_demetre": "Anthony Demetre"
    },
    "cookTime": "10 to 30 mins",
    "description": "This is the perfect dish for dinning al fresco this summer with its combination exotic flavours of preserved lemon, chillies, green olives and herbs.",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        "carving_poultry"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chicken": [
            "1.2kg/2lb 12oz chicken, spatchcocked and backbone removed"
        ],
        "For the dressing": [
            "1 tbsp clear honey",
            "1 lemon, juice only",
            "45ml/2fl oz olive oil"
        ],
        "For the marinade": [
            "150g/5½oz whole preserved lemon",
            "4 garlic cloves",
            "1 sprig fresh rosemary, leaves only",
            "90g/3¼oz clear honey",
            "50ml/2floz olive oil",
            "3 green chillies, seeds removed, roughly chopped",
            "pinch red chilli flakes"
        ],
        "For the quinoa salad": [
            "1 tbsp rapeseed oil",
            "1 tbsp pumpkin seeds",
            "1 tbsp sunflower seeds",
            "200g/7oz cooked quinoa",
            "2-3 tbsp Gordal or Queen green olives, pitted and cut into segments",
            "1 preserved lemon, finely sliced",
            "60g/2¼oz broad beans",
            "small handful fresh parsley",
            "small handful mint",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Using a pestle and mortar (or a food processor) blend all the marinade ingredients together to a smooth paste. Brush the marinade onto the chicken, cover and leave on a baking tray in the fridge, for at least an hour, preferably overnight.",
        "Preheat the oven to 220C/425F/Gas 7. Cook the chicken for 20-25 minutes, or until golden-brown and cooked through. Leave to rest, then divide the chicken into four pieces.",
        "For the quinoa salad, heat the rapeseed oil in a frying pan and fry the pumpkin and sunflower seeds until golden-brown. Set aside.",
        "Combine the quinoa, olives, preserved lemon, broad beans, parsley and mint in a bowl. Tip in the cooled seeds and season with salt and freshly ground black pepper.",
        "For the dressing, whisk all the dressing ingredients together in a small bowl and pour over the quinoa salad and the chicken.",
        "Serve the chicken pieces with the salad."
    ],
    "tips": [
        "Spatchcocking means to split open and flatten out a bird for grilling or barbecuing. This speeds up the cooking time and ensures more even cooking. Watch our technique video linked from this page to learn how to do this, or alternatively ask your butcher to do it."
    ],
    "title": "Lemon and honey spatchcock chicken with quinoa and broad bean salad",
    "videos": "[]"
}