{
    "title": "Spatchcock poussin with walnut salad",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "Spatchcocked poussin take no time to cook and the result is juicy, tender meat. Try them served with a spicy sauce and creamy celery and walnut salad.",
    "author": {
        "stuart_gillies": "Stuart Gillies"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "3 tbsp shallots, finely chopped",
            "6 tbsp flat leaf parsley, finely chopped",
            "2 jalapeño chillies, roughly chopped",
            "2 tbsp chopped fresh oregano",
            "½ bunch fresh chives, finely chopped",
            "2 tbsp sherry vinegar",
            "2 tbsp olive oil",
            "splash Tabasco sauce",
            "½ lemon, juiced",
            "2 lemons, halved",
            "4 poussin, spatchcocked"
        ],
        "For the walnut salad": [
            "3 celery stalks, peeled into ribbons",
            "150g/5oz walnuts",
            "100g/3½oz Stilton, crumbled",
            "50g/2oz flatleaf parsley leaves",
            "handful celery leaves (the yellow leaves from centre of the celery head)",
            "110ml/4fl oz crème fraîche",
            "50g/2oz honey",
            "1 tbsp sherry vinegar",
            "200g/7oz mayonnaise"
        ]
    },
    "steps": [
        "Mix the shallots, parsley, chillies, oregano and chives together in a bowl. Stir in the vinegar, olive oil, Tabasco sauce and lemon juice.",
        "Preheat the grill to medium-high.",
        "Heat an ovenproof griddle pan until hot. Place the poussins and lemon halves onto the griddle pan and fry for 2-3 minutes on each side, or until golden-brown on both sides.",
        "Transfer to the grill and cook for for 8-10 minutes, or until cooked through. Squeeze the roasted lemon halves over the poussins (take care as the lemon halves will be hot).",
        "For the walnut salad, mix the celery, walnuts, stilton, parsley and celery leaves together in a bowl.",
        "Whisk the crème fraîche, honey, vinegar and mayonnaise together in a bowl until smooth. Add the dressing to the salad and mix until well combined.",
        "Mix the salad with enough of the dressing to coat.",
        "To serve, place the poussin onto a serving plate, drizzle over the sauce and spoon the salad alongside."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}