{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bread",
        "kebab",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the kebabs": [
            "3-4 tbsp vegetable oil",
            "1 onion, finely chopped",
            "1 red chilli, finely chopped",
            "1 garlic clove, crushed to a paste with the edge of a knife",
            "450g/1lb lamb mince",
            "50g/1¾oz raisins",
            "1 tsp ground cinnamon",
            "pinch ground cloves",
            "1 tbsp chopped fresh mint",
            "salt and freshly ground black pepper",
            "2-3 tbsp butter, melted"
        ],
        "To serve": [
            "6 pitta breads, warmed, split",
            "6 tbsp Greek-style yoghurt",
            "6 handfuls lightly dressed mixed green salad"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 6",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "For the kebabs, heat one tablespoon of the vegetable oil in a frying pan over a medium heat. Add the onion, chilli and garlic and fry, stirring occasionally, for 4-5 minutes, or until softened.",
        "Transfer the mixture to a large mixing bowl and add the lamb mince, raisins, ground cinnamon, ground cloves and chopped mint. Season, to taste, with salt and freshly ground black pepper and mix until well combined.",
        "Divide the kebabs mixture into six equal-sized portions. Mould around six metal skewers, leaving 5cm/2in free at the end of each. Brush each kebab all over with the remaining vegetable oil.",
        "Heat a griddle pan over a medium heat. When the pan is hot, add the kebabs and cook, occasionally turning and basting with the melted butter, for 6-8 minutes, or until golden-brown griddle marks appear on the kebabs and they are completely cooked through.",
        "To serve, fill each warmed pitta bread with one tablespoon of the Greek-style yoghurt and one handful of the dressed mixed salad. Place a kebab inside each filled pitta and serve."
    ],
    "tips": [
        
    ],
    "title": "Spiced lamb kebabs",
    "videos": "[]"
}