{
    "title": "Spiced chicken and pandan leaves (Gai how bi towey)",
    "cookTime": "10 to 30 mins",
    "prepTime": "30 mins to 1 hour",
    "serves": "Makes about 20",
    "recommendations": "",
    "images": [
        
    ],
    "description": "These deep-fried parcels of spicy chicken loveliness make a great starter for a dinner party. You will need 20 cocktail sticks for this recipe.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b03vp3tt": "The Hairy Bikers' Asian Adventure"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "4 garlic cloves, chopped",
            "10 coriander roots, washed and finely chopped",
            "15g/½oz galangal, coarsely grated",
            "1 tbsp crushed palm sugar (if none available, use brown sugar)",
            "squeeze of lime juice",
            "a good pinch white pepper",
            "1 tbsp sesame oil",
            "1 tbsp Thai fish sauce",
            "1 tbsp dark soy sauce",
            "500g/1lb 2oz 2 large or 3 medium skinless chicken breasts, cut in half lengthways and into bite-sized pieces",
            "20 pandan leaves, depending on how many chunks of chicken you get",
            "vegetable oil, for frying",
            "2 limes cut into wedges, to serve"
        ],
        "For the sauce": [
            "40g/1½oz finely grated ginger (squeeze the juice out of it using a piece of muslin then discard the ginger pulp)",
            "1 pinch sugar",
            "1 tbsp sesame oil",
            "½ tbsp Thai fish sauce",
            "½ tbsp soy sauce",
            "½ tbsp rice vinegar"
        ]
    },
    "steps": [
        "In a pestle and mortar (or a small blender), pound together the garlic, coriander root and the galangal. Add the palm sugar and make a smooth paste.",
        "Put the mixture into a large bowl. Add the lime juice and a good pinch of white pepper. Add the sesame oil, Thai fish sauce and soy sauce. Mix thoroughly with the chicken in a shallow dish, cover with cling film and marinade in the fridge for half an hour.",
        "For the sauce, mix all the sauce ingredients together in a bowl. Pour into a suitable serving bowl and leave to one side.",
        "Take a large pan of boiling water and gently ease in the pandan leaves, blanching for 30 seconds and then remove and dry with some kitchen paper.",
        "Take a pandan leaf and wrap it around a piece of the chicken, trim the thick stalk off and secure with a cocktail stick. Repeat to use up all the chicken and leaves.",
        "Heat the oil in a pan, wok or a deep-fat fryer to 180C/350F (CAUTION: hot oil is dangerous. Do not leave unattended.)",
        "Fry for eight minutes, or until the pandan is golden-brown and the chicken cooked through. You will need to cook the parcels in batches. Remove with a slotted spoon and drain on a plate lined with kitchen paper.",
        "Serve with the sauce and wedges of lime."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}