{
    "author": {
        "richard_bainbridge": "Richard Bainbridge"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "North_African",
    "description": "Baking eggs in a spicy tomato sauce is very common in many parts of the world, most famously in the Mexican dish huevos rancheros. This version is topped with cheese for an extra treat and is designed to be a low-cost recipe. This meal provides 509 kcal, 24g protein, 56g carbohydrate (of which 10g sugars), 22g fat (of which 7g saturates), 6g fibre and 1.7g salt per portion.",
    "dishes": [
        "crumble",
        "flatbread",
        "pie",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spiced_north-african_82972_16x9.jpg"
    ],
    "ingredients": {
        "For the eggs": [
            "1 tbsp olive oil",
            "1 onion, chopped",
            "1 green pepper, deseeded and sliced",
            "1 garlic clove, sliced",
            "½ tsp crushed chilli flakes",
            "2 x 400g/14oz tins chopped tomatoes",
            "salt and black pepper",
            "6 eggs",
            "100g/3½oz feta cheese or Greek-style cheese, crumbled"
        ],
        "For the flatbreads": [
            "250g/9oz plain flour, plus extra for dusting",
            "pinch salt",
            "1tbsp olive oil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 4",
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "steps": [
        "To make the flatbreads, sieve the flour and a generous pinch of salt into a mixing bowl. Make a well in the middle and add the oil. Mix into the flour then add 100-150ml/3½-5fl oz warm water until the mixture comes together to form a dough.",
        "Knead the dough for 3-4 minutes, or until elasticated a little so that the dough springs back while you knead. Set aside to rest.",
        "For the eggs, heat a wide, heavy-based pan over a medium heat. Add the olive oil and, once hot, gently fry the onion with a pinch of salt until softened and translucent. Add the green pepper, cover with a lid and gently fry for further five minutes, or until soft.",
        "Once the pepper is softened, add the garlic. Cook for two minutes, then sprinkle in the chilli flakes and add the chopped tomatoes. Season with a little salt and pepper and cook over a medium-low heat for 10-15 minutes, or until the sauce is rich and flavoursome. Taste and adjust the seasoning as necessary.",
        "Meanwhile, divide the flatbread dough into eight balls. On a lightly floured work surface, roll each ball out to the thickness of a 50p piece (each flatbread should be approximately 12cm/4½in in diameter).",
        "Heat a heavy-based frying pan over a high heat. Cook a flatbread in the dry pan for 2-3 minutes on each side, or until slightly charred, cooked through and a little puffed up. Transfer to a plate and wrap in a clean tea towel. Repeat the process with the remaining dough. Keep warm while you finish the eggs.",
        "Make six wells in the tomato mixture and break an egg into each. Cover the pan and cook gently over a low heat for 3-4 minutes, or until the whites are set (cook for a further 2-3 minutes if you like your yolks set).",
        "Sprinkle with the feta and serve with the warm flatbreads on the side."
    ],
    "tips": [
        "In May 2013 this recipe was costed at £3.71 at Asda, £3.46 at Tesco and £3.57 at Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "title": "Spiced North African-style eggs with homemade flatbreads",
    "videos": "[]"
}