{
    "title": "Spicy beef with harvest vegetable salad",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 10-12",
    "recommendations": "3",
    "images": [
        
    ],
    "description": "This large platter of spiced beef and roasted vegetables is ideal for sharing at parties or as part of a buffet.",
    "author": {
        "annabel_langbein": "Annabel Langbein"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        "The mayonnaise or garlic dressing will keep for up to two weeks in a jar in the fridge. If you prefer a thicker mayonnaise, add four tablespoons more vegetable oil. For a thinner consistency add a little hot water."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the speedy mayonnaise": [
            "2 eggs",
            "3 tbsp lemon juice",
            "1 tsp Dijon mustard",
            "½ tsp salt",
            "a good pinch of white pepper",
            "275ml/9½fl oz vegetable oil"
        ],
        "For the garlic dressing": [
            "175g/6oz speedy mayonnaise",
            "175g/6oz Greek yoghurt",
            "1-2 garlic cloves, crushed",
            "2 tbsp lemon juice",
            "½ tsp salt",
            "ground black pepper to taste"
        ],
        "For the spicy beef with harvest vegetables": [
            "1.2kg/2lb 12oz beef sirloin, cut in two pieces lengthwise",
            "4 tbsp pomegranate molasses or balsamic glaze",
            "4 tsp ground cumin",
            "2 tsp ground coriander",
            "1 tsp salt",
            "ground black pepper, to taste",
            "½ medium pumpkin, peeled, cut into 5mm/¼in thick slices",
            "3 aubergines, halved lengthwise and cut into 1cm/½in thick slices",
            "4 red peppers, core removed, cut into eighths",
            "4 tbsp olive oil, plus extra for grilling",
            "2 tsp ground cumin",
            "8 handfuls watercress or rocket leaves",
            "¼ cup dukkah spice mix (available online and from delis)"
        ],
        "For the sesame prawn toast": [
            "250g/9oz raw prawn meat, finely chopped",
            "60g/2¼oz speedy mayonnaise (from above)",
            "1 tsp sesame oil",
            "salt and ground black pepper",
            "6 slices white bread, crusts removed, quartered",
            "1 tbsp sesame seeds",
            "1 tbsp roughly chopped chives"
        ]
    },
    "steps": [
        "For the speedy mayonnaise, place all the ingredients in a narrow bowl or jug and mix on a high speed with a stick blender (this is key – it won’t work in a food processor because it needs the speed of the blender to make it emulsify). It will thicken at once to create a creamy mayonnaise.",
        "For the garlic dressing, stir together all the ingredients and set aside.",
        "For the spicy beef with harvest vegetables, rub the beef all over with pomegranate molasses or balsamic glaze.",
        "Sprinkle the cumin and coriander on a board with the salt and pepper then roll the meat in the mixture. (The beef can be prepared ahead and marinated for up to 24 hours in the fridge. Bring back to room temperature before cooking.)",
        "When ready to cook, preheat a griddle pan until hot and brush with a little oil and grill the beef over medium-high heat until browned all over (about two minutes each side).",
        "Reduce the heat and cook until done to your liking (approximately 20-25 minutes for medium-rare). (Alternatively, brown the beef in a lightly oiled frying pan then roast in an oven preheated to 200C/400F/Gas 6 for 15-20 minutes.)",
        "Set the beef aside to rest for 10 minutes before carving into thin slices to serve.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "Place the sliced pumpkin, aubergine and peppers on a tray, drizzle with oil, sprinkle with cumin, salt and pepper, and toss to coat evenly.",
        "Roast the vegetables in the preheated oven for 30-40 minutes, or alternatively cook on a griddle pad, turning frequently, until lightly charred and tender. Keep warm until ready to serve.",
        "For the sesame prawn toasts, reduce the oven temperature to 180C/350F/Gas 4 and line a baking tray with baking parchment.",
        "Mix the prawn meat with speedy mayonnaise, sesame oil and salt and pepper. Spread onto the bread triangles and sprinkle with sesame seeds.",
        "Place on the prepared baking tray and bake until the toast is golden-brown and crisp (approximately 15 minutes).",
        "Sprinkle with chives and place on a large sharing platter.",
        "To serve, arrange watercress or rocket on a large platter and top with the roasted vegetables and beef. Drizzle with garlic dressing and sprinkle with dukkah. Serve alongside the hot sesame prawn toasts."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}