{
    "author": {
        "the_weaver_family": "The Weaver family"
    },
    "cookTime": "no cooking required",
    "cusine": "North_African",
    "description": "A spice rub, harissa paste and fresh chermoula marinade bring layers of flavour to this meal for four.",
    "dishes": [
        "bun",
        "pie",
        "prepare-ahead_desserts",
        "sauce",
        "seafood",
        "stir-fries",
        "stock",
        "tagine"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chermoula": [
            "1 tsp coriander seeds",
            "1 tsp cumin seeds",
            "1 lemon, finely grated zest and juice",
            "½ orange, finely grated zest only",
            "handful coriander leaves, chopped"
        ],
        "For the couscous": [
            "knob of butter",
            "300g/10oz couscous",
            "handful green sultanas, roughly chopped",
            "1 heaped tbsp harissa (see above)",
            "1 tbsp olive oil",
            "½ tbsp lemon juice"
        ],
        "For the green beans": [
            "400g/14oz green beans, very finely sliced",
            "50g/2oz toasted flaked almonds",
            "olive oil, for drizzling",
            ""
        ],
        "For the harissa": [
            "2 tbsp paprika",
            "1-2 tbsp cayenne pepper",
            "1-2 tbsp ground cumin",
            "1 tbsp ground caraway",
            "1 tbsp ground coriander",
            "2 red chillies, seeds removed, flesh finely chopped",
            "2 tsp salt",
            "6 tbsp olive oil",
            "1-2 tbsp tomato purée",
            "3 garlic cloves, crushed",
            "bunch fresh coriander",
            "½ lemon, juice only"
        ],
        "For the seafood": [
            "2 large skinless cod fillets (each weighing about 200g/7oz), chopped into large pieces",
            "4-8 scallops",
            "8-12 raw king prawns"
        ],
        "For the spice mix": [
            "3 tsp coriander seeds",
            "3 tsp cumin seeds",
            "2 tsp ground turmeric",
            "pinch saffron threads",
            "1 medium chilli, chopped",
            "3 tbsp olive oil"
        ],
        "For the tagine": [
            "1 onion, finely chopped",
            "1 celery stalk, finely chopped",
            "1 carrot, finely chopped",
            "3 garlic cloves , crushed",
            "sea salt",
            "5 new potatoes, peeled and cut into quarters lengthways",
            "3 tomatoes, seeds removed, flesh finely chopped",
            "2 litres/3½ pints chicken or vegetable stock",
            "1 red pepper, seeds removed, flesh chopped",
            "1 yellow pepper, seeds removed, flesh chopped",
            "1 green pepper, seeds removed, flesh chopped",
            "1 medium chilli, seeds removed, flesh chopped",
            "200g/7oz pitted black olives",
            "1 large orange, grated zest and juice",
            "handful coriander leaves, chopped, to garnish"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "5",
    "serves": "Serves 4",
    "show": {
        "b00sy9ws": "The Hairy Bikers' Cook Off"
    },
    "steps": [
        "For the spice mix, dry-fry the coriander and cumin seeds over a medium heat for 1-2 minutes until aromatic. Tip into a mini food processor, add the remaining spice mix ingredients and blend to a paste (alternatively use a pestle and mortar).",
        "For the tagine, heat the olive oil in a large, heavy based saucepan over a medium heat. Add the onion, celery, carrot and garlic and fry gently for 5-6 minutes, until softened and the onions are translucent. Season with salt.",
        "Stir in the potatoes, chopped tomatoes and all of the spice mix and fry for a further 7-8 minutes. Add a ladle of the stock and the chopped peppers and bring to a boil for one minute, then pour in the remaining stock.",
        "Stir in the chilli, olives, orange zest and juice, cover with a lid and simmer for 25-30 minutes.",
        "Meanwhile, for the chermoula, dry-fry the coriander and cumin seeds over a medium heat for 1-2 minutes until aromatic. Use a spice grinder or pestle and mortar to crush the seeds then mix with the remaining chermoula ingredients.",
        "For the seafood, mix all of the seafood with the chermoula and set aside to marinate for ten minutes.",
        "For the harissa, dry-fry all the spices over a medium heat for 1-2 minutes until aromatic then tip into a mini food processor with all the remaining harissa ingredients and blend to a paste.",
        "For the couscous, prepare the couscous according to packet instructions, along with the knob of butter, and set aside to absorb the water. Fluff up the couscous with a fork then stir through all the remaining couscous ingredients.",
        "For the beans, steam the green beans for 2-3 minutes or until just tender. Top with the flaked almonds and drizzle with the olive oil.",
        "Just before serving, add the chermoula-coated seafood to the tagine and simmer for 3-4 minutes or until the seafood is opaque and the prawns are pink.",
        "Serve the tagine with the harissa couscous and the green beans alongside. Garnish with coriander."
    ],
    "tips": [
        "You can make the spice mix, chermoula and harissa in advance. Store the mixture in jars in the fridge."
    ],
    "title": "Spicy fish tagine with harissa couscous and shredded green beans",
    "videos": "[]"
}