{
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "cookTime": "1 to 2 hours",
    "description": "Roast chicken with a delicate hint of Chinese herbs and spices, soy and whiskey.",
    "dishes": [
        "oven-baked_dishes",
        "roast_chicken",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spiced_soy_roast_chicken_28095_16x9.jpg"
    ],
    "ingredients": {
        "For the basting sauce": [
            "4 tbsp soy sauce",
            "2 tbsp Irish Whiskey",
            "2 tbsp chilli sauce",
            "2 tbsp honey",
            "pinch chilli flakes"
        ],
        "For the brine": [
            "75g/2½oz salt",
            "60g/2¼oz sugar"
        ],
        "For the chicken": [
            "1 x 1.5kg/3lb 5oz free range chicken",
            "½ tsp salt",
            "1 tsp Chinese five-spice powder",
            "5 garlic cloves, unpeeled, lightly smashed",
            "10 slices fresh root ginger, skin on",
            "2 spring onions, roughly chopped",
            "4 tbsp vegetable oil"
        ],
        "For the medley of vegetables": [
            "100g/4oz carrots, sliced",
            "100g/4oz green beans, topped and tailed",
            "100g/4oz asparagus tips",
            "100g/4oz cauliflower, small florets",
            "100g/4oz broccoli, small florets",
            "4 tbsp butter",
            "2 tbsp fresh root ginger, finely chopped or grated",
            "2 tbsp light soy sauce"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "31",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Dissolve the salt and sugar in 1 litre/1¾ pints water, to make the brine. Add the chicken to the brine and leave for 1 – 2 hours. Drain and pat dry.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "Mix the salt and five spice powder and rub it over the chicken, inside and out. Place the garlic, ginger slices and spring onion in the cavity and tie with string.",
        "Heat the vegetable oil in a roasting pan and lightly brown the chicken on each side on top of the stove.",
        "Transfer the chicken to the oven and roast for 15 minutes at 220C/ 425F/Gas 7.",
        "Meanwhile, mix together all the ingredients for the basting sauce. After the chicken has been roasting at a high heat for 15 minutes, turn the oven down to 170C/350F/Gas 4 and roast for another 50 minutes. During the last 30 minutes, baste the chicken with the sauce frequently.",
        "At the end of the cooking time, remove the chicken from the oven and allow to rest.",
        "For the medley of vegetables, heat a pan of salted water, up to the boil. Add the carrots then after a minute, add the green beans. After another minute add the asparagus. Repeat at minute intervals until all the vegetables have been added. When all the vegetables are cooked thoroughly, drain.",
        "Melt the butter with the ginger and soy, either in the microwave or a small saucepan. Drizzle over the vegetables, toss lightly.",
        "Once rested, joint the chicken by removing the legs and breasts. Cut each in half and arrange on a serving platter and serve with the pan juices and the vegetables."
    ],
    "tips": [
        
    ],
    "title": "Spiced soy roast chicken",
    "videos": "[]"
}