{
    "title": "Spicy autumn squash stew",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "",
    "recommendations": "8",
    "images": [
        
    ],
    "description": "This easy one-pot stew in endlessly adaptable, see the variations below.",
    "author": {
        "katharine_reeve": "Katharine Reeve"
    },
    "show": {
        
    },
    "tips": [
        "Substitute sweet potatoes for the squash and half a 400ml/14fl oz can of chopped tomatoes for the cherry tomatoes. Or add green pepper and half a 400ml/14fl oz can drained chickpeas. For extra protein, add 3-4 skinless chicken breasts, cut into chunks or 200g/7oz prawns, a handful of mangetout, and a dash of fish sauce."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "2 tbsp sunflower oil",
            "1 onion, finely chopped",
            "2 garlic cloves, finely chopped",
            "1 small red chilli, very finely chopped (or dried red chilli flakes, to taste)",
            "1 red pepper, cut into short strips",
            "6 spring onions, sliced diagonally",
            "1 tsp ground coriander",
            "1 medium butternut squash, peeled, deseeded, and rough cut into 2cm/1in pieces",
            "2 handfuls cherry tomatoes, halved",
            "400ml/14fl oz coconut milk",
            "½ lemon, juice only",
            "salt and freshly ground black pepper to taste",
            "small bunch coriander, leaves and stalks chopped separately"
        ]
    },
    "steps": [
        "Heat the oil in a a heavy-bottomed saucepan, add the onion, garlic, chilli, red pepper and spring onions and cook gently for about five minutes until soft.",
        "Add the ground coriander and cook for a minute then add the squash, coriander stalks, and tomatoes. Cook this for a further five minutes.",
        "Add the coconut milk and simmer, partially covered, for 15 minutes or until the squash is tender.",
        "Add the lemon juice, season with salt and freshly ground black pepper to taste and sprinkle over the coriander leaves. Serve with white or brown basmati rice."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}