{
    "title": "Spiced spatchcocked poussin with stir-fried rice, stuffed tomatoes and spicy broccoli",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "gino_dacampo": "Gino D'Acampo"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the poussin": [
            "1 poussin, spatchcocked",
            "1 tbsp olive oil",
            "½ tsp dried chilli flakes",
            "50ml/2fl oz red wine"
        ],
        "For the stir-fried rice": [
            "1 tbsp olive oil",
            "½ onion, sliced",
            "1 tsp dried chilli flakes",
            "100g/3½oz long grain rice, cooked and drained",
            "125ml/4fl oz white wine",
            "2 tbsp chopped fresh coriander"
        ],
        "For the stuffed tomatoes": [
            "2 plum tomatoes, halved, seeds removed",
            "2 tbsp olive oil",
            "½ onion, chopped finely",
            "100g/3½oz long grain rice",
            "300ml/10fl oz hot vegetable stock",
            "100g/3½oz wild mushrooms, chopped roughly",
            "2 tbsp chopped fresh parsley",
            "55g/2oz parmesan, grated"
        ],
        "For the broccoli": [
            "2 tbsp olive oil",
            "1 head broccoli, cut into florets",
            "1 tsp dried chilli flakes",
            "100g/3½oz wild mushrooms, such as oyster or porcini, sliced",
            "1 tbsp chopped fresh parsley"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the poussin, rub the poussin with the olive oil and chilli flakes. Heat an ovenproof griddle pan and griddle the poussin skin-side down until the skin is crisp. Turn over and cook until golden-brown on the other side. Pour the red wine into the pan and transfer to the oven to roast for 15 minutes, or until the poussin is completely cooked through. (The juices will run clear when the meat is pierced at the thickest point with a skewer.)",
        "For the stir-fried rice, heat the oil in a pan and gently fry the onion and chilli flakes for 3-4 minutes until the onion is soft. Add the cooked rice and stir well, then pour in the white wine and heat through for about five minutes. Stir in the chopped coriander.",
        "For the stuffed tomatoes, place the tomato halves cut-side up on a baking sheet and drizzle with half of the olive oil. Roast in the oven for about five minutes.",
        "Meanwhile, heat the remaining oil in a pan and fry the onion until soft. Stir in the rice and continue to cook until the rice is coated in the oil and has turned transparent.",
        "Add the vegetable stock a little at a time, until it is all incorporated, stirring between each addition.",
        "Stir in the mushrooms and cook for a further two minutes, then stir in the parsley and parmesan. Remove the tomato halves from the oven and spoon some of the rice mixture into the roasted tomato halves.",
        "For the broccoli, heat the oil in a pan and add the broccoli, chilli flakes and mushrooms. Stir fry for about 5-6 minutes, then stir in the chopped parsley.",
        "To serve, place the stir-fried rice onto a serving plate and top with the poussin. Serve with the stuffed tomatoes and broccoli, and any remaining mushroom rice."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}