{
    "title": "Spiced rhubarb and orange syrup",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 150-180ml/5-6fl oz",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This fruity spiced syrup is perfect for mixing into sparkling wine or lemonade, or topping yoghurt or desserts. Use the leftover rhubarb for a pie or crumble.",
    "author": {
        "sandra": "Sandra Bright"
    },
    "show": {
        "b04wlw4w": "The Big Allotment Challenge"
    },
    "tips": [
        "This syrup can be added to soft drinks and cocktails, stirred into yoghurts, or used as a garnish for desserts. It will keep in a cool place for 2-3 weeks."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "3 oranges, juiced, 2 zested",
            "2 cloves, crushed",
            "400g/14oz rhubarb, trimmed and chopped",
            "100-130g/3½-4½oz caster sugar",
            "½-¾ tsp ground cinnamon",
            "1-2 cinnamon sticks, to decorate (optional)"
        ]
    },
    "steps": [
        "Bring the juice, zest, cloves and rhubarb gently to the boil in a large saucepan over a medium heat. Reduce the heat and simmer, stirring occasionally, for 10-12 minutes, or until the rhubarb has almost broken down.",
        "Strain the rhubarb mixture through a fine sieve into a jug, pushing the fruit with the back of a wooden spoon to extract as much juice as possible. Pour the strained liquid (there should be about 150-200ml/5-7fl oz) into a clean saucepan.",
        "Stir half the sugar into the strained liquid until dissolved. Add the remaining sugar a tablespoon at a time, and the ground cinnamon a pinch at a time, stirring and tasting after each addition, until the sweetness and spiciness are to your liking.",
        "Bring to the boil, then reduce the heat until it is simmering and the sugar has dissolved. Simmer for 3-4 minutes, or until the mixture forms a light syrup that coats the back of a metal spoon.",
        "Pour the syrup into a sterilised bottle (preferably with a tap at the bottom) and seal. Set aside to cool. Tie a cinnamon stick to the neck of the bottle for decoration, if desired."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}