{
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "North_African",
    "description": "This full-flavoured tagine is a cheap, healthy way of getting extra vegetables into your family's diet. This dish is suitable for freezing; in fact, freezing will intensify its flavour. This meal, if served as five portions, provides 299kcal, 9g protein, 41g carbohydrate (of which 24g sugars), 9g fat (of which 1g saturates), 11g fibre and 0.1g salt per portion.",
    "dishes": [
        "casserole",
        "oven-baked_dishes",
        "stir-fries",
        "tagine"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spiced_vegetable_tagine_32956_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 sweet potato (about 300g/10½oz), peeled and cut into roughly 2cm/¾in chunks",
            "1 aubergine, cut into roughly 2.5cm/1in chunks",
            "2 courgettes, halved lengthways, sliced into 2cm/¾in half-moons",
            "1 red pepper, stalk removed, seeds removed, cut into roughly 2.5cm/1in chunks",
            "3 tbsp mild olive oil or sunflower oil",
            "1 small onion, thinly sliced",
            "4 garlic cloves, thinly sliced",
            "1 tsp ground coriander",
            "1 tsp ground cumin",
            "400g tin chopped tomatoes",
            "1 tbsp harissa paste",
            "2 tbsp clear honey",
            "100g/3½oz ready-to-eat dried apricots, halved",
            "400g tin chickpeas, rinsed and drained",
            "handful chopped fresh coriander, to garnish",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "15",
    "serves": "Serves 4-5",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 190C/170C Fan/Gas 5.",
        "Mix the sweet potato, aubergine, courgette and red pepper in a large bowl. Drizzle over 2 tablespoons of the oil and mix to coat. Season generously with salt and pepper.",
        "Heat a large, non-stick frying pan over a high heat. When the pan is hot, add the vegetables in batches and fry, stirring and turning regularly, for 3-4 minutes, or until lightly browned.",
        "Heat the remaining oil in a lidded casserole over a medium heat. Add the onions and fry for 3-5 minutes, stirring regularly, until softened. Add the garlic, coriander and cumin and fry for 1-2 minutes, stirring frequently.",
        "Stir in the chopped tomatoes, harissa paste, honey, apricots and chickpeas until well combined. Add the vegetables and cook for 2-3 minutes.",
        "Cover and transfer to the oven. Cook for 30 minutes, then stir in 200ml/7fl oz cold water until well combined and return to the oven, covered, for a further 15 minutes, or until the tagine is thick and the vegetables are tender.",
        "Sprinkle the tagine with the chopped coriander and serve with freshly cooked couscous or rice."
    ],
    "tips": [
        "Make sure the pan is properly hot before you cook the vegetables - otherwise they will take too long to brown and turn mushy. To freeze this dish allow it to cool completely, then pop in a freezer-proof container. It will keep in the freezer for up to 2 months. Thaw overnight in the fridge then reheat in a suitable dish in the microwave until piping hot throughout, stirring at least once."
    ],
    "title": "Spiced vegetable tagine",
    "videos": "[]"
}