{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "A light, creamy seafood soup flavoured with fennel, garlic and a touch of curry powder.",
    "dishes": [
        "baguette",
        "bread",
        "curry",
        "fish_soup",
        "jam",
        "sauce",
        "seafood",
        "soup",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the griddled toast": [
            "1 white baguette, sliced",
            "2 tbsp olive oil"
        ],
        "To garnish": [
            "2 tbsp coriander cress",
            "2 tbsp olive oil"
        ],
        "default": [
            "2kg/4lb 8oz fresh mussels in shells, cleaned and beards removed",
            "300ml/10½fl oz white wine",
            "1 tbsp olive oil",
            "1 shallot, finely chopped",
            "1 garlic clove, finely chopped",
            "1 fennel bulb, roughly chopped",
            "4 tsp curry powder",
            "300ml/10½fl oz fish stock",
            "100ml/3½fl oz double cream",
            "salt and pepper",
            "1 lemon, juice only",
            "2 tbsp butter",
            "1 carrot, peeled and very finely chopped",
            "½ fennel bulb, very finely chopped",
            "¼ leek, very finely chopped",
            "200g/7oz girolle mushrooms"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the spiced mussel soup, if any mussels are opened, tap them lightly on a hard surface. If they don't close, discard them.",
        "Put the mussels in a saucepan, add the white wine and cook for 3-4 minutes. Drain, reserving the cooking liquor, and discard any closed mussels.",
        "Pick most of mussels from their shells, keeping some in their shells for the garnish. Discard the shells.",
        "Heat a large frying pan and add the oil. Add the shallot, garlic, fennel and curry powder and cook for 3-4 minutes.",
        "Add the stock, three-quarters of the mussels and the cream.",
        "Cook for a further 3-4 minutes, until warmed through, then blend with a stick blender until smooth. Season with salt, pepper and lemon juice, to taste.",
        "Melt the butter in a large frying pan. Once hot, add the carrot, fennel and leek and cook for 2-3 minutes. Add the mushrooms and cook for a further two minutes.",
        "Meanwhile, for the griddled toast, heat a large griddle pan until hot. Drizzle the sliced bread with oil. Toast the bread on the griddle for 2-3 minutes.",
        "To serve, pile the cooked carrot, fennel, leeks and mushrooms in the centre of shallow serving bowls and ladle the blended soup around the edge.",
        "Garnish with a swirls of olive oil, coriander cress and the reserved mussels. Place the griddled toast on the side."
    ],
    "tips": [
        
    ],
    "title": "Spiced mussel soup",
    "videos": "[]"
}