{
    "author": {
        "connoly_mccausland": "Connoly McCausland"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "South_American",
    "description": "These Argentinian stuffed pastries are packed full of flavour, and make a great addition to your lunchbox.",
    "dishes": [
        "bread",
        "canape",
        "pastry",
        "pasty",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        "crimping_pasty",
        "how_to_boil_eggs",
        "how_to_brown_mince",
        "rubbing_in"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spiced_beef_empanadas_36922_16x9.jpg"
    ],
    "ingredients": {
        "For the meat filling": [
            "2 eggs",
            "2 tbsp olive oil",
            "1 onion, finely chopped",
            "1 green pepper, seeds removed, finely chopped",
            "400g/14oz lean minced beef",
            "1 tsp paprika",
            "1 tsp chilli powder",
            "30g/1oz raisins",
            "12 green olives, pitted, roughly chopped",
            "2 hard boiled eggs, chopped",
            "1 tsp dried cumin",
            "Pinch salt",
            "vegetable oil, for frying",
            "1 tsp caster sugar"
        ],
        "For the pastry": [
            "450g/1lb plain flour",
            "2 tsp baking powder",
            "1 tsp salt",
            "60g/2¼oz butter, diced into 1cm/½in cubes",
            "60g2¼oz lard, diced into 1cm/½in cubes"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "6",
    "serves": "Makes 12",
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "steps": [
        "For the pastry, mix the flour, baking powder and salt in a bowl. Add the diced butter and lard and rub into the flour using your fingertips until the mixture has the texture of fine breadcrumbs. Add cold water one teaspoon at a time, mixing between additions with a table knife, until the dough comes together into a soft dough (the dough will take anything between 3-6 tbsp water). Roll the dough into a ball and wrap well in cling film, leave to rest in the fridge for an hour.",
        "For the meat filling, boil the eggs for 10 minutes, until hard boiled. Cool under running water, then peel and chop. Set to one side.",
        "Heat the olive oil in a frying pan, add the onion and cook on a low heat until transparent and softened. Add the green pepper and minced beef and fry over a high heat until the meat has browned, then add the paprika and chilli powder. Remove the pan from the heat and add the raisins, olives, cumin and chopped eggs. Season to taste with salt and freshly ground black pepper.",
        "To assemble the empanadas, remove the pastry from the fridge, and roll out to pound coin thickness (3mm). Cut circles from the pastry, using a saucer as a guide, or else use a 12cm/4½in pastry cutter.",
        "Put two teaspoons of filling onto one half of each pastry circle. Wet the edges of the pastry with a little water, fold the non-filled half of the pastry over the filled half, and crimp the edges together to seal or use a fork to mark the edges. Repeat with the remaining pastry circles.",
        "Heat the vegetable oil in a large pan and fry the empanadas in batches until golden and cooked through. Add more oil between batches to prevent the empanadas from sticking to the pan. Sprinkle with caster sugar and serve warm."
    ],
    "tips": [
        "It's important not to overfill the empanadas, so use your judgement when portioning the filling to prevent the pastries leaking when cooking. Try making these into mini versions and serve with drinks as a canapé. Use a small pastry cutter to cut the pastry into small circles, using a teaspoon of filling and then sealing as per the method."
    ],
    "title": "Spiced beef empanadas",
    "videos": "[]"
}