{
    "title": "Spicy beetroot and coconut soup with herby yoghurt",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "11",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spicybeetrootandcoco_85158_16x9.jpg"
    ],
    "description": "Simon says that this is one of the most stunning soups you will ever make. It's both earthy and spicy at the same time, and it has a great pink colour.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        "To make the recipe easier, you can use readymade green Thai paste instead of making the spice base."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the spice paste": [
            "2 lemongrass stalks",
            "2 garlic cloves",
            "3 red chillies, deseeded if you don't want too much heat",
            "5cm/2in fresh ginger, peeled",
            "4 kaffir lime leaves",
            "1 lime, juice only"
        ],
        "For the soup": [
            "1 tbsp vegetable oil",
            "2 banana shallots(or 4 round shallots), finely chopped",
            "pinch sea salt",
            "1 tsp cumin seeds",
            "500g/1lb 2oz ready cooked beetroot (not the kind prepared with vinegar), chopped",
            "600ml/1 pint vegetable stock",
            "400ml/14fl oz can light coconut milk",
            "salt and freshly ground black pepper"
        ],
        "For the herby yoghurt": [
            "2 tbsp plain yoghurt",
            "1 tbsp fresh mint, chopped",
            "1 tbsp fresh coriander leaves",
            "5cm/2in cucumber, deseeded, chopped",
            "flatbread, to serve"
        ]
    },
    "steps": [
        "For the spice paste, put all the paste ingredients into a food processor and blend until smooth (the smoother the paste the better the soup, so take your time).",
        "For the soup, heat the vegetable oil in a large pan over a medium heat. Add the shallots, salt and cumin seeds and fry gently for a few minutes until the shallots have softened. Add the spice paste and cook for about five minutes to release the fragrance.",
        "Add the beetroot and cook for two minutes. Add the stock, bring to the boil and simmer for 7-8 minutes.",
        "For the herby yoghurt, mix the yoghurt with the fresh mint, coriander and cucumber.",
        "Just before serving, put the soup and coconut milk into a food processor and blend until smooth (don't do this in advance or the colour will turn brownish). Season with salt and freshly ground black pepper.",
        "To serve, reheat the soup gently for a few minutes. Pour into bowls and swirl in some of the herby yoghurt. Serve with flatbread."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}