{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This substantial salad with roasted spicy squash can be served with Paul Hollywood’s rich savoury brioche couronne.",
    "dishes": [
        "bread",
        "brioche",
        "caramel",
        "crumble",
        "oven-baked_dishes",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the dressing": [
            "3 tbsp red wine vinegar",
            "130ml/4fl oz olive oil",
            "5 spring onions, trimmed and chopped at an angle",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "1 savoury brioche couronne"
        ],
        "default": [
            "2.4kg/5lb 3oz butternut squash or pumpkin, peeled, seeds removed, chopped into 2cm/1in cubes",
            "2-3 large red chillies, seeds removed, sliced",
            "1½ tsp ground cumin",
            "1½ tsp dried chilli flakes",
            "salt and freshly ground black pepper",
            "80ml/3fl oz good olive oil",
            "150g/5½oz pak choi leaves, separated and roughly chopped",
            "150g/5½oz baby spinach leaves",
            "large handful pitted black olives",
            "300g/10oz goats’ cheese, crumbled (optional)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4-6",
    "show": {
        "b01rhdgt": "Paul Hollywood's Bread"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6. In a roasting tray, toss together the pumpkin with the fresh chillies, cumin, chilli flakes, salt and pepper and all but one tablespoon of the olive oil. Roast for 30 minutes, turning over about half way through, until the pumpkin has caramelised. Leave to cool slightly.",
        "Heat the remaining tablespoon of olive oil in a frying pan and lightly wilt the pak choi for a minute or so, then put them in a serving dish to cool slightly.",
        "To make the dressing, whisk the vinegar and olive oil together in a bowl, then add the spring onions and season with salt and pepper.",
        "Scatter the pumpkin, baby spinach and olives over the pak choi leaves, mix them lightly, then scatter over the crumbled goats’ cheese (if using) and drizzle the dressing on top.",
        "Serve the salad with slices of a bread with a filling, such as a savoury brioche couronne."
    ],
    "tips": [
        
    ],
    "title": "Spicy squash salad",
    "videos": "[]"
}