{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Turkish_and_Middle_Eastern",
    "description": "This is a quick and easy dish using fragrant Middle-Eastern spices, loads of herbs and succulent pork.",
    "dishes": [
        "bun",
        "jam",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the marinade": [
            "1 large bunch fresh coriander, roughly chopped",
            "1 large bunch fresh mint, leaves roughly chopped",
            "1 lemon, juice only",
            "1 tsp ground coriander",
            "1 tsp ground cumin",
            "½ tsp sumac",
            "1 tbsp za’atar",
            "50ml/1¾fl oz extra virgin olive oil",
            "450g/1lb pork tenderloin, trimmed of sinew and cut into thick slices"
        ],
        "For the tabbouleh": [
            "1 pomegranate, seeds removed",
            "3 ripe tomatoes, chopped",
            "8 spring onions, trimmed, roughly chopped",
            "1 large bunch fresh flatleaf parsley, leaves roughly chopped",
            "1 tbsp za’atar",
            "125g/4½oz bulgur wheat, soaked in cold water for 2 hours, then drained",
            "2 lemons, juice only",
            "2 tbsp pomegranate molasses",
            "2 tbsp honey",
            "100ml/3½fl oz extra virgin olive oil",
            "50g/2oz flaked toasted almonds, to serve",
            "sea salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "For the marinade, mix together all the herbs, spices and oil in a bowl. Add the pork slices and stir to coat them in the marinade, then set aside in the fridge for half an hour.",
        "For the tabbouleh, mix the pomegranate seeds, tomatoes, spring onions, parsley, za’atar, and bulgur wheat in a large bowl until well combined.",
        "Mix together the lemon juice, pomegranate molasses, honey and half of the olive oil in a separate bowl. Season, to taste, with salt and freshly ground black pepper.",
        "Combine the two mixtures and season again if necessary, then stir in the flaked almonds. Set aside.",
        "Heat the remaining olive oil in a frying pan over a medium heat. Add the pork slices, in batches, for 2-3 minutes, or until golden-brown on both sides and cooked through.",
        "To serve, transfer all of the frying pan contents, including the oil, to a serving platter. Serve the tabbouleh in a large bowl alongside."
    ],
    "tips": [
        
    ],
    "title": "Spiced pork and pomegranate tabbouleh",
    "videos": "[p03fghm4:p03fghmf]"
}