{
    "author": {
        "lets_get_cooking": "Let's Get Cooking"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Mexican",
    "description": "This hearty, warming soup uses basic store cupboard ingredients and is cooked from scratch in the microwave. Add extra chilli powder for a spicy kick. This meal, if served as six portions, provides 94kcal, 4.5g protein, 13g carbohydrate (of which 7g sugars), 1g fat (of which 0.2g saturates), 6g fibre and 0.3g salt per portion.",
    "dishes": [
        "crumble",
        "pie",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spicy_mexican_bean_soup_91809_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 onion",
            "2–3 garlic cloves",
            "2 medium carrots or 1 medium carrot and 1 medium sweet potato",
            "1 red pepper",
            "½ vegetable stock cube",
            "1 x 400g/14oz can red kidney beans",
            "1 tsp vegetable oil",
            "1 tsp chilli powder",
            "1 tsp ground cumin (optional)",
            "1 tsp dried oregano (optional)",
            "1 x 400g/14oz can chopped tomatoes",
            "ground black pepper (optional)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "12",
    "serves": "Serves 4–6",
    "show": {
        
    },
    "steps": [
        "Peel the onion and chop into small pieces, then peel and press or finely chop the garlic (chop it as small as you can).",
        "Peel, top and tail the carrots (and the sweet potato if using) and chop into 1cm/½in chunks.",
        "Wash the pepper, deseed and slice into 1cm/½in pieces.",
        "Place the onion, garlic, carrots and (sweet potatoes if using) in the microwavable bowl and mix well. Place the bowl in the microwave and cook on full power for three minutes.",
        "Measure 300ml/10fl oz of boiling water into a measuring jug, crumble in the stock cube and stir to dissolve. Open the can of kidney beans, drain and rinse with cold water through the colander. Set aside.",
        "Add the red pepper, oil and chilli powder to the microwaveable bowl. Add the cumin and oregano, if using. Stir and microwave on full power for one minute.",
        "Stir in the chopped tomatoes, stock and black pepper, to taste (if using). Stir well again, then microwave on full power for 15 minutes, stirring every five minutes.",
        "Remove the soup from the microwave. Taste (take care the soup will be very hot) and add more black pepper if required (if using).",
        "If you want smooth soup, rather than chunky soup, you can blend it at this stage. (Ladle a third of the soup into a jug blender. Holding a tea towel over the lid, blend the soup and pour into a clean mixing bowl. Repeat the process until all the soup is blended. Return to the microwave-safe bowl.)",
        "Add the kidney beans to the soup and microwave on full power for three minutes, stirring after two minutes.",
        "Remove the soup from the microwave and allow to stand for one minute before serving."
    ],
    "tips": [
        
    ],
    "title": "Spicy Mexican bean soup",
    "videos": "[]"
}