{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "Paul's light roulade is filled with smoked salmon, lemon and dill - perfect for summer parties. For this recipe you will need a food processor and an electric mixer.",
    "dishes": [
        "oven-baked_dishes",
        "swiss_roll"
    ],
    "flags": [
        
    ],
    "howTos": [
        "folding",
        "how_to_make_a_swiss_roll_cake"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the filling": [
            "200g/7oz full-fat cream cheese",
            "50g/1¾oz full-fat crème fraîche",
            "1 lemon, finely grated zest and juice only",
            "handful freshly chopped dill",
            "240g/8½oz smoked salmon",
            "crushed sea salt and freshly ground black pepper"
        ],
        "For the roulade": [
            "250g/9oz baby spinach",
            "5 medium eggs, separated",
            "1 tsp baking powder",
            "crushed sea salt and freshly ground black pepper",
            "50g/1¾oz Parmesan, finely grated"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Makes 1 roulade",
    "show": {
        "b03qgyqf": "The Great Sport Relief Bake Off"
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6. Grease and line a Swiss roll tin with baking parchment.",
        "For the roulade, wilt the spinach in a pan, then when cool enough to handle, squeeze out as much juice as you can, leaving the spinach as dry as possible.",
        "Tip the spinach into a food processor. Add 4 egg yolks, the baking powder and plenty of crushed sea salt and ground black pepper. Pulse until really finely chopped and well mixed. Transfer to a large mixing bowl.",
        "In a large, clean, grease-free bowl, whisk 5 egg whites until stiff using an electric mixer. Gently fold the egg whites into the spinach mixture.",
        "Tip the mixture into the prepared Swiss roll tin and smooth the surface using a palette knife. Bake for 8-10 minutes, or until firm to the touch. Remove from the oven and leave to cool slightly.",
        "Place a sheet of baking parchment on a work surface and sprinkle liberally with Parmesan. Turn the cooked roulade out onto the Parmesan coated parchment and leave to cool.",
        "For the filling, mix the cream cheese, crème fraîche, lemon zest and dill together until smooth, then season with crushed sea salt (not adding too much as the smoked salmon is quite salty) ground black pepper and lemon juice, to taste.",
        "Peel the cooked parchment paper off the top of the cooled roulade. Spread the filling over the roulade using a palette knife. Top the filling with an even layer of smoked salmon.",
        "Using the Parmesan coated parchment to help you, roll up the roulade from the shortest end, pushing it away from you while rolling to make a tight swirl. Trim the ends and serve."
    ],
    "tips": [
        
    ],
    "title": "Spinach and smoked salmon roulade",
    "videos": "[]"
}