{
    "author": {
        "gino_dacampo": "Gino D'Acampo"
    },
    "cookTime": "less than 10 mins",
    "description": "",
    "dishes": [
        "bread",
        "pasta",
        "ravioli",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "rolling_pasta_dough",
        "rubbing_in"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the mushroom and leek filling": [
            "125g/4½oz ricotta",
            "¼ leek, finely chopped",
            "50g/1¾oz mixed mushrooms, for example oyster, shiitake and enoki, finely chopped",
            "salt and freshly ground black pepper"
        ],
        "For the pasta dough": [
            "200g/7oz Italian '00' flour, plus extra for flouring",
            "3 free-range eggs"
        ],
        "For the sage butter sauce": [
            "100g/3½oz butter",
            "6 fresh sage leaves",
            "squeeze lemon juice",
            "salt and freshly ground black pepper"
        ],
        "For the spinach and ricotta filling": [
            "125g/4½oz ricotta",
            "75g/3oz spinach, finely chopped",
            "pinch freshly grated nutmeg",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 2",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "For the pasta dough, place the flour and two of the eggs into a food processor and pulse until the mixture resembles breadcrumbs.",
        "Turn out onto a floured surface and knead until the mixture comes together to make a dough. Cut the dough in half and roll each ball through a pasta machine according to the machine instructions, finishing with the thinnest setting. Hang the pasta sheets up to dry for ten minutes, then place onto a floured surface.",
        "For the spinach and ricotta filling, place the ricotta, spinach and nutmeg into a bowl, season, to taste, with salt and freshly ground black pepper and mix well.",
        "For the mushroom and leek filling, place the ricotta, leek and mushrooms into a bowl, season, to taste, with salt and freshly ground black pepper and mix well.",
        "Place spoonfuls of the filling mixtures widely spaced apart on one of the pasta sheets. Lightly beat the remaining egg and brush around each spoonful of filling. Lay the other sheet of pasta on top and press around each spoonful of filling to seal. Cut squares around the filling.",
        "Bring a large pan of salted water to the boil and cook the ravioli for 1-2 minutes, or until al dente. Remove with a slotted spoon and set aside to keep warm.",
        "For the sage butter sauce, heat the butter and sage in a frying pan until the butter has melted. Add the lemon juice, season with salt and freshly ground black pepper and add the cooked pasta to the pan. Stir to coat the pasta.",
        "To serve, place the ravioli into warmed serving dishes."
    ],
    "tips": [
        
    ],
    "title": "Spinach and ricotta and mushroom and leek ravioli with sage butter sauce",
    "videos": "[]"
}