{
    "title": "Spinach and Port Salut soufflé",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "75ml/2½fl oz milk",
            "2 tsp cornflour",
            "30g/1oz butter",
            "85g/3oz Port Salut cheese, chopped",
            "2 free-range eggs, separated",
            "1 tbsp olive oil",
            "¼ onion, finely chopped",
            "1 garlic clove, finely chopped",
            "50g/2oz spinach, chopped",
            "salt and freshly ground black pepper",
            "melted butter, for greasing"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6. Place a baking sheet into the oven.",
        "Place the milk, cornflour and butter into a small saucepan and whisk together over a gentle heat. Add two-thirds of the Port Salut and whisk until melted. Remove from the heat and allow to cool slightly, then whisk in the egg yolks.",
        "In a separate saucepan, heat the olive oil and sauté the onion for 3-4 minutes. Add the garlic and cook for one minute. Add the spinach and cook for a further minute. Season well with salt and freshly ground black pepper, then pour into a food processor and blend until almost smooth. Add the spinach mixture to the cheese mixture and stir gently.",
        "In a large clean bowl, whisk the egg whites until stiff peaks form when the whisk is removed. Gently fold the whisked egg whites into the spinach mixture.",
        "Brush two ramekins with melted butter and spoon in the spinach and cheese mixture. Slice the remaining Port Salut and place on top of the soufflés.",
        "Place the ramekins onto the preheated baking sheet, transfer to the oven and bake for ten minutes, or until risen and golden-brown on top. Serve immediately in the ramekins."
    ],
    "howTos": [
        "whisking_egg_whites"
    ],
    "videos": "[]"
}