{
    "author": {
        "tony_tobin": "Tony Tobin"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "custard",
        "oven-baked_dishes",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the custard": [
            "100ml/3½fl oz double cream",
            "50ml/2fl oz milk",
            "1 vanilla pod, seeds scraped out",
            "4 free-range egg yolks",
            "50g/1¾oz caster sugar"
        ],
        "For the sponge pudding": [
            "115g/4oz plain flour",
            "115g/4oz unsalted butter",
            "115g/4oz caster sugar",
            "3 large free-range eggs",
            "1 vanilla pod, seeds scraped out",
            "100g/3½oz frozen winter berries, defrosted in microwave, juice drained and kept separately for syrup"
        ],
        "For the syrup": [
            "50ml/2fl oz winter berry juice",
            "25g/1oz caster sugar",
            "30m/1fl oz red wine"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Makes 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "To make the sponge, mix together the flour, butter, sugar, eggs, vanilla seeds and defrosted berries in a food processor.",
        "Grease a pudding bowl or oven-proof dish with butter and spoon in the sponge mix. Cover with cling film and microwave on full power for eight minutes.",
        "To make the custard, place the cream, milk, vanilla seeds and split pod in a small saucepan. Bring to simmering point and set aside to infuse.",
        "In a large bowl whisk together the egg yolks and sugar.",
        "Remove the vanilla pod from the warm cream and milk mix and discard.",
        "Whisk the warm milk and cream mix into the egg and sugar. Pour this mix back into the saucepan. Stir continuously, until the mixture coats the back of a spoon.",
        "To make the fruit syrup, place the berry juices, caster sugar and red wine into a small saucepan over a high heat. Bring the boil and reduce for two minutes, until thickened.",
        "To serve, turn the sponge onto a plate, drizzle with custard and spoon over some syrup."
    ],
    "tips": [
        
    ],
    "title": "Sponge pudding with custard and fruit syrup",
    "videos": "[]"
}