{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "1 to 2 hours",
    "cusine": "British",
    "description": "Recreate the best of nursery puddings from school dinner days with this traditional steamed pudding.",
    "dishes": [
        "custard",
        "jam",
        "pie",
        "sauce",
        "sponge_pudding",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/spotteddickandcustar_87835_16x9.jpg"
    ],
    "ingredients": {
        "For the custard": [
            "200ml/7fl oz milk",
            "200ml/7fl oz double cream",
            "6 free-range egg yolks",
            "75g/3oz caster sugar"
        ],
        "For the spotted dick": [
            "300g/10oz plain flour",
            "10g/2 tsp baking powder",
            "150g/5oz shredded suet",
            "75g/3oz caster sugar",
            "110g/4oz currants",
            "1 lemon, zest only",
            "200ml/7fl oz milk",
            "butter, for greasing"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "17",
    "serves": "Serves 6",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the spotted dick, place the flour, baking powder, shredded suet, caster sugar, currants and lemon zest into a bowl and mix to combine.",
        "Add the milk and stir to make a soft dough.",
        "Grease a pudding basin with butter and spoon the mixture into the basin. Cover with a piece of folded greaseproof paper.",
        "Tie around the edge with string to secure the paper and place a damp tea towel over the top. Tie once more with string to secure the tea towel.",
        "Place the basin into a large lidded saucepan and fill the pan two-thirds of the way up with water.",
        "Cover with the lid, bring to a boil and simmer for one hour.",
        "For the custard, place the milk and cream into a saucepan and bring to a simmer.",
        "Place the egg yolks and sugar into a bowl and whisk together until light and frothy.",
        "Pour the hot milk onto the eggs, a little at a time, and stir well. Pour the mixture back into the pan and cook over a low heat, stirring with a wooden spatula, until just thickened.",
        "To serve, slice a wedge of spotted dick for each person and place onto each of six plates. Pour over the custard and serve at once."
    ],
    "tips": [
        
    ],
    "title": "Spotted dick and custard",
    "videos": "[]"
}