{
    "title": "Spotted dick with a kick of stem ginger",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6-8",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "Chopped stem ginger and orange is the twist to this version of a classic British pud. Equipment and preparation: you will need a large saucepan with a steamer insert and two muslin cloths.",
    "author": {
        "christine": "Christine Wallace"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "175g/6oz currants",
            "85g/3oz sultanas",
            "55g/2oz stem ginger from a jar, drained, chopped",
            "1½ tbsp grated orange zest",
            "2 tbsp fresh orange juice",
            "280g/10oz plain flour",
            "140g/5oz suet",
            "1 tsp salt",
            "2 tsp baking powder",
            "200ml/7fl oz milk",
            "butter, for greasing",
            "vanilla ice cream, to serve"
        ]
    },
    "steps": [
        "Mix together the dried fruit, chopped ginger and orange zest and juice in a bowl and set aside.",
        "In a separate bowl, combine the flour, suet, salt and baking powder. Add the milk, mixing as you add it, until the dough comes together as a roll-able consistency and not too dry. Add more milk if necessary.",
        "Drain the fruit and roll the pastry into a rough rectangle and sprinkle over half of the drained fruit.",
        "Fold the pastry in half and sprinkle over half of the remaining fruit. Roll out again and repeat with the rest of the fruit.",
        "Form into a sausage shape and wrap in a piece of buttered greaseproof paper with a folded pleat to allow for expansion. Roll in a double muslin cloth.",
        "Place the wrapped dough onto a steamer insert and place into a large saucepan of boiling water. Cover and steam for 1¾ hours.",
        "Serve in slices with a scoop of vanilla ice cream."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}