{
    "title": "Spring rolls",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Use the banana in this recipe as a sort of edible ‘glue stick’ to hold the spring roll sheets together. The lemongrass sweet chilli sauce that the spring rolls are served with is a handy dip to know how to make.",
    "author": {
        "jeremy_pang": "Jeremy Pang"
    },
    "show": {
        "p01k6r1s": "Nigel and Adam's Farm Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "1 pack spring roll wrappers (12-6 sheets needed, depending how big you wish to make the spring rolls)",
            "1 spring onion, finely sliced",
            "10 oyster mushrooms, finely sliced",
            "100g/3½oz bean sprouts",
            "½ carrot, cut into thin strips",
            "½ red pepper, cut into thin strips",
            "salt and black pepper, to taste",
            "1 banana",
            "vegetable oil, for deep-fat frying"
        ],
        "For the marinade": [
            "2 tbsp oyster sauce",
            "1 tbsp light soy sauce",
            "1 tbsp sweet chilli sauce",
            "1 tsp sesame oil"
        ],
        "For the lemongrass sweet chilli sauce": [
            "5 tbsp sweet chilli sauce",
            "2 stalks lemongrass, bashed and finely chopped",
            "2 garlic cloves, finely chopped",
            "1 birds’-eye chilli, finely chopped",
            "2 limes, juice only",
            "salt, to taste",
            "sugar, to taste"
        ]
    },
    "steps": [
        "Carefully separate each sheet of spring roll pastry.",
        "Once separated, cover the pile with cling film so as not to let it dry out.",
        "For the marinade, mix together all the marinade ingredients in a shallow dish.",
        "Mix all the remaining ingredients (except the banana and oil) with the marinade. Leave to marinate for at least five minutes, ideally longer.",
        "Cut the banana in half to use as an edible glue stick.",
        "Place some of the filling in the centre of each pastry. Fold the pastry over diagonally and ‘stick’ using the banana. Holding your fingertips over the roll, use your thumbs to roll the pastry slightly to enclose the filling. Fold in the sides and ‘stick’ again. Roll until fully closed and ‘stick’ again.",
        "Heat the vegetable oil in a pan or deep-fat fryer to 170C/340F (Caution: hot oil can be dangerous. Do not leave unattended.)",
        "Carefully place each spring roll into the hot oil – you will need to do this in batches so as not to overcrowd the pan. Once browned and cooked through, carefully remove using a slotted spoon and transfer to a plate lined with kitchen roll. Serve hot.",
        "For the lemongrass sweet chilli sauce, mix all of the ingredients well to combine. Serve the chilli sauce with the spring rolls in a small dipping bowl."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}