{
    "title": "Sprouts with chestnuts and pancetta",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "5",
    "images": [
        
    ],
    "description": "These spruced-up Brussels sprouts make a lovely alternative to the boiled or steamed varieties at Christmas.",
    "author": {
        "mary_berry": "Mary Berry"
    },
    "show": {
        "b04v6njn": "Mary Berry's Absolute Christmas Favourites"
    },
    "tips": [
        "The pancetta and chestnuts can be fried up to 6 hours ahead - fry them again for 1-2 minutes before adding the freshly cooked sprouts. Ensure that the sprouts are at room temperature when you add them to the pan - if they are added straight from the fridge, they take too long to heat through. This dish is best eaten freshly cooked, but leftovers can be stored in the fridge for one day."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "900g/2lb small Brussels sprouts",
            "50g/1¾oz butter",
            "200g/7oz thinly sliced pancetta, cut into small pieces",
            "1 onion, finely chopped",
            "225g/8oz frozen chestnuts, defrosted and halved",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Remove the outer leaves from the sprouts, trim the base of each one and cut in half from top to bottom, through the root. Cook the prepared sprouts in boiling salted water for 3-4 minutes, or until nearly tender. Drain and refresh in a bowl of cold water to retain their bright-green colour.",
        "Heat half of the butter in a large frying pan over a medium heat. When the butter is foaming, add the pancetta and fry for 3-4 minutes, or until crisp. Remove from the pan using a slotted spoon and set aside to drain on kitchen paper.",
        "Heat the remaining butter in the same pan. Add the onion and chestnuts and fry for 8-10 minutes, or until the onion has softened. Stir in the cooked pancetta.",
        "Drain the sprouts well, then stir them into the pancetta, chestnut and onion mixture. Season, to taste, with salt and freshly ground black pepper. Serve piping hot alongside roast turkey with all the trimmings."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}