{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Italian",
    "description": "I love to serve this along with plain, boiled Italian black rice, which I advise for its drama as well as its sauce-soaking capacity. But if you want to stretch the amounts below to feed more people, then cook a packet of spaghetti and toss the lemony chilli-flecked seafood through it, making sure you use a little pasta cooking water to help the sauce emulsify.",
    "dishes": [
        "bun",
        "pasta",
        "sauce",
        "seafood",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "3 tbsp olive oil",
            "1 red chilli, seeds removed and finely chopped",
            "1 unwaxed lemon, zest and juice only",
            "1 garlic clove",
            "small bunch parsley, leaves only, finely chopped",
            "2 tbsp finely chopped marjoram leaves",
            "350g/12oz prepared squid (defrosted if frozen), sliced into rings",
            "20 raw peeled king prawns (defrosted if frozen)",
            "1 tsp sea salt flakes or ½ tsp fine salt"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "13",
    "serves": "Serves 4",
    "show": {
        "b01n2y25": "Nigellissima"
    },
    "steps": [
        "Warm the oil in a wok or similarly wide, capacious pan, then add the chopped chilli (with seeds if you like it fiery) and lemon zest, turning them as they sizzle in the hot oil - this is a moment of fragrant joy.",
        "Now grate the garlic and add it, along with about a third of the chopped parsley and marjoram and give a quick stir, before tumbling in the prepared squid and prawns. Stir-fry in the pan for 2-3 minutes, or until the seafood is just cooked through.",
        "Add the juice of half the lemon and most of the remaining herbs and cook, stirring, for another 30 seconds or so. Taste to see if you need any salt or more lemon juice, before turning the seafood fritti out onto a warm platter and scattering it with the last remaining bits of chopped parsley and marjoram."
    ],
    "tips": [
        
    ],
    "title": "Squid and prawns with chilli and marjoram",
    "videos": "[p00zy4px:p00zy4qc]"
}