{
    "author": {
        "lawrence_keogh": "Lawrence Keogh"
    },
    "cookTime": "1 to 2 hours",
    "description": "‘Oranges and lemons rang the bells of St Clements’. We can’t sing the praises enough of this Christmassy citrus cake. Equipment and preparation: you will need 23cm/9in round springform cake tin and a clean sheet of muslin.",
    "dishes": [
        "cake",
        "jam",
        "oven-baked_dishes",
        "pie",
        "quenelle"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the cake": [
            "8 clementines",
            "250g/9oz ground almonds",
            "250g/9oz caster sugar",
            "1 level tsp baking powder",
            "1 lemon, zest only",
            "1 orange, zest only",
            "6 free-range eggs"
        ],
        "For the garnish": [
            "500ml/18fl oz crème fraîche or thick Greek yoghurt",
            "1 orange, zest only",
            "1 lemon, zest only",
            "small handful shelled chopped pistachios (optional)"
        ],
        "For the orange syrup glaze": [
            "700ml/1¼ pint orange juice (or clementine juice)",
            "400g/14oz sugar"
        ],
        "For the spiced mulled wine syrup": [
            "2 slices orange (about 90g/3¼oz)",
            "¼ cinnamon stick",
            "1 star anise",
            "3 cloves",
            "150g/5½oz sugar",
            "300ml/10fl oz red wine",
            "100g/3½oz cranberries (frozen or fresh)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 8",
    "show": {
        "b03lsr84": "Christmas Kitchen with James Martin"
    },
    "steps": [
        "Simmer the clementines in a large pan of water for an hour. Remove from the water and leave to cool. Chop the clementines and remove and discard any pips, then chop and purée using a food processor or blender to a pulp.",
        "Grease a 23cm/9in round springform cake tin, line the bottom with greaseproof paper and grease again.",
        "Preheat the oven to 160C/325F/Gas 3.",
        "Mix together all the dry ingredients including the zest in a mixing bowl.",
        "Add the eggs and mix until smooth. Add the orange pulp and mix again.",
        "Bake the cake for about 55 minutes, or until a wooden skewer pierced into the middle comes out clean.",
        "For the spiced mulled wine syrup, wrap the orange, cinnamon, star anise and cloves in a clean sheet of muslin. Put the sugar and wine into a pan with the muslin spices, bring to the boil and simmer for 10 minutes. Carefully remove the muslin.",
        "Add the cranberries to the syrup and cook until softened. Remove from the heat and leave to cool.",
        "For the orange syrup glaze, boil the orange juice and sugar in a pan to a thick syrup. Remove from the heat and leave to cool.",
        "Once the glaze is cool, spread it onto the baked cake.",
        "To serve, cut a wedge of the cake and place on a plate. Spoon on a quenelle of crème fraîche, sprinkle with both zests and some pistachios, if using. Spoon the mulled wine syrup around."
    ],
    "tips": [
        "Blending the clementines can be done a day ahead of making the rest of the recipe. This cake will keep well for at least three days and up to a week."
    ],
    "title": "St Clement’s cake with mulled wine syrup and cranberries",
    "videos": "[]"
}