{
    "title": "St George’s mushrooms with chicken liver pâté on toasted sourdough",
    "cookTime": "over 2 hours",
    "prepTime": "overnight",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "St George’s mushrooms get their name from the fact that they start appearing around St George’s Day on April 23nd. Combined with the flavour of wild garlic and garnished with garlic flowers, this posh mushroom and liver on toast gives a real taste of spring.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the chicken liver pâté": [
            "200g/7oz chicken livers",
            "milk (to soak the livers)",
            "150ml/5fl oz red wine",
            "1 banana shallot, sliced",
            "pinch thyme leaves",
            "200g/7oz butter",
            "1 garlic clove, sliced"
        ],
        "For the St George’s mushrooms": [
            "dash oil",
            "200g/7oz St George’s mushroom, halved",
            "50g/1¾oz butter",
            "4 tsp chicken stock",
            "1 tsp chopped parsley",
            "2-4 slices sourdough bread",
            "30g/1oz wild garlic leaves, picked and washed"
        ],
        "To serve": [
            "garlic flowers",
            "30g/1oz parmesan"
        ]
    },
    "steps": [
        "Put the chicken livers in a bowl and cover with milk. Leave in the fridge overnight. This will remove the bitterness.",
        "For the chicken liver pâté, cook the red wine with the shallot and thyme in a pan until the volume of liquid has reduced by half.",
        "Melt a knob of the butter in a hot pan and fry the livers until cooked but still slightly pink in the middle. Remove the livers and add the rest of the butter and the garlic to the same pan. Heat to melt.",
        "Add the red wine reduction, livers and melted butter to a food processor. Blend until smooth then transfer to a clean bowl. Chill in the fridge for at least eight hours, or until set.",
        "For the St George's mushrooms, add a little oil to a hot pan and fry the mushrooms face-side down to colour.",
        "Add the butter and the chicken stock. Cook until the chicken stock has reduced slightly and glazes the mushrooms. Add the chopped parsley.",
        "Heat a griddle pan until hot and toast the bread in the pan.",
        "Mix the garlic leaves into the mushrooms and cook for a minute until wilted, similar to spinach.",
        "Once the bread is toasted, spread the pâté onto it. Top with the mushrooms and garlic leaves.",
        "Garnish with wild garlic flowers and grated parmesan."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}