{
    "author": {
        "annabel_karmel": "Annabel Karmel"
    },
    "cookTime": "10 to 30 mins",
    "description": "Try baking these fun and easy Christmas biscuits with young children – and the young at heart.",
    "dishes": [
        "biscuit",
        "bread",
        "icing",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "kneading",
        "rubbing_in"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/stainedglasswindowbi_87505_16x9.jpg"
    ],
    "ingredients": {
        "For the biscuits": [
            "350g/12oz plain flour, plus extra for dusting",
            "1 tsp bicarbonate of soda",
            "½ tsp salt",
            "2 tsp ground ginger",
            "100g/3½oz butter",
            "175g/6oz soft brown sugar",
            "1 free-range egg, beaten",
            "4 tbsp golden syrup",
            "packet wrapped fruit-flavoured boiled sweets in different colours"
        ],
        "To decorate": [
            "tube ready-made white icing (available in the baking sections of most supermarkets) (optional)",
            "narrow ribbon"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "21",
    "serves": "Makes 25",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "For the biscuits, mix the flour, bicarbonate of soda, salt and ginger together in a bowl.",
        "Rub in the butter until the mixture resembles fine breadcrumbs, then stir in the sugar.",
        "In another bowl, beat together the egg and golden syrup, then pour this mixture into the flour mixture and mix to make a smooth dough, kneading lightly with your hands.",
        "Crush the sweets in their wrappers using a rolling pin.",
        "Roll the dough out on a floured work surface to about 0.5cm/¼in thick, then cut into shapes using a selection of Christmas-themed cookie cutters. Transfer the biscuits to baking sheets lined with baking paper.",
        "Cut out shapes in the centre of each biscuit, making sure you leave a good edge all around the biscuit. Completely fill the hole in each biscuit with crushed boiled sweets.",
        "Make a hole at the top of each biscuit using a drinking straw so that you will be able to thread a ribbon through it later. Bake the biscuits in the oven for 10-12 minutes, or until golden-brown.",
        "Remove the biscuits from the oven. While they're still warm, check that the holes are still there - if not, push a straw through again. Do not remove the biscuits from the baking tray until they have cooled because the boiled sweets need to harden. Once the sweets have hardened, gently lift the biscuits onto a wire rack with a palette knife to finish cooling.",
        "If you like, you can decorate the biscuits with piped white icing. Thread ribbons through the holes in the biscuits to make loops for hanging from the tree."
    ],
    "tips": [
        
    ],
    "title": "Stained glass window biscuits",
    "videos": "[]"
}