{
    "title": "Stained glass window biscuits",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Makes about 30 cookies",
    "recommendations": "2",
    "images": [
        
    ],
    "description": "These Christmas biscuits are perfect for hanging on the tree – the lights will twinkle through the ‘windows’, which are simply melted boiled sweets.",
    "author": {
        "donal_skehan": "Donal Skehan"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "150g/5½oz butter, softened",
            "100g/3½oz muscovado sugar",
            "1 large free-range egg",
            "250g/9oz plain flour, plus extra for flouring",
            "1 tsp baking powder",
            "pinch salt",
            "1 tbsp mixed spice",
            "1 tsp vanilla extract",
            "1 pack boiled coloured sweets"
        ]
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4 and line a baking tray with parchment paper.",
        "Using an electric hand whisk, whisk together the butter and sugar in a large bowl. Once lightened and creamy add the egg and mix thoroughly.",
        "Sift in the flour, baking powder, salt, and mixed spice and then add the vanilla extract and mix with a wooden spoon until you reach a biscuit dough consistency.",
        "Turn the dough onto a floured work surface and roll out to about 1cm/½in thick. Cut out biscuit shapes (such as stars or Christmas trees) and place onto the lined baking tray (you may need more than one tray, or to cook in batches).",
        "Using a smaller cutter or a small knife cut out the centre of each biscuit. Place a boiled sweet into the hole (cut in half if your hole is smaller than 2.5cm/1in) and place in the preheated oven to cook for 15 minutes, or until golden-brown and crisp with the sweet melted.",
        "As soon as the biscuits are baked and while they are still warm, use a straw to poke a hole out of the top of each biscuit. Be careful not to make this hole too near the edge of the biscuit. Once the melted sweets have hardened, transfer to a wire rack to cool. Thread a length of string, ribbon or florist’s wire through the hole and hang the biscuits on the Christmas tree so the lights can shine through the centres."
    ],
    "howTos": [
        
    ],
    "videos": "[p018t52n:p018t52r]"
}