{
    "author": {
        "deborah_reddihough": "Deborah Reddihough"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Sometimes only a steak will do, but they tend to be very fatty. Using lean fillet steak helps keep the calories down and serving it with baked onion rings, salad and sweet potato fries mean you're still getting a good amount of vegetables. Each serving provides 527 kcal, 38g protein, 50g carbohydrate (of which 12.5g sugars), 17.5g fat (of which 5.4g saturates), 8g fibre and 0.6g salt.",
    "dishes": [
        "bread",
        "chips",
        "oven-baked_dishes",
        "pie",
        "salad"
    ],
    "flags": [
        
    ],
    "howTos": [
        "how_to_cook_steak"
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/steak_sweet_potato_fries_67324_16x9.jpg"
    ],
    "ingredients": {
        "For the onion rings": [
            "6 large rings of brown onion",
            "1 tsp plain flour",
            "1 egg white, beaten until foamy",
            "3 tbsp fine breadcrumbs",
            "pinch smoked paprika, to taste"
        ],
        "For the steak": [
            "2 x 140g/5oz fillet steaks",
            "1 tsp oil"
        ],
        "For the sweet potato fries": [
            "400g/14oz sweet potatoes, scrubbed and sliced into thin chips",
            "1 tsp ground cumin",
            "a small pinch cayenne pepper, chilli powder or crushed dried chilli seeds – depending on what you have available",
            "2 tsp vegetable oil",
            "salt and pepper"
        ],
        "To serve": [
            "50g/1¾oz salad leaves (such as rocket or watercress)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        "b0725d98": "Food: Truth or Scare"
    },
    "steps": [
        "For the fries, preheat the oven to 220C/200C Fan/Gas 7. Put a large baking tray in the oven to warm. Cut a piece of baking paper ready to line the tray later.",
        "In a large bowl or food bag, toss the sweet potatoes with the spices, oil, salt and pepper until evenly coated.",
        "Remove the baking tray from the oven and line with the baking paper. Add the fries in one layer, with space between them (if you crowd them together they’ll be soggy). Bake for 15 minutes, opening the oven door after 5 minutes to allow any steam to escape.",
        "Meanwhile, make the onion rings. Put the onion rings in a food bag and add the flour. Shake to coat. Put the beaten egg white in a bowl and mix the breadcrumbs and paprika in another bowl. One by one, dip the onions in the egg white and then into the breadcrumbs (taking care to coat them well). Transfer to a baking tray and bake in one layer at the same temperature as the fries for 15-20 minutes.",
        "When the fries have been cooking for 15 minutes, turn them over and shake them around the tin to help them cook evenly. Return to the oven for another 10 minutes.",
        "Meanwhile, put a non-stick frying pan or griddle over a high heat. Rub the oil over the steaks and season with salt and pepper. Once the pan is very hot, add the steaks and cook on both sides for approximately 3 minutes, for medium. The exact time depends on the thickness of your steaks – refer to the video to see how to cook it to your liking. Rest for 5 minutes on warmed serving plates before serving.",
        "Arrange the salad leaves, fries and onion rings alongside the steaks. Serve immediately."
    ],
    "tips": [
        "The paprika in the onion rings adds a little spice and also a bit of colour, but they're fine without it, if it's not something you keep in the cupboard. To find out more about type 2 diabetes and get information on how to reduce your risk of this mostly preventable disease, read our iWonder guide."
    ],
    "title": "Steak, sweet potato fries and baked onion rings",
    "videos": "[]"
}