{
    "author": {
        "levi_roots": "Levi Roots"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Caribbean",
    "description": "",
    "dishes": [
        "pie",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        "folding"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the ackee and mushrooms": [
            "2 tbsp sunflower or groundnut oil",
            "½ onion, finely sliced",
            "½ red pepper, seeds removed, sliced into thin strips",
            "½ yellow pepper, seeds removed, sliced into thin strips",
            "½ green pepper, seeds removed, sliced into thin strips",
            "1 large ripe tomato, finely chopped",
            "250g/9oz button mushrooms, chopped",
            "125-150ml/4-5fl oz boiling water",
            "salt and freshly ground black pepper",
            "347g/¾lb canned ackee, drained (available from some supermarkets and Afro-Caribbean grocers)",
            "1 spring onion, trimmed, finely chopped"
        ],
        "For the steak": [
            "1½ tsp sunflower or groundnut oil",
            "8 x 125g/4½oz pieces fillet steak",
            "1 onion, finely sliced",
            "125g/4½oz sweet pepper, seeds removed, sliced into thin strips",
            "3 sprigs fresh thyme, leaves only",
            "1 garlic clove, finely chopped",
            "2 tsp dark soy sauce",
            "3 tsp tomato purée",
            "4 ripe tomatoes, roughly chopped",
            "300ml/½ pint boiling water",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 4",
    "show": {
        "b00mh31r": "Caribbean Food Made Easy"
    },
    "steps": [
        "For the ackee and mushrooms, heat the oil in a heavy-based pan over a medium heat. Add the sliced onion and peppers and fry for 4-5 minutes, or until softened, stirring regularly.",
        "Add the chopped tomato and continue to fry for 1-2 minutes, stirring occasionally, or until the tomatoes have started to break down.",
        "Add the mushrooms and continue to fry for 2-3 minutes, or until the liquid released by the mushrooms has evaporated.",
        "Add boiling water, as necessary, to loosen the sauce mixture, stirring until well combined in the mixture. Season, to taste, with salt and freshly ground black pepper.",
        "Add the ackee and carefully fold it into the sauce. Simmer for 2-3 minutes, or until heated through, then sprinkle over the spring onion. Remove from the heat and keep warm.",
        "For the steak, rub one teaspoon of the oil all over the pieces of fillet steak. Heat a heavy-based pan over a medium heat until hot, then add the steak pieces and fry for 1-2 minutes on each side (for medium-rare), or until cooked to your liking. Remove from the heat and set aside.",
        "Meanwhile, heat the remaining half a teaspoon of oil in a separate, heavy-based pan over a medium heat. Add the onion and sweet pepper and fry, stirring regularly, until softened.",
        "Add the remaining steak ingredients and continue to fry for 4-5 minutes, stirring regularly, until the vegetables are just cooked through. Season, to taste, with salt and freshly ground black pepper. (NB: Bear in mind that the soy sauce is quite salty.)",
        "Add the cooked steaks to the pan and cook until heated through.",
        "To serve, place two pieces of fillet steak onto each of four serving plates. Pour over the pepper and tomato sauce. Spoon the ackee and mushrooms alongside."
    ],
    "tips": [
        
    ],
    "title": "Steak, peppers and tomatoes with ackee and mushrooms",
    "videos": "[]"
}