{
    "title": "Steak sandwich and caramelised onions with Stillton butter and skinny chips",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the caramelised onions": [
            "1 tbsp olive oil",
            "½ onion, finely sliced",
            "salt and freshly ground black pepper",
            "pinch caster sugar",
            "2 tsp balsamic vinegar"
        ],
        "For the skinny chips": [
            "300ml/½ pint vegetable oil, for deep frying",
            "½ large potato",
            "sea salt"
        ],
        "For the steak sandwich and Stilton butter": [
            "100g/3½oz rump steak, sliced",
            "1 tsp olive oil, plus exxtra for drizzling",
            "125g/4½oz unsalted butter",
            "70g/2½oz Stilton, crumbled",
            "1 tbsp chopped fresh chives",
            "½ baguette, sliced in half lengthways",
            "tomato ketchup, to serve"
        ]
    },
    "steps": [
        "For the caramelised onions, heat the olive oil in a large frying pan, add the onions and fry over a gentle heat for five minutes. Add the sugar and balsamic vinegar and cook over a medium heat for two minutes, or until reduced and sticky.",
        "For the skinny chips, pour the vegetable oil into a large saucepan or deep fat fryer and heat until a small cube of bread turns golden in 30 seconds. (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
        "Slice the potato into matchsticks and pat dry with kitchen paper. Caerfully place the potato sticks into the hot oil and deep fry for 3-4 minutes, or until crisp and golden-brown. Remove with a slotted spoon, drain on kitchen paper and sprinkle with sea salt.",
        "For the steak sandwich, rub the sliced steak with olive oil, salt and freshly ground black pepper and griddle in a very hot griddle pan for 1-2 minutes. Remove from the pan and keep warm.",
        "For the Stilton butter, mix the butter, crumbled Stilton and salt and freshly ground black pepper together in a bowl.",
        "Drizzle the halved baguette with olive oil and griddle for 1-2 minutes on each side.",
        "To serve, place a griddled baguette half onto a plate. Top with the caramelised onions, then the steak and finally with the Stilton butter. Place the other half of the griddled baguette on top. Serve with lashings of tomato ketchup and the skinny fries alongside."
    ],
    "howTos": [
        "julienne"
    ],
    "videos": "[]"
}