{
    "title": "Steamed syrup sponge pudding",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "12",
    "images": [
        
    ],
    "description": "Try the Hairy Bikers’ recipe for a classic steamed syrup sponge, simple to make and guaranteed to impress.",
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "show": {
        "b00x84dj": "The Hairy Bikers: Mums Know Best"
    },
    "tips": [
        "Be really careful not to let the pan boil dry, but avoid removing the lid of the pan during the first 20 minutes of cooking time if you can, as this can create a flat, heavy sponge."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "175g/6oz butter, softened, plus extra for greasing",
            "100g/3½oz golden syrup",
            "125g/4½oz golden caster sugar",
            "1 lemon, zest only",
            "3 free-range eggs, lightly beaten",
            "175g/6oz self-raising flour"
        ],
        "To serve": [
            "4-5 tbsp golden syrup",
            "custard"
        ]
    },
    "steps": [
        "Generously butter the inside of a 1.2litre/2 pint pudding basin, and cut a circle about two times larger than the pudding basin diameter, of baking parchment and and aluminium foil",
        "Spoon 50g/2oz of the golden syrup into the base of the pudding basin and set aside.",
        "Beat the remaining 50g/2oz golden syrup, butter, sugar and lemon zest with an electric whisk until light and fluffy. Whisk in half of the eggs followed by half of the flour. Whisk in the remaining beaten eggs and flour. The mixture should be just a dropping consistency. (Add a splash of milk if the mixture is very thick.)",
        "Spoon the mixture into the pudding basin and smooth the surface.",
        "Pleat the baking parchment by folding over an inch of parchment in the centre. Repeat with the foil. This allows for expansion of the pudding as it cooks.",
        "Cover the basin with the circle of baking parchment, with the pleat in the centre of the pudding. Cover the parchment with the circle of aluminium foil, again with the pleat in the centre. Tie the pudding very tightly around the rim with string. Create a carrying handle by tying the excess string across the top of the basin and tying it under the string on the opposite side – this will help you lift the pudding out of the pan once it’s cooked. Trim any excess baking paper and aluminium foil, leaving a 2.5cm/1in border, and turn the edges in on themselves to seal.",
        "Put an upturned heatproof saucer or small trivet in a large, deep saucepan, and place the pudding basin on top. Add enough just-boiled water to the pan to come halfway up the sides of the basin. Cover the pan with a tight-fitting lid and place over a low heat. Allow to steam in the gently simmering water for 1¾ hours, adding more water to the pan if necessary. (Make sure the pan does not boil dry.)",
        "The pudding is done when a skewer inserted into the centre of the pudding (through the aluminium foil and baking paper) comes out clean. When done, turn off the heat and carefully lift the basin from the water. Leave to stand for 5 minutes.",
        "Cut the string from the basin and discard the aluminium foil and paper. Run a cutlery knife around the edge of the pudding to loosen the sides, carefully invert onto a deep plate and remove the basin.",
        "To serve, spoon the extra syrup over the pudding, cut into generous wedges and serve with custard."
    ],
    "howTos": [
        "steaming_puddings",
        "sealing_steamed_puddings"
    ],
    "videos": "[]"
}