{
    "title": "Steamed trout cooked in a bag with white wine and leek sauce",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "1",
    "images": [
        
    ],
    "description": "",
    "author": {
        "lesley_waters": "Lesley Waters"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the trout": [
            "1½ tbsp butter",
            "50g/1¾oz mangetout",
            "2 baby leeks, chopped",
            "1 purple carrot, cut into ribbons",
            "handful fresh parsley, basil and chives, chopped",
            "150g/5½oz trout fillet, cut into two pieces",
            "1 tbsp white wine",
            "salt and freshly ground black pepper"
        ],
        "For the leek and white wine sauce": [
            "1 tbsp olive oil",
            "2 baby leeks, finely chopped",
            "2 tbsp double cream",
            "2 tsp grainy mustard",
            "1 tbsp white wine"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/425F/Gas 7.",
        "Cut a 20cm/8in circle of baking paper, fold in half and place onto a baking sheet.",
        "Heat 1 tbsp butter in a frying pan over a medium heat until melted, then add the mangetout, baby leeks and carrot and fry for 3-5 minutes, or until slightly softened. Stir in the herbs and remove from the heat.",
        "Pour the sautéed vegetables onto one half of the prepared baking paper circle, place the trout fillet on top and begin folding the edges of the circle inwards to seal. Before sealing the paper completely, add the white wine and the remaining butter and season well with salt and freshly ground black pepper.",
        "Transfer the baking sheet to the oven and cook for ten minutes or until completely cooked through.",
        "For the sauce, heat the oil in a frying pan over a medium heat, add the leeks and sauté for 3-4 minutes, or until softened. Stir in the double cream, mustard and white wine and simmer for another minute.",
        "To serve, place the fish parcel onto a plate and open it out, transferring the contents to the plate, along with the sauce."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}