{
    "title": "Steamed liquorice sponges",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/steamed_liquorice_00574_16x9.jpg"
    ],
    "description": "With these light and fluffy puddings, I was aiming to create a dish informed by some of the sweet-shop flavours of my childhood. Liquorice was the perfect choice – it has a lovely fruity tang that carries beautifully through the sponge. If you think you don’t like liquorice, think again... Equipment and preparation: you will need four dariole moulds or individual pudding basins, about 175ml/6fl oz capacity.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b03hcv64": "Paul Hollywood's Pies & Puds"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "4 liquorice spirals or Pontefract cakes",
            "100g/3½oz unsalted butter, softened, plus extra for greasing",
            "100g/3½oz caster sugar",
            "3 free-range eggs",
            "100g/3½oz self-raising flour",
            "1 tsp baking powder",
            "1 tsp liquorice extract"
        ]
    },
    "steps": [
        "Butter four dariole moulds or individual pudding basins, about 175ml/6fl oz capacity, and line the base of each with a disc of baking parchment.",
        "Place a liquorice spiral or Pontefract cake in the base of each prepared mould. Put all the remaining ingredients in a large bowl and beat together using an electric whisk. Start off slowly then increase the speed and mix for two minutes, or until all the ingredients are well combined.",
        "Divide the mixture between the moulds. Tap each mould on the work surface to remove any air pockets and level out the mixture.",
        "Create a lid for each pudding by placing a small piece of baking parchment over a small piece of foil and making a pleat in the middle, folding both sheets together (to allow for the puddings’ expansion as they cook). Put the lids on top of the puddings, foil side up, and secure with string.",
        "Stand the moulds in a steamer. Alternatively, put them in a large saucepan and pour in enough boiling water to come halfway up the sides of the moulds. Put the lid on the pan and bring to a simmer. Either way, steam the puddings for 45 minutes.",
        "Uncover the puddings and run the tip of a small, sharp knife around the edge of each, to help release them. Invert them onto warmed plates and serve straight away, with custard."
    ],
    "howTos": [
        "steaming_puddings",
        "sealing_steamed_puddings"
    ],
    "videos": "[]"
}