{
    "author": {
        "paul_rankin": "Paul Rankin"
    },
    "cookTime": "less than 10 mins",
    "description": "",
    "dishes": [
        "pie",
        "sauce",
        "toffee"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the hot chocolate sauce": [
            "55g/2oz dark chocolate, melted",
            "125ml/4fl oz double cream",
            "2 tbsp honey"
        ],
        "For the hot toffee sauce": [
            "2 tbsp butter",
            "4 tbsp soft brown sugar",
            "200ml/7fl oz double cream",
            "½ orange, zest and juice"
        ],
        "For the steamed ginger pudding": [
            "200g/7oz butter, softened, plus extra for greasing",
            "200g/7oz self-raising flour",
            "1 tbsp ginger syrup (from a jar of stem ginger)",
            "2 free-range eggs, beaten",
            "2 tbsp caster sugar",
            "4 pieces stem ginger from a jar, chopped"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Makes 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "For the steamed pudding, place the butter, self-raising flour, ginger syrup, eggs and sugar into a food processor and blend until smooth. Fold half of the chopped stem ginger into the pudding batter and set aside.",
        "Grease a small glass bowl, then spoon a little ginger syrup into the base. Add the remaining chopped stem ginger, then spoon the pudding batter on top.",
        "Smooth down the surface with a palatte knife, cover with cling film and cook in the microwave at its highest setting for 4½ minutes, or until risen and cooked through. Remove the cling film and turn the pudding out onto a serving plate.",
        "For the chocolate sauce, place the melted chocolate, cream and honey in a bowl and mix until smooth. Pour over the steamed pudding.",
        "For the hot toffee sauce, place the butter, sugar, double cream, orange zest and juice into a pan over a low heat and cook until melted and combined to a smooth sauce.",
        "To serve, pour the toffee sauce over the pudding and serve."
    ],
    "tips": [
        
    ],
    "title": "Stem ginger steamed pudding with hot chocolate and toffee sauce",
    "videos": "[]"
}