{
    "title": "Sticky toffee pudding",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 6 puddings",
    "recommendations": "4",
    "images": [
        
    ],
    "description": "A moist, luscious sponge and a rum-spiced sauce make this sticky toffee pudding extra naughty.",
    "author": {
        "brendan_lynch": "Brendan Lynch"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the pudding": [
            "175g/6oz soft butter, plus extra for greasing",
            "175g/6oz medjool dates, stoned and chopped roughly",
            "300ml/10fl oz boiling water",
            "½ tsp bicarbonate of soda",
            "175g/6oz dark muscovado sugar",
            "2 free-range eggs",
            "175g/6oz self-raising flour",
            "1 tsp baking powder"
        ],
        "For the toffee sauce": [
            "100g/3½oz caster sugar",
            "100g/3½oz unsalted butter",
            "1 tbsp dark rum",
            "2 tbsp ginger syrup (available online)",
            "100ml/3½fl oz double cream"
        ]
    },
    "steps": [
        "For the pudding, preheat the oven to 180C/350F/Gas 4 and grease six ramekins with butter.",
        "In a bowl, cover the dates with the boiling water. Add the bicarbonate of soda, stir until dissolved and set aside to cool.",
        "In a clean bowl beat the butter and sugar until pale and fluffy. Gradually add the eggs and mix in well. Add the sifted flour and baking powder in batches and mix thoroughly.",
        "Add the warm dates and their liquid and mix until combined. You should now have a wet batter that can be spooned into the ramekins (do not fill more than two thirds full).",
        "Place the ramekins on a baking tray and bake in the centre of the oven for approximately 15 minutes, or until they are risen and firm to touch.",
        "To make toffee sauce, in a pan gently heat all the ingredients except the cream. When the butter has melted whisk in the cream.",
        "To serve, turn out the puddings onto serving plates and pour the toffee sauce into serving containers or drizzle over the puddings."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}