{
    "author": {
        "lorraine_pascale": "Lorraine Pascale"
    },
    "cookTime": "over 2 hours",
    "description": "Perfect summer’s day picnic food. Bake a whole joint and, once it’s cool, wrap up in foil and put the glaze in a jar. Pack it into the hamper along with crusty bread and other snacks.",
    "dishes": [
        "bread",
        "ham",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "soup"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the sticky glaze": [
            "2 garlic gloves, crushed",
            "½ orange, finely grated zest and juice",
            "220g/7½oz honey",
            "340g/12oz soft light brown sugar",
            "1 red chilli, seeds removed, finely chopped (optional)",
            "1 tsp Chinese five-spice powder",
            "100ml/3½fl oz soy sauce",
            "salt and freshly ground black pepper"
        ],
        "default": [
            "2.5kg/5½lb cured gammon joint or ham joint, off the bone, soaked overnight in cold water",
            "small handful black peppercorns",
            "2 bay leaves",
            "1cm/½in piece fresh ginger, finely grated",
            "1 star anise",
            "large handful cloves"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "36",
    "serves": "Serves 10 or more",
    "show": {
        "b00xnbkv": "Baking Made Easy"
    },
    "steps": [
        "Drain the gammon joint and weigh it to calculate the cooking time.",
        "Place in a clean pan and cover completely with water. Add the peppercorns, bay leaves, ginger, star anise and half of the cloves. Bring to the boil, then reduce the heat to a simmer. Cook the joint for 25 minutes per 450g/1lb. (A 2.5kg joint will take 2 hours 20 minutes.)",
        "Thirty minutes before the joint is ready, preheat the oven to 220C/425F/Gas 7. Mix all of the glaze ingredients in a small pan and heat gently until the sugar is dissolved, then simmer for 25 minutes, or until the glaze is reduced and thickened.",
        "Remove the joint from the water and pat dry with kitchen paper. (Keep the cooking liquid to make a delicious soup.) Remove the thick layer of skin, but not the fat, from the joint. (This can be quite fiddly and often comes off in bits rather than in one large piece.) Use a small, sharp knife to score the meat diagonally, then change direction and score the other way to form diamonds. Stick the remaining cloves into the holes where the lines cross, then pour the glaze over the meat.",
        "Put the joint in the oven and cook for 20–30 minutes, or until the top begins to brown. It can catch easily at this point because of the honey, so keep a close eye on it! Once the joint is cooked, remove from the oven and cover loosely with baking paper to allow it to ‘rest’. This evens out the temperature and makes the meat more juicy."
    ],
    "tips": [
        "If you’re short on time, cook the joint in a large pan of water for 40 minutes to get rid of any excess salt. Remove from the pan and discard the salted liquid."
    ],
    "title": "Sticky glazed Asian ham",
    "videos": "[]"
}