{
    "title": "Sticky jerk wings with sugared oranges",
    "cookTime": "over 2 hours",
    "prepTime": "1-2 hours",
    "serves": "Serves 4",
    "recommendations": "1",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/stickyjerkwingswiths_91690_16x9.jpg"
    ],
    "description": "Sweetness counteracts the hot kick of jerk spices in these sticky fruity chicken wings - brilliant finger food!",
    "author": {
        "levi_roots": "Levi Roots"
    },
    "show": {
        "b00mh31r": "Caribbean Food Made Easy"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the jerk marinade": [
            "4 spring onions, green part only, chopped",
            "1 Scotch bonnet chilli, chopped",
            "3cm/1¼in piece root ginger, chopped",
            "2 tbsp fresh thyme leaves",
            "100ml/3½fl oz cider vinegar",
            "3 tbsp clear honey",
            "2 tsp ground allspice",
            "1 tsp ground cinnamon",
            "2 tbsp olive oil",
            "salt and freshly ground black pepper"
        ],
        "For the chicken wings": [
            "12 chicken wings",
            "4 long, mild red chillies, left whole"
        ],
        "For the sugared oranges": [
            "2 tbsp soft light brown sugar",
            "2 seedless oranges, cut into quarters"
        ]
    },
    "steps": [
        "For the jerk marinade, blend all of the jerk marinade ingredients in a food processor until they form a smooth paste.",
        "For the chicken wings, place the chicken wings into an ovenproof dish and pour over the jerk marinade, turning the wings to coat them in the marinade. Cover the dish and chill in the fridge for at least four hours, or ideally overnight, turning the wings over every 2-3 hours.",
        "Half an hour before you want to eat, light the barbecue. (Alternatively, preheat the grill to 190C/375F/Gas 5.) When the flames have died down and the coals have turned ash-white, place the wings onto the grill and cook for 12-15 minutes, turning them over every so often and basting with the remaining jerk marinade, until the wings are golden-brown all over and are completely cooked through (the chicken wings are cooked through when the juices run clear when pierced in the thickest part using a skewer).",
        "Meanwhile, place the whole chillies onto the grill. Barbecue for 3-4 minutes, turning occasionally, or until golden-brown grill marks appear on all sides. Remove from the grill and keep warm.",
        "Meanwhile, for the sugared oranges, sprinkle the sugar onto a plate. Dredge the cut sides of each orange quarter in the sugar, then place the orange quarters, cut-sides down, onto the grill. Grill for 3-4 minutes, or until the sugar melts and turns golden-brown.",
        "To serve, place three jerk chicken wings onto each of four serving plates. Place two sugared orange quarters and one grilled chilli alongside each serving of chicken wings."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}