{
    "author": {
        "jun_tanaka": "Jun Tanaka"
    },
    "cookTime": "1 to 2 hours",
    "description": "Use up slightly stale brioche with this luscious bread and butter pudding with layers of toffee sauce.",
    "dishes": [
        "bread",
        "bread_and_butter_pudding",
        "brioche",
        "caramel",
        "custard",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries",
        "toffee"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the toffee sauce": [
            "100g/3½oz sugar",
            "100g/3½oz butter",
            "250g/9oz double cream"
        ],
        "default": [
            "500ml/18fl oz double cream",
            "500ml/18fl oz milk",
            "6 free-range eggs",
            "4 free-range egg yolks",
            "200g/7oz caster sugar",
            "2 loaves brioche, crusts removed, sliced into squares",
            "good-quality ice cream, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b01rycym": "Chefs: Put Your Menu Where Your Mouth Is"
    },
    "steps": [
        "Preheat the oven to 100C/225F/ Gas ¼.",
        "Heat the cream and milk in a saucepan until hot, but not boiling.",
        "Whisk together the eggs and egg yolks with the sugar in a mixing bowl.",
        "Slowly pour the heated milk and cream into the beaten egg mixture, whisking continuously. Set aside.",
        "For the toffee sauce, melt the sugar in a pan over a medium heat and cook until it goes a caramel brown.",
        "Stir in the butter and cream (it will bubble furiously, so be careful as you stir) and stir continuously until smooth and completely incorporated.",
        "Coat the bottom of a greaseproof dish with a third of the caramel sauce.",
        "Top with a layer of the brioche slices and then pour over a third of the custard ensuring it fully coats all the brioche pieces. Repeat the process until you have three layers.",
        "Bake in the oven for one and a half hours or until golden-brown and set.",
        "Serve the pudding with a good-quality ice cream."
    ],
    "tips": [
        
    ],
    "title": "Sticky toffee brioche pudding",
    "videos": "[]"
}