{
    "author": {
        
    },
    "cookTime": "10 to 30 mins",
    "description": "This is great for kids to make and suitable for egg and dairy allergies. Do make sure your dairy alternatives are suitable for baking.",
    "dishes": [
        "cake",
        "oven-baked_dishes",
        "prepare-ahead_desserts",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "testing_to_see_if_a_cake_is_cooked"
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "vegetable oil for greasing",
            "4 tbsp rice or soya milk",
            "1 tsp bicarbonate of soda",
            "100g self-raising flour",
            "1 tbsp cocoa powder",
            "4 tbsp caster sugar",
            "25g soya-based non-dairy spread",
            "2 tbsp runny honey",
            "6 –10 mandarin segments, fresh or tinned (well drained)"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 2",
    "show": {
        
    },
    "steps": [
        "Before cooking, wash your hands and put an apron on. Weigh or measure all the ingredients. Prepare a 500g loaf tin by brushing the inside with some vegetable oil. Ask a grown-up to preheat the oven to 190C/375F/Gas 5.",
        "Pour the rice or soya milk into a cup and stir in the bicarbonate of soda.",
        "In a bowl, stir the flour and the cocoa together- this is the ‘dry’ bowl.",
        "In another bowl, beat together the sugar, the spread and the runny honey until it’s light and fluffy – this is the ‘wet’ bowl.",
        "Stir the milky mixture again. Now add some of the dry mix to the wet bowl and then add some of the milky mixture to this. Repeat until all the ingredients are in the wet bowl. Now mix together using a wooden spoon until smooth.",
        "Arrange half of the mandarins on the bottom of the loaf tin. Pour the cake batter in on top of the fruit and arrange the rest on the top. Put the loaf tin onto a baking tray.",
        "Ask a grown-up to put it in the oven for 25-30 minutes until the cake springs back from a touch. When the sticky chocolate cake has cooled, you can eat it! Serve with more sliced mandarins."
    ],
    "tips": [
        
    ],
    "title": "Sticky chocolate cake",
    "videos": "[]"
}