{
    "author": {
        "phil_vickery": "Phil Vickery"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bread",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Stilton-crusted steak": [
            "1 x 200g/7oz sirloin steak",
            "salt and freshly ground black pepper",
            "100g/3½oz fresh breadcrumbs",
            "100g/3½oz Stilton",
            "1 free-range egg white",
            "small handful fresh flatleaf parsley, leaves only",
            "1 tbsp olive oil"
        ],
        "For the butternut squash and red pepper": [
            "1 tbsp olive oil",
            "85g/3oz butternut squash, peeled and cut into cubes",
            "½ red pepper, chopped",
            "salt and freshly ground black pepper"
        ],
        "For the red wine sauce": [
            "1 tbsp olive oil",
            "½ onion, chopped",
            "1 garlic clove, chopped",
            "½ red pepper, seeds removed and chopped",
            "1 Portobello mushroom, chopped",
            "6 tbsp red wine",
            "salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 1",
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "steps": [
        "Preheat the grill to medium.",
        "For the Stilton-crusted steak, season the steak on both sides with salt and freshly ground black pepper.",
        "Place the breadcrumbs, Stilton, egg white and parsley into a food processor, season with salt and freshly ground black pepper and pulse to combine.",
        "Heat the oil in a non-stick frying pan and fry the steak for 2-3 minutes on each side.",
        "Remove the pan from the heat and spread the crust mixture on top of the steak. Transfer to the grill and cook until the crust is golden-brown and the steak is cooked to your liking. Set aside to rest in a warm place.",
        "For the red wine sauce, heat the oil in a pan over a medium heat, add the onion and fry until soft.",
        "Add the garlic, red pepper and mushroom and fry for 2-3 minutes.",
        "Add the wine and simmer until reduced by half. Season, to taste, with salt and freshly ground black pepper.",
        "For the butternut squash and red pepper, heat the oil in a frying pan over a medium heat and fry the butternut squash for 6-8 minutes, or until beginning to soften. Add the red pepper and cook for a further 2-3 minutes, until tender. Season, to taste, with salt and freshly ground black pepper.",
        "To serve, cut the steak into slices and place onto a serving plate with the butternut squash and red pepper. Pour over the red wine sauce."
    ],
    "tips": [
        
    ],
    "title": "Stilton-crusted steak with red wine sauce, butternut squash and red pepper",
    "videos": "[]"
}