{
    "author": {
        "merrilees_parker": "Merrilees Parker"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "bagel",
        "crumble",
        "jelly",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        "chopping_vegetables"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the bagel crisps": [
            "1 packet mini bagels",
            "about 6 tbsp extra virgin olive oil",
            "poppy seeds",
            "fine sea-salt and freshly ground black pepper"
        ],
        "default": [
            "150g/5¼oz unsalted butter",
            "100g/3½oz filo pastry",
            "350g/12¼oz Stilton cheese",
            "200g/7¼oz dried figs",
            "1 jar of cranberry jelly"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Makes 20",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Pre-heat the oven to 200C/400F/Gas 6.",
        "Melt the butter in a saucepan.",
        "Take the filo out of the packet and unroll. Lay it under a clean damp tea towel on a clean work surface.",
        "Cut the Stilton into cubes (don't worry if it crumbles) and very finely slice the figs. Place each lot of ingredients into separate bowls.",
        "Next take a slice of filo and put it onto a chopping board horizontally. Brush all over with melted butter, then cut into half horizontally, then cut into half again the same way then repeat until you have eight long strips.",
        "Take one strip and put a piece or Stilton the size of dice at the top. Add a slice of fig or a little cranberry jelly. Roll up trying to keep as even a shape as possible. Next take another strip and repeat covering the open sides and forming a pillow shape.",
        "Gently pinch together any gaps so the cheese doesn't seep out when cooked.",
        "Place on a parchment lined baking tray. Repeat with the remaining ingredients and brush all over with any remaining melted butter and season with plenty of freshly ground black pepper. These can be frozen like this or kept in the fridge for up to three days.",
        "For the bagel crisps, slice the bagels as thinly as you can then place about a third of them in a large bowl. If you are using mini bagels they cut into even horizontal discs. If using large ones cut vertically into slices. Drizzle about two tablespoons of olive oil around the edges of the bowl. Toss the slices really well, making sure they are really well coated in the oil.",
        "Season well with fine sea salt, freshly ground black pepper and a sprinkling of poppy seeds.",
        "Place on a baking sheet, ensuring that they are not overlapping. Bake for 8-10 minutes until golden brown and crispy. Allow to cool on a cooling rack. Repeat with the remaining ingredients.",
        "To cook the Stilton and fig pillows place them in the oven and cook for 10-12 minutes or until they are golden brown. If cooking from frozen allow a couple of extra minutes. Serve immediately."
    ],
    "tips": [
        
    ],
    "title": "Stilton and fig pillows with bagel crisps",
    "videos": "[]"
}