{
    "title": "Stir-fried bitter melon with black bean sauce",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This recipe is one of my favourites, partly because it brings back childhood memories of the fragrance of black bean sauce mixed with garlic that often greeted me at the door. So it was natural for me to cook this dish for my family in Kaiping, and I was thrilled that they loved it.",
    "author": {
        "ken_hom": "Ken Hom"
    },
    "show": {
        "b01lybfj": "Exploring China: A Culinary Adventure"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "700g/1½lb bitter melon, halved lengthways and de-seeded",
            "1 tbsp groundnut or vegetable oil",
            "100g/4oz fresh mild red chillies, halved, de-seeded and finely sliced",
            "1 tbsp finely chopped fresh ginger",
            "2 tbsp finely chopped garlic",
            "2 tbsp finely chopped shallots",
            "2 tbsp finely chopped spring onions",
            "3 tbsp black beans, coarsely chopped",
            "2 tsp sugar",
            "2 tbsp Shaoxing rice wine (or dry sherry)",
            "150ml/5fl oz chicken stock or water"
        ],
        "For the garnish": [
            "1 tbsp sesame oil"
        ]
    },
    "steps": [
        "Cut the melon into fine slices and blanch in a pot of boiling water for two minutes. Remove with a slotted spoon and drain well on kitchen paper.",
        "Heat a wok or large frying pan over high heat until it is hot. Add the oil, and when it is hot and slightly smoking, add the chillies, ginger, garlic, shallots, spring onions and black beans and stir-fry for two minutes. Then add the bitter melon, sugar and rice wine (or sherry) and stock. Bring the mixture to the boil, then reduce the heat to medium.",
        "Cover the wok or pan and simmer for eight minutes, or until the melon is cooked and tender. Drizzle in the sesame oil, turn onto a dish and serve at once."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}