{
    "author": {
        "paul_merrett": "Paul Merrett"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "pie",
        "prepare-ahead_desserts",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "3 portions from 1 x 375g/13oz packet dried egg noodles",
            "3 shiitake mushrooms",
            "½ red pepper",
            "½ yellow pepper",
            "½ courgette",
            "1 carrot",
            "12 mangetout",
            "4 baby sweetcorn",
            "1 spring onion",
            "2 garlic cloves",
            "4cm/1½in piece fresh ginger",
            "3 tbsp vegetable oil",
            "2 tbsp light soy sauce",
            "1 tbsp ketjap manis (a sweetish soy sauce, available in some supermarkets and in Asian grocers)",
            "handful fresh coriander, chopped, to garnish"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 2",
    "show": {
        
    },
    "steps": [
        "Heat a pan of water until boiling. Add the three portions of noodles and cook for about four minutes, or according to packet instructions. Loosen the noodles with a fork while they cook to stop them from sticking together. Drain and refresh in a bowl of iced water, then drain again.",
        "Prepare all the vegetables. Slice the shiitake mushrooms and the red and yellow peppers into thin strips.",
        "Cut the courgette and the carrot into batons. Cut the mangetout and the baby sweetcorn into thin strips. Slice the spring onion on the diagonal.",
        "Finely chop the garlic. Peel and finely chop the ginger.",
        "Heat a wok until almost smoking. Add two tablespoons of the oil and the drained noodles and stir-fry for a few minutes. Allow the noodles to brown slightly (this will create a smoky flavour). When browned, remove the noodles from the wok and set aside.",
        "Stir fry the prepared vegetables in the wok. Add the mushrooms first, followed by the peppers, carrots and baby sweetcorn. Stir well and keep the vegetables moving. Add the courgettes and the mangetout and continue stirring.",
        "Once all of the vegetables are cooked, add the remaining tablespoon of oil. Return the noodles to the wok and stir fry for a minute. Add the spring onions, garlic and ginger and fry for another minute.",
        "Add the soy sauce and ketjap manis to the wok and stir until well combined.",
        "Sprinkle the chopped coriander over the noodles and serve immediately."
    ],
    "tips": [
        
    ],
    "title": "Stir-fried noodles",
    "videos": "[]"
}