{
    "title": "Stir-fried pork with ginger and soy sauce",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "13",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/stir_fried_pork_with_85173_16x9.jpg"
    ],
    "description": "This low-calorie, stir-fried pork is quick and easy while still delivering on flavour, and helping you on your way to getting five a day. As part of an Intermittent diet plan, 1 serving provides: Your daily salty food 3 of your 5 daily vegetable portions This meal provides 250 kcal per portion.",
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "250g/9oz pork tenderloin, all visible fat removed, cut into chunks",
            "1 tsp cornflour",
            "2 tbsp dark soy sauce",
            "low-calorie cooking spray",
            "150g/5½oz button mushrooms, sliced",
            "2 red peppers, deseeded and sliced",
            "75g/2½oz mangetout, trimmed",
            "15g/½oz fresh root ginger, cut into thin matchsticks",
            "1 garlic clove, thinly sliced",
            "4 spring onions, cut into short lengths",
            "freshly ground black pepper"
        ]
    },
    "steps": [
        "Season the pork with pepper. Mix the cornflour with two tablespoons of cold water until smooth, then stir in the soy sauce.",
        "Spray a large wok, or deep frying pan, with cooking spray and place over a high heat. Stir-fry the pork for 1-2 minutes, or until lightly browned but not cooked through. Transfer to a plate.",
        "Return the pan to the heat, reduce the heat a little and spray with more oil. Stir-fry the mushrooms and pepper for 2 minutes. Add the mangetout and cook for a minute. Add the ginger, garlic and spring onions and stir-fry for a few seconds.",
        "Return the pork to the pan and pour over the soy sauce mixture. Cook for 1-2 minutes, or until the sauce has thickened and the pork is cooked through. Serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}