{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "",
    "dishes": [
        "icing",
        "jam",
        "millefeuille",
        "oven-baked_dishes",
        "pastry",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "whisking_egg_whites"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the millefeuille": [
            "500g/1lb 2oz ready-made puff pastry",
            "5 tbsp icing sugar",
            "300ml/11fl oz double cream",
            "½ tsp vanilla extract",
            "1 tbsp caster sugar"
        ],
        "For the strawberry sauce": [
            "500g/1lb 2oz strawberries, hulled",
            "1 lemon, juice only",
            "1-2 tbsp icing sugar, to taste"
        ],
        "To serve": [
            "400g/14oz strawberries, hulled and sliced",
            "1 tbsp icing sugar, to dust"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "For the millefeuille, roll the pastry out to 5mm/¼in thick. Cut into nine rectangles approximately twice as long as they are wide and place onto a non-stick baking sheet. Dust with the icing sugar and place in the oven for 15 minutes, or until glazed, golden-brown and well risen. Remove from the oven and allow to cool.",
        "Place the double cream into a bowl and whisk until soft peaks form when the whisk is removed. Add the vanilla extract and caster sugar and whisk gently until stiff peaks form when the whisk is removed.",
        "For the sauce, place the strawberries and lemon juice into a blender and blend until smooth. Stir in the sugar, to taste. Pass the mixture through a fine sieve into a bowl.",
        "To serve, carefully cut each piece of pastry in half through the middle to make two thin pieces. Place one piece in the centre of each plate and top with some of the cream mixture. Lay some of the sliced strawberries on top of the cream, then top with a second piece of pastry. Repeat the process with the remaining cream and strawberries and top each with the final glazed piece of pastry. Dust with icing sugar and spoon over the strawberry sauce."
    ],
    "tips": [
        
    ],
    "title": "Strawberry millefeuille with strawberry sauce",
    "videos": "[]"
}