{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "less than 10 mins",
    "cusine": "American",
    "description": "This delectable cheesecake uses seasonal strawberries and a fancy but easy decoration technique.",
    "dishes": [
        "cake",
        "cheesecake",
        "jam",
        "pie",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "200g/7oz white chocolate, broken into pieces",
            "750g/1½lb strawberries, hulls removed, cut in half",
            "100g/3½oz caster sugar",
            "2 gelatine leaves, soaked in cold water",
            "1 large ready-made sponge flan case",
            "2-3 tbsp fruit liqueur, brandy or whisky",
            "200g/7oz full-fat cream cheese",
            "200ml/7fl oz crème fraîche",
            "325ml/11fl oz double cream",
            "1 vanilla pod, split in half lengthways, seeds scraped out"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "1",
    "serves": "Serves 6-8",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "Line a baking tray with baking parchment.",
        "Bring a little water to a simmer in a pan. Suspend a heatproof bowl over the water (do not allow the base of the bowl to touch the water). Add the white chocolate and melt, then pour it onto the prepared baking tray, tipping the tray until the white chocolate covers the baking tray in a thin layer. Freeze for 10-20 minutes, or until totally frozen.",
        "Add 300g/10½oz of the strawberries, 25g/1oz of the caster sugar and 75ml/3fl oz water to a saucepan. Bring to a boil, stirring to help the sugar dissolve. Reduce the heat until the mixture is simmering, then simmer for 3-4 minutes.",
        "Strain the strawberry mixture through a fine sieve into a bowl, pushing the strawberries through the sieve using the back of a wooden spoon. Drain the gelatine leaves and add to the mixture, stirring until they have completely dissolved. Set aside to cool to room temperature (this mixture will be used as a glaze just before serving).",
        "Use the ring from a 20-25cm/8-10in springform cake tin as a guide to cut out the centre of the flan case, then cut the sponge disc in half horizontally using a sharp knife, to produce two thinner discs. Place one of the sponge discs onto the base of the springform cake tin and clip the ring around it. Drizzle the fruit liqueur all over the sponge.",
        "In a bowl, whisk the cream cheese, crème fraîche and double cream with the remaining sugar and the vanilla seeds until well combined. Spoon the mixture on top of the sponge base, pushing it all the way to the edges and smoothing the top with a palette knife.",
        "Decorate the top of the cheesecake with the remaining strawberry halves, then drizzle over the strawberry glaze. Chill in the fridge until needed.",
        "To serve, remove the springform cake ring from the sides of the cheesecake (to do this neatly, heat the sides very briefly using a chefs’ blow torch). Break the frozen white chocolate into shards and press these around the sides of the cheesecake until totally covered. Serve immediately."
    ],
    "tips": [
        "This recipe only uses half of the sponge flan case; the remaining half can be frozen or blended to crumbs for use in another recipe."
    ],
    "title": "Strawberry and white chocolate cheesecake",
    "videos": "[p02ffrzw:p02ffs00]"
}