{
    "title": "Strawberry cream-filled meringues",
    "cookTime": "over 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4-6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "james_martin": "James Martin"
    },
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the meringue": [
            "4 free-range egg whites",
            "200g/7oz caster sugar"
        ],
        "For the strawberry cream": [
            "750g/1lb 11oz strawberries, hulls removed",
            "500ml/17½fl oz double cream",
            "3-4 tbsp icing sugar, to taste"
        ]
    },
    "steps": [
        "Preheat the oven to 130C/275F/Gas ½.",
        "For the meringue, whisk the egg whites in a clean bowl until soft peaks form when the whisk is removed. Gradually add the caster sugar, whisking continuously, until all of the sugar is incorporated and stiff peaks form when the whisk is removed.",
        "Place a few dots of meringue onto a baking tray, then lay greaseproof paper on top (the meringue will help hold the paper in place on the tray). Spoon 8-12 dollops of the meringue onto the paper, leaving a generous gap between each mound of meringue. (Prepare two meringues per person.)",
        "Bake the meringues in the oven for one hour to one hour and 30 minutes, or until the meringues are firm but still slightly soft in the middle. Remove from the oven and leave to cool on the baking tray.",
        "For the strawberry cream, place half of the strawberries into a food processor and blend to a smooth purée. Reserve 4-6 of the remaining strawberries for garnish, then roughly chop the rest and set aside.",
        "Whisk the cream in a bowl until soft peaks form when the whisk is removed, then fold in the strawberry purée. Add icing sugar, to taste, then fold in the chopped strawberries.",
        "To serve, place a spoonful of strawberry cream onto half of the meringues, then top with a second meringue. Garnish with a whole strawberry and serve."
    ],
    "howTos": [
        "whipping_cream"
    ],
    "videos": "[]"
}