{
    "title": "Sugar-free strawberry and banana ice cream",
    "cookTime": "less than 10 mins",
    "prepTime": "over 2 hours",
    "serves": "Serves 8",
    "recommendations": "",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/strawberry_and_banana_24556_16x9.jpg"
    ],
    "description": "This tasty ice-cream contains no added sugar, getting its sweetness from strawberries and vanilla. Equipment and preparation: for this recipe you will need a pre-chilled ice cream maker. This ice-cream without the topping contains 285 kcal, 4.5g protein, 9g carbohydrate (of which 8g sugars), 26g fat (of which 14.5g saturates), 1g fibre and 0g salt per portion.",
    "author": {
        "justine_pattison": "Justine Pattison"
    },
    "show": {
        
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "300ml/10fl oz double cream",
            "300ml/10fl oz whole milk",
            "1 vanilla pod, cut in half lengthways, seeds scraped out (or 2 tsp vanilla bean paste)",
            "6 large free-range egg yolks",
            "500g/1lb 2oz ripe strawberries, hulled, halved",
            "1 medium-large very ripe banana (around 100g/3½oz peeled weight)"
        ]
    },
    "steps": [
        "Pour the cream and milk into a large saucepan and stir in the vanilla pod and seeds. Bring to the boil, then immediately turn off the heat.",
        "Whisk the egg yolks in a large bowl until pale then whisk in the cream and milk. When thoroughly combined, return the liquid to the saucepan and set over a very low heat.",
        "Cook for about 5 minutes, stirring constantly, until the custard is just thick enough to coat the back of the spoon. It’s important to make sure the mixture does not overheat otherwise the eggs will begin to scramble.",
        "Remove the pan from the heat, remove the vanilla pod and pour the custard into a clean bowl. Cover the surface with cling film to stop a skin forming, leave to cool.",
        "Put the strawberries and banana in a food processor and blend to a purée. Put the cooled custard and the purée into a pre-chilled ice cream maker. Churn until very thick (this could take over 30 minutes) then transfer to a freezer-proof container and freeze until solid.",
        "Remove from the freezer and leave to stand at room temperature for 5-10 minutes before serving."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}