{
    "author": {
        "brian_turner": "Brian Turner"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "The addition of lavender and strawberries gives this sturdy, traditional British pudding a delicate twist. Equipment and preparation: you will need a 23cm/9in pie dish, a hand-held whisk or free-standing mixer and a piping bag.",
    "dishes": [
        "bread",
        "custard",
        "icing",
        "meringue",
        "oven-baked_dishes",
        "pie",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "300ml/10½fl oz milk",
            "300ml/10½fl oz double cream",
            "1 vanilla pod, split",
            "2 tbsp edible lavender flowers",
            "4 free-range egg yolks",
            "140g/5oz sugar",
            "butter for greasing",
            "250g/9oz strawberries",
            "120g/4¼oz breadcrumbs",
            "1 tbsp runny honey",
            "4 free-range egg whites",
            "icing sugar"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "",
    "serves": "Serves 6-8",
    "show": {
        "b04gtx26": "A Taste of Britain"
    },
    "steps": [
        "Put the milk and double cream into a saucepan, scrape in the vanilla seeds, add the pod and lavender flowers and bring just to the boil, then remove from the heat and allow to cool slightly.",
        "Beat the egg yolks and 55g/2oz of the sugar together in a large bowl. Slowly strain the warm milk and cream mixture into the egg yolks and sugar, while whisking. Set aside.",
        "Preheat the oven to 180C/350F/Gas 4. Butter a 23cm/9in pie dish, cut 12 strawberries in half, lay them in the dish and put the breadcrumbs on top. Pour the custard over and leave to stand for 20 minutes.",
        "Bake for approximately 30 minutes until the custard has set. Remove from the oven and allow to stand for five minutes. Leave the oven on.",
        "Warm the honey in a small pan over a low heat. Chop 10 strawberries and add them to the pan. Allow it to cool a little before spreading it over the set custard.",
        "Gently warm the remaining 85g/3oz sugar in a baking tray in the oven for 5-10 minutes.",
        "Using a hand-held whisk or free-standing mixer with whisk attachment, whisk the egg whites in a clean dry bowl until firm, then whisk in the warmed sugar.",
        "Place the meringue in a piping bag and pipe a lattice over the pudding, sprinkle with icing sugar and return to the oven for 5-10 minutes to brown the meringue.",
        "Allow to cool, then decorate round the outside with the remaining strawberries, halved, like jewels in a queen’s crown.",
        "Dust again with icing sugar and serve at room temperature."
    ],
    "tips": [
        
    ],
    "title": "Strawberry and lavender queen of puddings",
    "videos": "[]"
}