{
    "author": {
        "jun_tanaka": "Jun Tanaka"
    },
    "cookTime": "10 to 30 mins",
    "description": "A perfect make ahead dessert for summer - sweet pastry filled with vanilla custard and topped with glazed strawberries. Equipment and preparation: for this recipe you will need baking beans and a 20cm/8in tart ring.",
    "dishes": [
        "custard",
        "fruit_tart",
        "jelly",
        "oven-baked_dishes",
        "pastry",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the custard": [
            "350ml/12fl oz double cream",
            "3 vanilla pods, split lengthways and seeds scraped out",
            "8 free-range egg yolks",
            "70g/2½oz sugar"
        ],
        "For the sweet pastry": [
            "150g/5½oz unsalted butter, softened",
            "100g/3½oz sugar",
            "1 free-range egg yolks",
            "1 free-range egg",
            "250g/9oz plain flour"
        ],
        "For the topping": [
            "3 punnets strawberries, hulled and thinly sliced",
            "4-5 tbsp redcurrant jelly"
        ]
    },
    "prepTime": "1-2 hours",
    "recommendations": "1",
    "serves": "Makes 1 large tart",
    "show": {
        "b01rclgp": "Country Show Cook Off"
    },
    "steps": [
        "For the sweet pastry, cream the butter and sugar until pale. Slowly add the egg yolk and egg, mixing all the time. Fold in the flour and mix to form a dough.",
        "Turn out the dough, shape into a rough ball and wrap in cling film. Transfer to the fridge to chill for an hour.",
        "Preheat the oven to 180C/350F/Gas 4.",
        "Once the pastry has chilled and rested, roll out to a ½cm/¼in thickness. Place the tart ring on a baking tray and line with the pastry. Place baking parchment inside the pastry case and fill with baking beans. Bake blind in the oven for 15 minutes, or until light golden-brown.",
        "Reduce the oven temperature to 100C/225F/Gas ¼.",
        "For the custard, add the cream and the vanilla pods and seeds to a pan and bring to a boil. Reduce to a simmer. In a bowl, beat the yolks and sugar together until pale, then add to the cream in batches, whisking all the time. Return the custard to the pan over a low heat, and stir constantly with a wooden spoon until the mixture is thick enough to coat the back of a spoon. Set aside to cool.",
        "When the custard has cooled, pour it into the pastry case and bake for 30 minutes. Remove from the oven and cool in the fridge.",
        "Once the custard in the tart is firm, arrange the strawberries neatly on top.",
        "In a pan, warm the redcurrant jelly with 3-4 tablespoons of water. Stir to combine until you have a syrupy consistency (add more water or jelly if needed). Use a pastry brush to gently cover the strawberries with the syrup to glaze.",
        "Leave to set before carefully removing the tart from the tart ring."
    ],
    "tips": [
        
    ],
    "title": "Strawberry and custard tart",
    "videos": "[]"
}