{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This charlotte contains sweet strawberries inside a crisp buttery bread crust. Often done with apple, this is a great summer version. Equipment: for this recipe you'll need four small pudding (dariole) moulds.",
    "dishes": [
        "bread",
        "charlotte",
        "custard",
        "icing",
        "jam",
        "oven-baked_dishes",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the charlotte": [
            "500g/1lb 2oz strawberries, roughly chopped",
            "icing sugar, to taste",
            "115g/4oz butter",
            "10 slices white bread"
        ],
        "For the custard": [
            "200ml/7fl oz double cream",
            "200ml/7fl oz milk",
            "1 vanilla pod, split in half, seeds scraped out",
            "6 free-range eggs, yolks only",
            "75g/3oz caster sugar",
            "clotted cream, to serve"
        ]
    },
    "prepTime": "30 mins to 1 hour",
    "recommendations": "4",
    "serves": "Serves 4",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4.",
        "Place a third of the strawberries into a food processor and blend to a purée with a touch of icing sugar.",
        "Check the strawberry purée is sweet enough then place in a bowl with the rest of the strawberries and mix well.",
        "Meanwhile, melt the butter and cut the crusts off the bread.",
        "Cut the slices in half, and then each half into four slices to get small fingers.",
        "Dip each piece of bread in the melted butter and line the moulds, reserving enough bread for the lids.",
        "Once the moulds are lined, spoon in the strawberries and top with more bread that has been dipped in melted butter.",
        "Place the charlottes on a baking sheet and bake for 25-30 minutes until golden-brown on top.",
        "For the custard, place the cream and milk into a saucepan along with the vanilla pod and seeds and bring to a gentle simmer for five minutes to infuse.",
        "Place the egg yolks and sugar into a bowl and whisk together until pale and fluffy.",
        "Pour the hot milk onto the eggs and stir well, then return to the pan and cook, stirring continuously until just thickened.",
        "Strain the custard through a sieve into a clean pan.",
        "To serve, remove the charlottes from the oven and set aside to cool slightly, then carefully turn them out onto a four serving plates and serve immediately.",
        "Serve the charlottes, topped with clotted cream and a spoonful of custard."
    ],
    "tips": [
        
    ],
    "title": "Strawberry charlotte",
    "videos": "[]"
}