{
    "title": "Strawberry and cream lollies",
    "cookTime": "no cooking required",
    "prepTime": "overnight",
    "serves": "Makes 6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "These strawberries and cream ice lollies are summer on a stick and great fun to make with the kids. Equipment and preparation: For this recipe, you will need six 100ml/3½fl oz lolly moulds.",
    "author": {
        "sandra": "Sandra Bright"
    },
    "show": {
        "b04wlw4w": "The Big Allotment Challenge"
    },
    "tips": [
        "Tip: If using flat-sided lolly moulds, thinly slice one or two strawberries and line each side of each mould with one slice of strawberry before adding the strawberry and yoghurt mixture and freezing."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "100ml/3½fl oz single cream",
            "1 vanilla pod, seeds only",
            "250g/9oz strawberries, hulled",
            "40g/1½oz icing sugar",
            "100g/3½oz full-fat Greek-style yoghurt",
            "10 lavender flowers"
        ]
    },
    "steps": [
        "In a jug, mix together the cream and vanilla seeds until well combined. Pour the mixture into the lolly moulds until it reaches halfway up the sides.",
        "Finely chop three strawberries and divide them equally between the moulds. Cover the tops of the moulds with cling film, then transfer to the freezer and freeze upright for at least 1 hour, or until the cream is beginning to solidify.",
        "Meanwhile, blend the remaining strawberries to a smooth purée in a food processor. Remove 2 tablespoons of the purée and set aside in a bowl.",
        "Add the icing sugar and yoghurt to the remaining purée and blend until well combined.",
        "Soak the lavender flowers in the reserved purée for at least 10 minutes, then strain and add the puree to the strawberry and yoghurt mixture.",
        "Fill the moulds with the strawberry and yoghurt mixture and cover each one with its lid.",
        "Freeze the lollies for at least 4 hours, or preferably overnight. To remove the lollies from the moulds, dip them in hot water for a few seconds and release them. Serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}