{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "Chicken thighs are super cheap and full of flavour. Fill with a herby stuffing for a tasty budget meal.",
    "dishes": [
        "bread",
        "oven-baked_dishes",
        "pie",
        "stir-fries",
        "stuffing"
    ],
    "flags": [
        
    ],
    "howTos": [
        "zesting_citrus_fruit"
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "2 tbsp olive oil",
            "1 small onion, peeled, finely chopped",
            "2 garlic cloves, crushed to a paste with the edge of a knife",
            "75g/3oz fresh white breadcrumbs",
            "1 tbsp chopped fresh parsley",
            "2 tsp fresh thyme leaves",
            "1 lemon, zest only, plus the juice of half a lemon",
            "1 free-range egg yolk",
            "salt and freshly ground black pepper",
            "6 chicken thighs, bones removed, skin left on",
            "1-2 tbsp butter"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "4",
    "serves": "Serves 6",
    "show": {
        "b00pftz5": "The Hairy Bikers' Twelve Days of Christmas"
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 5.",
        "Heat the oil in a frying pan over a medium heat. Add the onion and garlic and fry for 4-5 minutes, or until softened but not coloured.",
        "Mix together the breadcrumbs, parsley, thyme, lemon zest and lemon juice in a bowl until well combined.",
        "Add the cooked onion and garlic and the egg yolk and stir well to combine. Season, to taste, with salt and freshly ground black pepper.",
        "Lay each piece of thigh meat out and spread with an even layer of the stuffing mixture. Roll up each stuffed chicken thigh and secure with cocktail sticks.",
        "Place each stuffed chicken thigh into a roasting tin and dot all over with butter.",
        "Roast the stuffed chicken thighs in the oven for 35-40 minutes, or until cooked through and golden-brown. Serve with roast chicken and vegetables."
    ],
    "tips": [
        
    ],
    "title": "Stuffed chicken thighs",
    "videos": "[]"
}