{
    "author": {
        "antonio_carluccio": "Antonio Carluccio"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Italian",
    "description": "Carefully removing the bones from chicken legs can be a little tricky, but the result is juicy meat encased in crisp skin and bacon. Yum!",
    "dishes": [
        "bread",
        "casserole",
        "oven-baked_dishes",
        "pie",
        "sausage",
        "stuffing"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the chicken": [
            "4 whole chicken legs",
            "4 thin slices back bacon",
            "3 tbsp olive oil"
        ],
        "For the stuffing": [
            "50g/1¾oz fresh white breadcrumbs",
            "75g/2½oz mortadella, cut into strips",
            "¼ nutmeg, grated",
            "1 tbsp freshly chopped parsley",
            "1 garlic clove, finely chopped",
            "2 free-range eggs",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "2 tbsp olive oil",
            "2 garlic cloves, peeled and chopped",
            "1 red chilli, chopped",
            "50g/1¾oz spinach"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Preheat the oven to 200C/180C Fan/Gas 6.",
        "For the chicken, remove any adjoining backbone and knuckles from the chicken legs, if necessary. Using a very sharp knife cut down the length of the bones on the inside and ease the flesh away, taking care not to cut the skin. Discard the bones. You will be left with tapering rectangles of meat. To flatten them, lay them skin-side down on a chopping board, cover with cling film and bash with a rolling pin.",
        "For the stuffing, mix together the breadcrumbs, sliced mortadella, nutmeg, parsley and garlic. Beat the eggs, season with salt and pepper and mix in to the other ingredients.",
        "Place a spoonful of the stuffing in the middle of each rectangle of chicken. Fold the rectangle into a sausage-shaped parcel. Put a piece of bacon lengthwise along each ‘sausage’ to close the join and fold over the end to close the parcel. Secure with kitchen string to make an even shape and to prevent the stuffing leaking.",
        "Heat the oil in a heavy-based pan or casserole and fry the stuffed chicken legs on all sides, until browned. Transfer to the oven and bake for 15 minutes, or until cooked through.",
        "Heat a large sauté or frying pan and add the oil. Once hot, add the garlic and chilli and fry for a couple of minutes. Add the spinach and a splash of water and cook until wilted.",
        "To serve, remove the string and leave the chicken parcels to cool slightly before carving into thick slices. Serve with the spinach alongside. They are equally good served cold."
    ],
    "tips": [
        
    ],
    "title": "Stuffed chicken legs",
    "videos": "[]"
}