{
    "title": "Stuffed vegetables",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 8-10",
    "recommendations": "7",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/stuffed_vegetables_56352_16x9.jpg"
    ],
    "description": "When we were filming in Greece, stuffed vegetables was our favourite dish. It all stemmed from a brief lunch stop at the little fishing village of Astakos, where we asked what was for lunch at the first quayside café we came to. They said stuffed tomatoes and peppers, which had just come out of the oven. Straight from the oven when you are ravenously hungry is perfect. This meal, if served as 10 portions, provides 249kcal, 5g protein, 39g carbohydrate (of which 6g sugars), 7.5g fat (of which 1.5g saturates), 4g fibre and 0.2g salt per portion.",
    "author": {
        "rick_stein": "Rick Stein"
    },
    "show": {
        "b0667qf6": "Rick Stein: From Venice to Istanbul"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1 green pepper",
            "1 red pepper",
            "1 yellow pepper",
            "2 large tomatoes",
            "2 small–medium aubergines",
            "1 green courgette",
            "1 yellow courgette",
            "6 tbsp olive oil",
            "1 large onion, finely chopped",
            "2 garlic cloves, finely chopped",
            "2½ tbsp tomato purée",
            "400g/14oz long-grain rice, rinsed",
            "250ml/9fl oz vegetable stock",
            "large handful flatleaf parsley",
            "large handful fresh mint",
            "1 tsp dried oregano",
            "⅛ tsp chilli flakes",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 160C/140C Fan/Gas 3.",
        "Start by preparing the vegetables for stuffing. Cut the tops off the peppers and tomatoes to create lids, set the tops aside. Scoop out the pepper seeds and discard. Scoop out the tomato flesh and seeds and reserve. Cut the aubergines and courgettes lengthways and scoop out the seeds and flesh inside, leaving a boat-shaped shell ready to fill. Add the flesh from the courgettes and aubergines to the tomato flesh and seeds and chop well.",
        "In a large pan over a medium heat, warm 3 tablespoons of the olive oil and fry the onion and garlic for 3–5 minutes until soft. Add the chopped vegetable flesh and the tomato purée. Cook for about 10 minutes until softened.",
        "Add the rice and 150ml/5fl oz of the vegetable stock, raise to a simmer and and cook for 10 minutes, stirring occasionally. Season with salt and pepper and stir in the herbs and chilli flakes.",
        "Arrange the vegetable shells on a roasting tin or ovenproof dish and spoon the rice mixture into them. Place the lids on the peppers and tomatoes and drizzle them all with the remaining olive oil.",
        "Pour the remaining stock into the tin, cover with foil and bake for 1 hour. Remove the foil and bake for another 15–30 minutes until the vegetables and rice are cooked.",
        "Serve hot, warm or cold."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}