{
    "title": "Stuffed mussels",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "6",
    "images": [
        
    ],
    "description": "This makes a great starter or light lunch dish. Use the biggest, freshest mussels you can find.",
    "author": {
        "valentine_warner": "Valentine Warner"
    },
    "show": {
        "b016pbs9": "Great British Food Revival"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "24 large live mussels, de-bearded and cleaned",
            "1 large banana shallot, finely chopped",
            "70g/2½oz unsalted butter, softened",
            "50ml/2fl oz dry vermouth",
            "2 garlic cloves, crushed",
            "30-40 walnut halves, smashed or chopped into small pieces",
            "1 lemon, juice and zest",
            "25g/1oz parmesan, grated",
            "50g/2oz fresh breadcrumbs",
            "2 tbsp very finely chopped parsley",
            "½ tbsp finely chopped fresh tarragon",
            "freshly ground black pepper",
            "rock salt"
        ]
    },
    "steps": [
        "Preheat the grill to a moderate heat. Discard any mussels that are broken or that don’t close when tapped. Place the good mussels into a large pan with a splash of boiling water and cover with a tightly fitting lid. Cook over a high heat for two minutes or until the mussels have just opened then pour them into a large colander and leave to cool.",
        "In a small pan, soften the shallot in about one third of the butter then add the vermouth. Cook until the vermouth has evaporated then pour the mixture into a large bowl.",
        "Combine the rest of the ingredients and the remaining butter with the shallots in the bowl and season with plenty of freshly ground black pepper.",
        "Remove and discard the top shells of the mussels. Add a teaspoon of the stuffing to each mussel and arrange them on a large baking tray. Place under the grill for 2-3 minutes or until the stuffing is golden-brown and bubbling. Transfer the mussels to a plate and scatter generously with rock salt to keep them stable. Eat with additional lemon if desired."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}