{
    "title": "Succulent chicken tikka wraps",
    "cookTime": "less than 10 mins",
    "prepTime": "over 2 hours",
    "serves": "Serves 5",
    "recommendations": "15",
    "images": [
        
    ],
    "description": "Don't let the cheese in the marinade throw you - this is an authentic tandoori recipe. Chefs first introduced cheese to quieten the flavours of the original chicken tikka for the tourists and replaced the strong flavours with more delicate spices.",
    "author": {
        "anjum_anand": "Anjum Anand"
    },
    "show": {
        "b007szxr": "Indian Food Made Easy"
    },
    "tips": [
        "Equipment: for this recipe, you'll need ten wooden skewers, soaked in water for half an hou"
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the marinade": [
            "150ml/5fl oz Greek-style yoghurt",
            "1 tbsp vegetable oil",
            "2.5cm/1in piece fresh ginger, peeled and chopped",
            "1 garlic clove, chopped",
            "¼-½ tsp red chilli powder, or to taste",
            "1 tsp garam masala",
            "Generous pinch green and black cardamom seeds and fennel seeds, ground together",
            "¾-1 tsp salt, or to taste",
            "30g/1oz cheddar cheese, coarsely grated",
            "1½ tbsp lemon juice",
            "1 free-range egg, beaten",
            "2 rounded tbsp gram flour"
        ],
        "For the chicken": [
            "400g/14oz chicken breasts, skin and bones removed, cut into 2.5cm/1in cubes",
            "oil, for brushing",
            "2 tbsp melted butter, to baste"
        ],
        "To serve": [
            "¾ tsp chaat masala (optional), available from Asian stores and some supermarkets",
            "5 ready-made flour tortillas, wrapped in foil and placed in the oven for the last five minutes of cooking",
            "½ onion, finely sliced",
            "2 tomatoes, finely sliced",
            "1 Little Gem lettuce, finely sliced",
            "150ml/5fl oz chutney"
        ]
    },
    "steps": [
        "For the chicken, place all the marinade ingredients into a large bowl and mix well. Pierce the chicken pieces all over with a fork and add to the marinade. Leave to marinate in the fridge for a few hours, if possible, bringing the chicken back to room temperature before cooking.",
        "To cook the chicken, preheat the grill to medium. Brush the grill rack liberally with oil and place some aluminium foil on the oven floor to catch any drips. Thread the chicken pieces onto the skewers, spacing them apart so they do not touch. Grill for 6-8 minutes, turning halfway through the cooking time. Then baste the chicken with the butter and grill for another minute, or until slightly charred at the edges and completely cooked through.",
        "Using a fork, slide the chicken pieces off the skewers and sprinkle over the chaat masala, if using. Divide the chicken into five equal portions and place each portion in the middle of a warmed tortilla. Top with the sliced vegetables and a spoonful of the chutney. Fold over the top of the tortilla and pull in the sides. Cut in half on the diagonal and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}