{
    "title": "Stuffed mushrooms with Stilton, creamy leeks and garlic croûtons",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "garrey_dawson": "Garrey Dawson"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the stuffed mushrooms": [
            "dash olive oil",
            "2 Portobello mushrooms, peeled",
            "55g/2oz Stilton cheese, crumbled",
            "salt and freshly ground black pepper",
            "150ml/½ pint double cream"
        ],
        "For the creamy leeks": [
            "dash olive oil",
            "½ leek, finely sliced",
            "1 garlic clove, finely chopped",
            "2 tbsp chopped fresh chives",
            "150ml/¼ pint double cream",
            "salt and freshly ground black pepper"
        ],
        "For the garlic croutons": [
            "2 tbsp olive oil",
            "2 garlic cloves, peeled and crushed",
            "2 slices white crusty bread, crust removed, cubed"
        ]
    },
    "steps": [
        "Preheat the grill to medium.",
        "For the stuffed mushrooms, heat a little olive oil in a frying pan, add the mushrooms stalk-side down and fry over a gentle heat for 2-3 minutes. Turn over, crumble over the Stilton and season with salt and freshly ground black pepper and continue to fry for 2-3 minutes. Place on a baking tray and place under the grill until the cheese has just melted.",
        "For the creamy leeks, heat the olive oil in a small saucepan, add the leeks and sauté over a gentle heat for 3-4 minutes. Add the garlic and cook for one minute. Add the chives and cream, season with salt and freshly ground black pepper and heat through. Remove from the heat and keep warm.",
        "For the croutons, heat the olive oil in a frying pan, add the garlic and cook over a gentle heat for 1-2 minutes. Add the bread cubes and fry until golden.",
        "To serve, place the mushrooms onto a serving plate, pour around the creamy leeks and scatter with the garlic croutons."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}