{
    "author": {
        "simon_rogan": "Simon Rogan"
    },
    "cookTime": "1 to 2 hours",
    "description": "Crispy pork shoulder is teamed perfectly with artichoke purée and a rich pork sauce sweetened with mead (aka honey wine).",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "roast_pork",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the artichoke purée": [
            "olive oil, for frying",
            "600g/1lb 5oz Jerusalem artichokes, peeled and sliced",
            "salt",
            "50g/1¾oz milk",
            "90g/3¼oz unsalted butter"
        ],
        "For the mead pork sauce": [
            "1kg/2lb 4oz pork ribs",
            "1kg/2lb 4oz minced pork",
            "100g/3½oz carrots, finely chopped",
            "100g/3½oz onions, finely chopped",
            "100g/3½oz celery, finely chopped",
            "100g/3½oz tomato paste",
            "salt and freshly ground black pepper",
            "250ml/9 fl oz mead, plus extra for seasoning"
        ],
        "For the pork": [
            "250g/9oz sea salt",
            "2 tsp fresh thyme leaves",
            "15g/½oz garlic, crushed and finely chopped",
            "1 shoulder suckling pig"
        ],
        "For the vegetables": [
            "2 turnips, peeled and sliced into discs",
            "2 Jerusalem artichokes, peeled and sliced into discs",
            "2 small carrots, peeled and sliced lengthways",
            "4 baby beetroots, peeled and sliced in half lengthways",
            "2 young onions, or round shallots, whole",
            "45g/1½oz butter",
            "salt and freshly ground black pepper"
        ],
        "For the wild mushrooms": [
            "olive oil, for frying",
            "handful wild mushrooms, sliced",
            "salt and freshly ground black pepper"
        ],
        "To serve": [
            "nasturtium leaves"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b0071y6r": "Great British Menu"
    },
    "steps": [
        "For the mead pork sauce, preheat the oven to 190C/375F/Gas 5. Place the pork ribs and the minced pork into a roasting tray and cook in the oven for an hour. Place the carrots, onion and celery into the pan of a pressure cooker and fry gently until soft. Add the tomato paste, the roasted pork ribs and mince, then fry for two minutes before deglazing with the mead. Reduce the mead down by half and then add 1 litre/1¾ pints water. Bring to the boil, put the lid of the pressure cooker on, pressurize and cook on a low heat for two hours. Remove the pressure cooker from the heat and leave to stand for 10-20 minutes until the pressure has naturally released. Remove the lid and transfer the pan to the fridge to chill for 12 hours.",
        "For the pork, mix together the sea salt, thyme and garlic, and rub the mix all over the pork shoulder. Set aside for 12 hours.",
        "For the mead pork sauce, when chilled, carefully scrape the fat off the top and pass the remaining liquid through a fine sieve into a clean pan. Chill again for 30 minutes then place over a medium heat and reduce down to a glossy sauce consistency. Taste to check the seasoning and add more salt and freshly ground black pepper if required. Drizzle with a little more mead and set aside.",
        "For the pork, preheat the oven to 200C/400F/Gas 6. Wash off the salt mix, place in a roasting tray and roast in the oven for 30 minutes, then turn the oven down to 140C/275F/Gas 1 and continue to cook for four hours. When cooked, find the bone and carefully pull it out (it should come out easily). Portion the shoulder into four. Heat a frying pan with a little sunflower oil to a medium to high heat with a little sunflower oil and add the shoulder portions skin side down. Cook until the skin is really crisp.",
        "For the artichoke purée, heat a non-stick pan with a little oil, add the Jerusalem artichokes, season with a pinch of salt and gently fry with the lid on for 45 minutes or until soft. Place the artichokes, milk and butter into a food processor and blend until smooth. Pass through a sieve.",
        "For the vegetables, cook all the different types of vegetables in separate pans of boiling water to keep their flavour. Boil the turnips and Jerusalem artichokes for 10 minutes or until tender, the carrots for 10-15 minutes, the beetroots until tender (timings vary on beetroots, so check every few minutes) and the onions for 15 minutes. Drain all the vegetables, slide the onions out of their skins and cut in half lengthways. Toss all the vegetables in the butter and season with salt and freshly ground black pepper.",
        "For the wild mushrooms, heat a frying pan to a medium heat, add a little oil and fry the mushrooms for 1–2 minutes or until just tender. Season with salt and freshly ground black pepper and set aside.",
        "To serve, place a generous spoonful of artichoke purée on each plate with a piece of the suckling pig. Arrange the vegetables and mushrooms around the pork, spoon over some sauce and garnish with nasturtium leaves."
    ],
    "tips": [
        
    ],
    "title": "Suckling pig with northern mead, vegetables and artichoke",
    "videos": "[]"
}