{
    "title": "Sumiko’s miso soup",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "",
    "images": [
        
    ],
    "description": "This light and healthy Japanese soup is the real deal, made with homemade dashi for added authenticity.",
    "author": {
        "sumiko_sarashima": "Sumiko Sarashima"
    },
    "show": {
        "b05y38pk": "Nigel Slater: Eating Together"
    },
    "tips": [
        "You can buy ready-made dashi from Japanese supermarkets; this dish requires 400ml/14fl oz of dashi."
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the dashi": [
            "7-10 sheets dried sea kelp (called konbu, available from Japanese supermarkets)",
            "8g dried bonito flakes (called katsuobushi, available from Japanese supermarkets)"
        ],
        "For the miso soup": [
            "handful fresh spinach leaves",
            "200g/7oz aburaage (thinly sliced deep-fried tofu, available from Japanese supermarkets), shredded into 1cm/½in lengths",
            "1½ tbsp white miso paste"
        ]
    },
    "steps": [
        "For the dashi, put the konbu in a deep-sided saucepan and cover with 500ml/18fl oz water. Set aside to soak for 30 minutes.",
        "Once soaked, heat the pan contents until just boiling, removing the konbu with a slotted spoon just before the water starts to boil.",
        "Add the bonito flakes to the water and boil for 1 minute, then remove the pan from the heat and allow the stock to cool for 4-5 minutes. Strain the dashi through a fine sieve into a clean saucepan and reserve. Keep warm.",
        "For the miso soup, cook the spinach in a pan of boiling water until wilted, then remove from the water using a slotted spoon and set aside in a bowl to cool. Once the spinach is cool enough to handle, squeeze out any excess moisture from the leaves using your hands. Set aside.",
        "Add the aburaage to the spinach water and boil for 1-2 minutes to remove any grease. Drain well.",
        "Push the miso paste through a fine sieve into the dashi and heat until dissolved. Add the drained tofu and spinach and warm through. Serve immediately in bowls."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}