{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "10 to 30 mins",
    "description": "Simon Rimmer suggests a novel way with the sweetest berries of the season and luxurious double cream.",
    "dishes": [
        "bread",
        "crumble",
        "icing",
        "oven-baked_dishes",
        "sauce",
        "soup"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        "pulsing"
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the coconut cream": [
            "500ml/17½fl oz double cream",
            "100g/3½oz icing sugar, sifted",
            "200ml/7¼fl oz coconut milk"
        ],
        "For the crumble topping": [
            "175g/6¼oz unsalted butter",
            "175g/6¼oz caster sugar",
            "175g/6¼oz plain flour",
            "pinch ground cinnamon"
        ],
        "For the sauce": [
            "200g/7¼oz icing sugar",
            "50ml/1¾fl oz brandy",
            "300ml/10½fl oz red wine",
            "400g/14¼ oz strawberries"
        ],
        "To serve": [
            "100g/4oz blackberries",
            "150g/5¼oz raspberries",
            "150g/5¼oz blueberries",
            "6 sprigs redcurrants",
            "icing sugar, for dusting"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 6",
    "show": {
        
    },
    "steps": [
        "Preheat the oven to 180C/350F/Gas 4. Line a baking tray with greaseproof paper or baking parchment.",
        "For the crumble topping, rub the butter, sugar and flour together in a bowl until the mixture resembles fine breadcrumbs.",
        "Sprinkle the mixture onto the lined baking tray, then bake in the oven for 12-15 minutes, or until crisp and golden-brown. Remove from the oven and set aside to cool.",
        "For the sauce, heat the sugar, brandy and wine in a pan until the sugar has dissolved and the mixture resembles syrup. Set aside to cool.",
        "Blend the strawberries to a purée in a food processor. Strain the blended strawberries through a sieve, then fold the strained purée into the syrup until combined.",
        "For the coconut cream, whisk the double cream and icing sugar in a large bowl until slightly thickened.",
        "Add the coconut milk and continue to whisk until soft peaks form when the whisk is removed. Whisk in additional icing sugar, to taste, to sweeten the mixture.",
        "To serve, arrange a mixture of the blackberries, raspberries and blueberries into the centre of each of six serving dishes. Spoon the sauce on top, followed by the coconut cream. Sprinkle over the cinnamon crumble. Garnish with the redcurrant sprigs and dust with icing sugar."
    ],
    "tips": [
        
    ],
    "title": "Summer fruit soup with coconut cream and crumble topping",
    "videos": "[]"
}