{
    "title": "Sun-dried tomato and poppy seed savoury biscuits",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 36 biscuits",
    "recommendations": "4",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sun-dried_tomato_and_86934_16x9.jpg"
    ],
    "description": "A selection of savoury, buttery biscuits is just what’s needed at your next drinks party.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "375g/13oz plain flour, plus extra for dusting",
            "1 tsp salt",
            "125g/4½oz unsalted butter, softened",
            "2 medium free-range eggs",
            "2 tbsp poppy seeds",
            "40g/1½oz parmesan, grated (or a similar vegetarian hard cheese)",
            "1 tbsp sun-dried tomato paste",
            "1 tbsp sesame seeds"
        ]
    },
    "steps": [
        "Put the flour, salt, butter, one of the eggs and 40ml/1½fl oz water into a bowl and mix well for five minutes until you have a smooth dough. Divide the dough in half.",
        "On a lightly floured work surface, knead the poppy seeds in to one half of the dough and the parmesan and sun-dried tomato paste to the other.",
        "Using a rolling pin, roll out each piece of dough on a lightly floured work surface to about 3mm thick. Place each piece of dough on a baking tray, cover with cling film and refrigerate for 30 minutes.",
        "Preheat the oven to 200C/180C(fan)/Gas 6. Dust two large baking trays with flour.",
        "Using a 7cm/2¾cm round cutter cut out 18 rounds from each half of the dough, re-rolling as necessary. Place the rounds on the baking tray.",
        "Brush the biscuits with beaten egg and sprinkle the parmesan and tomato ones with sesame seeds.",
        "Bake for 10-15 minutes until golden-brown. Remove from the oven and transfer to a wire rack to cool. Serve warm or cold."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}