{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "10 to 30 mins",
    "description": "Luxurious fruit, nuts and liqueur make these satisfyingly chewy cookies ideal for a special occasion.",
    "dishes": [
        "cookies",
        "oven-baked_dishes",
        "pie"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/superposhchewycookie_89623_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "100g/3½oz unsalted butter, softened, plus extra for greasing",
            "100g/3½oz caster sugar",
            "2 tbsp sunflower oil",
            "100g/3½oz soft dark brown sugar",
            "1 free-range egg, beaten",
            "½ tsp vanilla essence",
            "200g/7oz plain flour, plus extra for dusting",
            "½ tsp salt",
            "½ tsp baking powder",
            "100g/3½oz dried sour cherries, soaked in water",
            "2 tbsp cherry brandy",
            "40g/1½oz flaked almonds",
            "75g/2½oz roasted hazelnuts, chopped",
            "100g/3½oz white chocolate, broken into small pieces",
            "100g/3½oz dark chocolate, broken into small pieces"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "12",
    "serves": "Makes 6-12 cookies",
    "show": {
        "b00d6g4f": "The Hairy Bakers"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Place the butter and the caster sugar into a bowl and beat together until light and creamy.",
        "Add the sunflower oil and brown sugar and fold through to combine.",
        "Add the egg and vanilla essence and mix well.",
        "In a separate bowl, mix together the flour, salt and baking powder.",
        "Add the flour mixture to the butter and sugar mixture and mix well to form a dough.",
        "Add the drained cherries and brandy and fold into the dough.",
        "Fold in the almonds, hazelnuts and the white and dark chocolate pieces.",
        "On a floured work surface, carefully roll out the dough to 1cm/½in thick.",
        "Using the cookie cutter of your choice, cut out 8-16 cookies (depending on the size of the cutter).",
        "Place the cookies onto a greased baking tray (not too close together as they will spread). Place into the oven to bake for 15 minutes, or until golden-brown and cooked through.",
        "Remove from the oven and leave to cool on the trays for 8-10 minutes, then transfer to a wire cooling rack to cool completely."
    ],
    "tips": [
        
    ],
    "title": "Super-posh chewy cookies",
    "videos": "[]"
}