{
    "author": {
        "john_torode": "John Torode"
    },
    "cookTime": "less than 10 mins",
    "description": "This vegetarian salad is simply bursting with the fresh flavours of spring, the perfect meal for a sun soaked day.",
    "dishes": [
        "bun",
        "salad",
        "sauce"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the dressing": [
            "1 tbsp Dijon mustard",
            "5 tbsp red wine vinegar",
            "1 tsp walnut oil",
            "300ml/10½oz extra virgin olive oil"
        ],
        "For the spring salad": [
            "12 Jersey Royal potatoes",
            "10 green asparagus spears, sliced on an angle",
            "150g/5½oz young broad beans, podded",
            "150g/5½oz peas, podded",
            "150g/5½oz fresh or frozen soy beans",
            "3 spring onions, sliced on an angle",
            "drizzle of olive oil",
            "4 purple asparagus spears, sliced using a peeler",
            "1 lemon, juice only",
            "2 shallots, cut into rings",
            "15 mint leaves, 10 torn, 5 shredded",
            "small bunch of chervil",
            "handful watercress",
            "punnet of pea shoots",
            "sea salt and freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Bring a large pot of water to the boil and blanch the potatoes, drain and carefully slice in half.",
        "Bring a large pot of salted water to the boil. Drop in the green asparagus, add the broad beans, peas, soy beans and spring onions and cook for a couple of minutes. Drain and run under cold water to stop them cooking but not to cool them.",
        "Spread on a tray with the potatoes. Sprinkle with a little olive oil and season with salt and pepper.",
        "Put the purple asparagus in a bowl and sprinkle with lemon juice and salt to cure and soften.",
        "For the dressing, spoon the mustard and vinegar into a bowl and whisk until blended together. Slowly add the oils, still whisking, it should have a thick consistency, like a sauce. Season with a good amount of salt and black pepper.",
        "Mix all of the vegetables with the shallots, mint, chervil, watercress and pea shoots and pour over the dressing.",
        "Divide between four plates and dig in."
    ],
    "tips": [
        
    ],
    "title": "Super spring salad",
    "videos": "[]"
}