{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "over 2 hours",
    "cusine": "British",
    "description": "It may seem strange to put whole lemons in a steamed pudding but fear not. The long, gentle cooking melts the sugar to create a rich, lemony caramel and infuses the dough with citrus aromas.",
    "dishes": [
        "caramel",
        "jam",
        "pastry",
        "pie",
        "steamed_pudding"
    ],
    "flags": [
        
    ],
    "howTos": [
        "rolling_pastry",
        "steaming_puddings"
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "335g/11oz self-raising flour",
            "130g/5oz shredded suet",
            "100ml/3½fl oz milk",
            "200g/7oz slightly salted butter, cubed, plus extra for greasing",
            "200g/7oz soft light brown sugar",
            "3 large unwaxed lemons",
            "200ml/7fl oz double cream, to serve",
            "ice cream, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4-6",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "For the Sussex pond pudding, grease a 1.5 litre/2¾ pint heatproof basin or bowl.",
        "Mix the flour and suet together in a bowl. In a jug combine the milk with 100ml/3½fl oz water. Mix in enough of the milk and water to the flour and suet mixture to make a dough that is soft, but firm enough to roll.",
        "On a lightly floured work surface roll the dough into a large circle. Cut out a quarter of the circle and set aside (this will be used later to form the lid of the pudding).",
        "Place the circle of pastry into the bowl and join the cut sides together, pressing well.",
        "Place half of the butter cubes and half of the sugar in the bottom of the lined bowl.",
        "Prick the lemons all over with a larding needle or skewer, so the juices can escape, and then place the lemons on top of the butter and sugar. Cover with the remaining butter and sugar to fill the bowl.",
        "Roll out the reserved pastry into a round and place on top of the basin filling. Press the edges together to seal the pudding.",
        "Fold a pleat down the centre of a large piece of aluminium foil and cover the basin with the pleat positioned in the middle. Tie the foil in place with cooks’ string and create a handle by wrapping the string under and over the bowl (so the pudding can be easily moved when hot).",
        "Bring a large pan of water to the boil and lower the pudding into it. The water should come halfway up the sides of the bowl.",
        "Cover the pan with a lid and leave to simmer for 3-4 hours. Top up the pan with more water if it starts to dry out.",
        "To serve, carefully remove the pudding from the pan and remove the foil lid. Put a deep dish over the basin and turn the pudding out onto the dish. Serve immediately with the cream and ice cream."
    ],
    "tips": [
        
    ],
    "title": "Sussex pond pudding with cream and ice cream",
    "videos": "[]"
}