{
    "title": "Sweet banana and maple pancakes with blueberries and pecans",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Makes 6 pancakes",
    "recommendations": "1",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sweet_banana_and_maple_14272_16x9.jpg"
    ],
    "description": "This gluten-free take on the classic pancake is perfect with sliced bananas, berries and toasted nuts. They also work brilliantly with lemon and sugar. The simple and effective mix of gluten-free flours in this recipe will also work for most baking recipes. Read our guide to supercharging your pancakes. Equipment and preparation: For this recipe you will need a food processor.",
    "author": {
        "pippa_kendrick": "Pippa Kendrick"
    },
    "show": {
        
    },
    "tips": [
        "The toppings can vary depending on your tastes but antioxidant packed blueberries, potassium rich bananas, natural maple syrup and toasted pecans all add healthy fats, fibre, vitamins and protein to this delicious breakfast."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "65g/2¼oz rice flour",
            "65g/2¼oz tapioca flour",
            "½ very ripe banana",
            "300ml/10½fl oz almond milk",
            "rapeseed oil or coconut oil"
        ],
        "For the topping": [
            "1½ bananas, sliced",
            "large handful blueberries",
            "30g/1oz pecans, toasted",
            "maple syrup"
        ]
    },
    "steps": [
        "Put the flours, banana and almond milk in a food processor and blitz until you have a smooth batter approximately the consistency of single cream. Pour the mixture into a jug.",
        "Heat a 20-25cm/8-10in non-stick frying pan until hot and brush with a little oil. Pour in a little of the batter and swirl it around the pan to make a full sized pancake. Cook for 1-2 minutes, or until golden at the edges. Loosen and flip over with a spatula. Cook until golden on both sides. Repeat with the remaining batter. You can keep the cooked pancakes warm by wrapping in foil and placing in a low temperature oven.",
        "Put the pancakes on plates and top with the bananas, blueberries, pecans and maple syrup. Serve immediately."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}