{
    "author": {
        "hairy_bikers": "The Hairy Bikers"
    },
    "cookTime": "less than 10 mins",
    "description": "This is exactly like your favourite sweet and sour from the local down the road, but with fewer calories. Proves that a diet doesn’t have to be all about denial. This meal without rice provides 288 kcal, 20g protein, 38g carbohydrate (of which 29g sugars), 7g fat (of which 1g saturates), 3g fibre and 0.1g salt per portion.",
    "dishes": [
        "ketchup",
        "pie",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sweet_and_sour_chicken_52908_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 x 425g/15oz can pineapple chunks in natural juice",
            "2 tbsp cornflour",
            "2 tbsp dark soy sauce",
            "2 tbsp white wine vinegar",
            "2 tbsp soft light brown sugar",
            "2 tbsp tomato ketchup",
            "½ tsp dried chilli flakes",
            "2 boneless, skinless chicken breasts",
            "2 tbsp sunflower oil",
            "1 medium onion, cut into 12 wedges",
            "2 peppers, red, green, orange or yellow, deseeded and cut into chunks of about 3cm/1¼in",
            "1 x 225g/8oz can water chestnuts",
            "2 garlic cloves, peeled and crushed",
            "25g/1oz piece fresh root ginger, peeled and finely grated",
            "freshly ground black pepper"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "220",
    "serves": "Serves 4",
    "show": {
        "p00vq8c6": "Hairy Dieters: How to Love Food and Lose Weight"
    },
    "steps": [
        "To make the sauce, drain the pineapple in a sieve over a bowl and keep all the juice – you should have about 150ml/5fl oz. Put the cornflour in a large bowl and stir in three tablespoons of the pineapple juice to make a smooth paste. Add the remaining juice and 150ml/5fl oz water, then stir in the soy sauce, vinegar, sugar, ketchup and chilli flakes until thoroughly combined. Set aside.",
        "Cut each chicken breast into eight or nine even pieces. Heat a tablespoon of the oil in a large non-stick frying pan or wok and stir-fry the onion and peppers for two minutes over a high heat. Drain the water chestnuts and cut them in half horizontally.",
        "Add the remaining oil and the chicken to the pan and stir-fry for two minutes until coloured on all sides. Add the garlic, ginger, pineapple chunks and water chestnuts and stir-fry for 30–60 seconds.",
        "Give the cornflour and pineapple mixture a good stir and add it to the pan with the chicken and vegetables. Stir well, season with some ground black pepper and bring to a simmer. Cook for 4–6 minutes until the sauce is thickened and glossy and the chicken is tender and cooked throughout, turning the chicken and vegetables a few times. Serve with a small portion of rice."
    ],
    "tips": [
        
    ],
    "title": "Sweet and sour chicken",
    "videos": "[]"
}