{
    "author": {
        "rick_stein": "Rick Stein"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Indian",
    "description": "This is a very typical Tamil dessert; it will always be served at a Tamil wedding. A wedding that doesn’t serve payasam is not a real wedding, according to the locals. It’s slowly cooked milk reduced to the thickness of double cream and set with vermicelli and cardamom, decorated with pistachios, cashews and sultanas.",
    "dishes": [
        "pie",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "To decorate": [
            "1 tbsp ghee or butter",
            "25g/1oz cashew nuts",
            "25g/1oz pistachio nuts",
            "25g/1oz sultanas"
        ],
        "default": [
            "1 litre/1¾ pint full-fat milk",
            "1 tsp ghee or butter",
            "50g/1¾oz vermicelli, broken into rough 4cm/1½in pieces",
            "4 tbsp sugar",
            "¼ tsp ground cardamom (or seeds from 8 pods)"
        ]
    },
    "prepTime": "overnight",
    "recommendations": "3",
    "serves": "Serves 4-6",
    "show": {
        "b033rhzh": "Rick Stein's India"
    },
    "steps": [
        "Pour the milk into a large, deep-sided pan or karahi and place over a medium-high heat until it comes to the boil, then reduce the heat slightly and simmer for about 20 minutes until reduced in volume by a third.",
        "Meanwhile, heat the ghee (or butter) in a pan over a medium heat, add the vermicelli and fry for 1–2 minutes, or until lightly toasted but not browned.",
        "Once the milk has reduced, add the toasted vermicelli to the milk and simmer for a further 20 minutes, or until the vermicelli is soft and the milk reduced further.",
        "Stir in the sugar and cardamom, leave to cool slightly then pour into a serving dish, individual bowls or glasses.",
        "To decorate, heat the ghee (or butter) in a pan over a medium heat, add the cashew nuts and pistachio nuts and fry for 2-3 minutes, or until golden-brown, then stir in the sultanas. Spoon this decoration over the payasam, leave to cool, then transfer to the fridge to chill – overnight is best. Serve in small portions."
    ],
    "tips": [
        "Make the day before you plan to serve it."
    ],
    "title": "Sweet milk pudding with vermicelli (payasam)",
    "videos": "[]"
}