{
    "author": {
        "atul_kochhar": "Atul Kochhar"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Indian",
    "description": "You can whip up this easy chickpea curry with just a few store cupboard staples - perfect for a laid-back supper. This is designed to be a low cost recipe Each serving provides 551kcal, 15.5g protein, 97g carbohydrate (of which 14.5g sugars), 8g fat (of which 1g saturates), 13g fibre and 0.2g salt.",
    "dishes": [
        "curry",
        "sauce",
        "vegetable_curry"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/sweet_potato_and_68565_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "1 tbsp oil",
            "1 tbsp cumin seeds",
            "1 onion, finely sliced",
            "salt and black pepper",
            "2 garlic cloves, crushed",
            "½-1 tsp chilli flakes (to taste)",
            "50g/1¾oz root ginger, peeled and grated",
            "600g/1lb 5oz tinned chickpeas (undrained weight)",
            "1 x 400g/14oz tin tomatoes",
            "750g/1lb 10oz sweet potato, peeled and cut into bite-sized cubes",
            "200g/7oz rice"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "41",
    "serves": "Serves 4",
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "steps": [
        "Heat a large saucepan over a medium heat and add the oil. Once hot, add the cumin seeds and fry for a minute, or until aromatic. Add the onion and a pinch of salt and cook for 5-6 minutes, or until the onion is soft and translucent. Add the garlic, chilli flakes and ginger and fry for a further three minutes.",
        "Drain and rinse the chickpeas. Add to the pan with the tomatoes and sweet potato. Add enough water (approximately 500ml/18fl oz) to cover the chickpeas and sweet potatoes and bring to a simmer, stirring to mix everything together.",
        "Cover with a lid and simmer over a medium low heat, stirring now and again, for 30-40 minutes, or until the potatoes are soft and beginning to break apart and the sauce has thickened. Top up with a little more water during the cooking if needed.",
        "Meanwhile, cook the rice according to the packet instructions.",
        "Taste the curry and season to taste with salt and pepper. Serve immediately with the rice."
    ],
    "tips": [
        "In May 2013 this recipe was costed at £3.63 at Asda, £3.74 at Tesco and £3.83 at Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "title": "Sweet potato and chickpea curry",
    "videos": "[]"
}