{
    "title": "Sweet and sour slaw",
    "cookTime": "no cooking required",
    "prepTime": "less than 30 mins",
    "serves": "Serves 10-12",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Here is an exercise in chopping meditation for you! There is much to slice, but you end up with a bright tangle of slaw that feeds a crowd and has enough zing in it to bring a table of cold cuts to life.",
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "tips": [
        "Refrigerate leftovers in a covered container straightaway. It will keep in fridge for up to 3 days, though the vegetables will soften as they stand."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1 red cabbage (approx. 800g/1lb 12oz), halved",
            "4 fat or 6 skinny spring onions, trimmed",
            "2 red peppers, membranes and seeds removed",
            "1 yellow pepper, membranes and seeds removed",
            "1 orange pepper, membranes and seeds removed",
            "1 red chilli, seeds removed",
            "large bunch (approx. 100g/3½oz) fresh coriander",
            "250ml/9fl oz pineapple juice, from a carton",
            "2 limes, preferably unwaxed",
            "1½ tbsp sea salt flakes, or to taste",
            "2 tsp toasted sesame oil",
            "2 tsp maple syrup"
        ]
    },
    "steps": [
        "Shred the cabbage thinly and put into the largest bowl you have. It may be easier to use a huge saucepan as you need to toss all the ingredients together later, and even my largest mixing bowl isn’t big enough.",
        "Slice the spring onions into batons and then cut each baton into thin slices lengthways, so that you, again, have shreds. Add to the cabbage.",
        "Cut the peppers into very thin slices. Add to the cabbage and spring onions.",
        "Finely chop the red chilli, and do the same with the coriander – stalks and leaves. Add the chilli and all but a tablespoon of the chopped coriander to the cabbage bowl.",
        "In a bowl or measuring jug, mix together the pineapple juice, the zest and juice of 1 lime and the juice of half of the second. Sprinkle in the salt, add the sesame oil and maple syrup, and whisk together before pouring over the prepared vegetables. Toss to mix, then leave to stand for at least 15 minutes, and up to 2 hours, before serving. Sprinkle the reserved tablespoonful of chopped coriander over the finished slaw."
    ],
    "howTos": [
        "chopping_chillies"
    ],
    "videos": "[p03c3s2r:p03c3s2t]"
}