{
    "author": {
        
    },
    "cookTime": "no cooking required",
    "description": "These classic sandwiches with a delicious twist are perfect for afternoon tea, picnics or lunchboxes",
    "dishes": [
        "baguette",
        "bread",
        "bun",
        "mayonnaise",
        "pie",
        "sandwich",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/tea_sandwiches_59195_16x9.jpg"
    ],
    "ingredients": {
        "For the apple and cucumber sandwiches": [
            "½ lemon, juice only",
            "1 apple, core removed, chopped into small pieces",
            "¼ cucumber, finely sliced",
            "200g/7oz cream cheese",
            "½ bunch mint, chopped",
            "¼ bunch flatleaf parsley, chopped",
            "1 thin baguette, halved horizontally and lightly buttered"
        ],
        "For the egg and caper mayonnaise sandwiches": [
            "4 free-range eggs, hard-boiled, peeled, chopped",
            "3-4 tbsp mayonnaise",
            "1 tbsp capers, drained, finely chopped",
            "salt and freshly ground black pepper",
            "8 slices bread, lightly buttered",
            "small punnet cress"
        ],
        "For the smoked salmon, caper and cream cheese sandwiches": [
            "150g/5½oz cream cheese",
            "½ red onion, finely chopped",
            "1 tbsp capers, drained, finely chopped",
            "8 slices wholemeal bread, lightly buttered",
            "8 slices smoked salmon"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "10",
    "serves": "Serves 8-10",
    "show": {
        
    },
    "steps": [
        "For the apple and cucumber sandwiches, mix the apple with the lemon juice.",
        "Spoon the cream cheese into a bowl and stir in the herbs. Add the apple pieces and a little of the lemon juice.",
        "Arrange the cucumber slices along the bottom half of the baguette, slightly overlapping each slice. Spoon in the cream cheese and apple mixture and add the top half of the baguette. Slice into 5cm/2in sandwiches.",
        "For the smoked salmon, caper and cream cheese sandwiches, mix the cream cheese, red onion and capers together in a bowl.",
        "Spread this mixture onto four slices of the bread. Top with the smoked salmon and close the sandwiches with the remaining slices of bread.",
        "Remove the crusts and cut the sandwiches into quarters.",
        "For the egg and caper mayonnaise sandwiches, mix the eggs, mayonnaise and capers together in a bowl. Season, to taste with salt and freshly ground black pepper.",
        "Spread the egg mayonnaise onto four slices of the bread. Sprinkle over the cress and close the sandwiches with the remaining slices of bread.",
        "Remove the crusts and cut the sandwiches into fingers."
    ],
    "tips": [
        
    ],
    "title": "Tea sandwiches",
    "videos": "[]"
}