{
    "title": "Tea loaf",
    "cookTime": "10 to 30 mins",
    "prepTime": "over 2 hours",
    "serves": "Makes 1 loaf",
    "recommendations": "8",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/tea_loaf_75867_16x9.jpg"
    ],
    "description": "This fruit-enriched bread made with dried fruit, cinnamon and orange zest makes a wonderful afternoon tea loaf drizzled in icing sugar and slathered in butter.",
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "400g/14oz strong bread flour, plus extra for dusting",
            "1½ tsp salt",
            "40g/1½oz caster sugar",
            "40g/1½oz butter, softened, plus extra for greasing",
            "10g/¼oz fast-action dried yeast",
            "120ml/4fl oz milk",
            "50g/1¾oz sultanas",
            "60g/2¼oz glacé cherries",
            "1 tsp ground cinnamon",
            "3 oranges, zest only"
        ],
        "To serve": [
            "200g/7oz icing sugar",
            "butter, to taste"
        ]
    },
    "steps": [
        "Put the flour, salt, sugar, butter, yeast, milk and 120ml/4fl oz of water into a bowl and mix together with your hands.",
        "When all the flour has been incorporated, tip the dough onto a lightly floured work surface and knead until smooth and pliable.",
        "Return the dough to the bowl, cover with cling film and set aside to rest for an hour.",
        "Add the sultanas, cherries, cinnamon and orange zest to the dough and, using an electric mixer or your hands, work it in well.",
        "Shape the dough into a sausage shape by flattening out the dough and rolling it up.",
        "Put the dough on a greased baking tray. Slide the baking tray inside a plastic bag, to protect the dough from drafts, taking care not to allow the plastic bag to touch the top of the loaf. Leave to rise for an hour.",
        "Preheat the oven to 220C/425F/Gas 7.",
        "Bake the dough for 25-30 minutes, then transfer to a wire rack to cool.",
        "While the loaf is cooling, make the water icing. Tip the icing sugar into a bowl, add a little water and mix well to form a paste. Gradually add more water until the icing is just thick enough to coat the back of a spoon.",
        "Drizzle or spread the icing over the top of the tea loaf. Cut into slices and eat with lashings of butter."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}