{
    "author": {
        "mary_berry": "Mary Berry"
    },
    "cookTime": "10 to 30 mins",
    "description": "With no onions to chop or tomatoes to skin, this soup is quick, easy and delicious. In fact, it is one of my favourite family recipes, as I always have the ingredients in the cupboard.",
    "dishes": [
        "pesto",
        "soup",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/ten-minute_tomato_soup_10252_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "6 sun-dried tomatoes in oil",
            "2 garlic cloves, crushed",
            "3 x 400g tin chopped tomatoes",
            "500ml/18fl oz chicken or vegetable stock",
            "1 tbsp caster sugar",
            "150ml/5fl oz full-fat milk",
            "150ml/5fl oz double cream",
            "salt and freshly ground black pepper",
            "3–4 tsp basil pesto, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 6-8",
    "show": {
        "b06z8bw3": "Mary Berry's Foolproof Cooking"
    },
    "steps": [
        "Set a large, deep pan over a medium heat and add 1 tablespoon of oil from the sun-dried tomatoes. Add the garlic and stir-fry for a few seconds, or until it just starts to colour.",
        "Add the sun-dried and tinned tomatoes, stock and sugar and bring to the boil, stirring constantly. Season with salt and freshly ground black pepper, then cover with a lid, reduce the heat and simmer for 10 minutes.",
        "Remove from the heat and, using a hand blender, blend the soup in the pan. Stir in the milk and cream and season with salt and freshly ground black pepper before heating through on the hob.",
        "Serve hot with ½ teaspoon basil pesto swirled on the top of each bowl of soup."
    ],
    "tips": [
        "If covered and chilled in the fridge, this dish can be made up to 3 days ahead. Without the milk and cream, and if in a freezer proof bag or container, this dish freezes very well. Defrost and reheat until piping hot, then stir in the milk and cream before serving. The sugar brings out the flavour of the tomatoes and helps balance their acidity – sometimes they can be a little bitter. The basil pesto adds a lovely flavour, but this soup is still very good without it."
    ],
    "title": "Ten-minute tomato soup",
    "videos": "[]"
}