{
    "title": "Tequila-cured salmon",
    "cookTime": "no cooking required",
    "prepTime": "overnight",
    "serves": "Serves 8-10",
    "recommendations": "5",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/tequila_cured_salmon_40935_16x9.jpg"
    ],
    "description": "This deliciously zingy tequila-marinated salmon would make a smart starter or canapé. Serve with slices of pumpernickel bread.",
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the salmon": [
            "1kg/2lb 2oz side of salmon, skin on, pin-boned",
            "2 tbsp yellow mustard seeds",
            "1 tbsp cumin seeds",
            "4 red chillis, finely chopped",
            "3 limes, zest only",
            "300g/10½oz sea salt",
            "300g/10½oz soft light brown sugar",
            "300ml/10½oz tequila"
        ],
        "For the goats’ cheese dip": [
            "200g/7oz soft goats’ cheese",
            "100g/3½oz Greek-style yoghurt",
            "dash warm water",
            "1 tbsp chopped fresh mint",
            "1 tbsp chopped lemonbalm",
            "1 lime, zest and juice"
        ]
    },
    "steps": [
        "Place a large piece of aluminium foil on a baking tray and cover with clingfilm. Place the salmon on top, skin-side down. Pat the fish dry with kitchen paper.",
        "Toast the mustard seeds and cumin for 2-3 minutes over a medium heat. Place the spices into a pestle and mortar and grind to a coarse mixture. Add the chilli and lime zest to the spices and mix until well combined. Spread the mixture over the salmon and press well into the flesh.",
        "Place the salt, sugar and tequila in a bowl and mix until well combined. Spread over the salmon.",
        "Gather the clingfilm and foil and tightly wrap around the salmon. Place another baking tray on top of the fish and weigh it down with heavy weights. Chill in the fridge for 48 hours.",
        "For the goats’ cheese dip place all the ingredients in a bowl and mix until well combined.",
        "Slice the salmon into thin strips. Serve with the dip and slices of pumpernickel bread."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}