{
    "title": "Thai-style tuna burger with steamed rice and mango salsa",
    "cookTime": "less than 10 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 1",
    "recommendations": "",
    "images": [
        
    ],
    "description": "",
    "author": {
        "tony_tobin": "Tony Tobin"
    },
    "show": {
        "b006vcgr": "Ready Steady Cook"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the tuna burger": [
            "100g/3½oz tuna steak, finely chopped",
            "¼ stalk lemongrass, outer layer removed, finely chopped",
            "½ green chilli, seeds removed, finely chopped",
            "1cm/½in piece galangal (or ginger), peeled and finely chopped",
            "pinch salt",
            "2 tsp vegetable oil"
        ],
        "For the mango salsa": [
            "½ mango, peeled, chopped into 1cm/½in cubes",
            "½ lime, juice only",
            "small handful fresh coriander, finely chopped",
            "small handful fresh mint, finely chopped",
            "½ green chilli, seeds removed, finely chopped",
            "1 tsp soy sauce",
            "1 tbsp olive oil"
        ],
        "To serve": [
            "100g/3½oz jasmine rice, cooked according to packet instructions",
            "30g/1oz unsalted cashews, finely chopped"
        ]
    },
    "steps": [
        "For the tuna burger, place all the burger ingredients except the vegetable oil into a bowl and mix well. Place a 5cm/2in pastry cutter or chefs' ring onto a small plate and press the burger mixture into the ring. Place into the fridge to chill.",
        "For the mango salsa, place the mango, lime juice, herbs and chilli into a bowl and mix well. Place the soy sauce and olive oil into a separate bowl, whisk together and pour over the mango mixture. Stir well.",
        "Remove the tuna burger from the fridge and remove the chefs' ring or pastry cutter.",
        "Heat the oil in a small frying pan over a medium-high heat and fry the burger for 2-3 minutes on each side, or until cooked through.",
        "To serve, place the burger onto a serving plate with the cooked rice. Sprinkle over the cashew nuts and serve with a spoonful of salsa."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}