{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "Treat yourself to a nibbles masterclass with James Martin’s three ideas for using puff pastry – perfect for Christmas party canapés.",
    "dishes": [
        "bun",
        "canape",
        "jam",
        "oven-baked_dishes",
        "pastry",
        "pesto",
        "pie",
        "puff_pastry",
        "tarts"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the anchovy palmiers": [
            "2 tbsp gentlemen’s relish",
            "2 tsp double cream",
            "275g/9¾oz all-butter ready-rolled puff pastry",
            "1 free-range egg, beaten"
        ],
        "For the cheese straws": [
            "275g/9¾oz all-butter ready-rolled puff pastry",
            "100g/3½oz parmesan, finely grated",
            "100g/3½oz emmental, grated"
        ],
        "For the tomato and mozzarella tarts": [
            "275g/9¾oz all-butter ready-rolled puff pastry",
            "125g/4½oz basil pesto",
            "200g/7oz baby mozzarella balls",
            "180g/6oz baby tomatoes on the vine",
            "1 bunch fresh basil, leaves only"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 6-8",
    "show": {
        "b007x02v": "Saturday Kitchen Best Bites"
    },
    "steps": [
        "For the anchovy palmiers, preheat the oven to 200C/400F/Gas 6.",
        "In a small bowl, mix the relish with the cream.",
        "Lay the puff pastry out on a clean work surface.",
        "Spread the mixture all over the pastry, leaving a 2cm/¾in border all around the edge.",
        "Starting at one end of the pastry, roll the pastry up towards the middle.",
        "Turn the pastry around and roll the other side up towards the middle to leave two even rolls of pastry meeting in the middle.",
        "Cut the rolled up pastry into 1cm/½ thick slices. Place each slice flat onto the work surface and flatten out slightly with a rolling pin.",
        "Place the pastry pieces onto a baking tray. Brush with the beaten egg.",
        "Transfer the pastry pieces to the oven and bake for 12-15 minutes, or until golden-brown and crisp. Remove from the oven and leave to cool.",
        "For the tomato and mozzarella tarts, line a baking tray with baking parchment.",
        "Using a 5cm/2in cutter, cut out eight circles from the puff pastry and place on the lined baking tray.",
        "Place a teaspoon of pesto in the centre of the circles, leaving a 1cm/½in border.",
        "Place a mozzarella ball on top and place a cherry tomato on top of that. Brush with egg wash around the edges.",
        "Place in the oven for 12-15 minutes. Once cooked, remove and garnish with fresh basil leaves.",
        "For the cheese straws, lay the puff pastry on a work surface and brush the whole sheet of pastry with egg wash.",
        "Leaving a 2cm/¾in border around the edge, sprinkle the pastry with the two cheeses.",
        "Cut the pastry into strips 2cm/¾in wide, twist each one and place on a greased baking tray.",
        "Place in the oven to cook for 8-10 minutes, or until golden brown.",
        "To serve, place the palmiers, tarts and cheese straws on a plate and serve."
    ],
    "tips": [
        
    ],
    "title": "Three ways with puff pastry",
    "videos": "[]"
}