{
    "author": {
        "raymond_blanc": "Raymond Blanc"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A beautiful summer vegetable risotto with tomatoes, squash and fennel. Go the whole hog and make Raymond's tomato essence.",
    "dishes": [
        "oven-baked_dishes",
        "pie",
        "risotto",
        "salad",
        "sauce",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/tomatorisotto_92965_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "2 tbsp olive oil, plus extra for drizzling",
            "½ onion, finely chopped",
            "¼ garlic clove, crushed",
            "200g/7oz risotto rice, such as carnaroli",
            "Salt and freshly ground black pepper",
            "150g/5oz butternut squash, peeled and cut into 1cm/½in cubes",
            "300ml/10½fl oz water",
            "300ml/10½fl oz tomato essence or passata",
            "10 cherry tomatoes, halved",
            "2 baby courgettes, halved lengthways and sliced into 1cm/½in thick pieces",
            "1 baby fennel, sliced",
            "½ tsp coriander seeds, lightly crushed",
            "80g/3oz peas",
            "2 tbsp mascarpone cheese",
            "4 tsp freshly grated parmesan, plus extra for sprinkling",
            "4 tbsp baby salad leaves"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "7",
    "serves": "Serves 2",
    "show": {
        "b00yk23k": "Raymond Blanc's Kitchen Secrets"
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Heat a pan over a medium heat, add the olive oil and gently fry the onion for 3-4 minutes, or until tender. Add the garlic and fry for a further minute.",
        "Add the rice, stirring well to coat in the olive oil. Fry for 1-2 minutes, or until the rice is translucent. Season with salt and freshly ground black pepper.",
        "Add the butternut squash to the pan and mix well. Add the water and half of the tomato essence, then bring to a gentle simmer. Cover with a lid and cook for 15 minutes.",
        "Place the remaining tomato essence into a saucepan and warm through.",
        "Meanwhile, place the halved cherry tomatoes onto a baking tray, drizzle with a little olive oil and season with salt and freshly ground black pepper. Roast in the oven for 5-6 minutes, or until the tomatoes are just tender and collapsed slightly.",
        "By now, the rice should have absorbed all of the liquid. Remove the lid and stir well. Add the courgettes, baby fennel and coriander seeds and cook for a couple of minutes. Add the peas, mascarpone and parmesan and stir well, adding a little extra tomato essence if the risotto is too dry.",
        "To serve, spoon the risotto into a small serving bowl. Top with a few roasted tomatoes, a little sprinkling of parmesan and some micro leaves. Spoon over the warmed tomato essence."
    ],
    "tips": [
        
    ],
    "title": "Tomato risotto",
    "videos": "[]"
}