{
    "author": {
        "paul_hollywood": "Paul Hollywood"
    },
    "cookTime": "10 to 30 mins",
    "description": "Like a self-contained Boxing Day sandwich, this sweet and savoury bun combines classic Christmas flavours in a soft white dough.",
    "dishes": [
        "bun",
        "oven-baked_dishes",
        "pie",
        "sandwich",
        "sauce",
        "sausage",
        "stir-fries",
        "stuffing"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/turkey_stuffing_and_77957_16x9.jpg"
    ],
    "ingredients": {
        "default": [
            "500g/1lb 2oz strong white flour, plus extra for dusting",
            "50g/2oz caster sugar",
            "10g/¼oz salt",
            "40g/1½oz unsalted butter cut into small pieces, plus extra for greasing the tin",
            "2 free-range eggs",
            "2 x 7g sachets fast-acting dried yeast",
            "150ml/5fl oz lukewarm milk",
            "90ml/6 tbsp lukewarm water",
            "280g/10oz cranberry sauce",
            "300g/10½oz roast turkey, shredded",
            "200g/7oz leftover sage and onion stuffing"
        ]
    },
    "prepTime": "over 2 hours",
    "recommendations": "40",
    "serves": "Makes 10-12 buns",
    "show": {
        "b013pqnm": "The Great British Bake Off"
    },
    "steps": [
        "Place the flour, caster sugar and salt into a large mixing bowl and stir to combine. Add the butter, eggs, yeast, milk and warm water.",
        "Mix the ingredients with your hands until a rough dough is formed.",
        "Tip the dough onto a well-floured surface and knead well for ten minutes, or until the dough is smooth and elastic.",
        "Place the dough into a clean, oiled bowl , cover with a damp tea towel and leave to rise for one hour.",
        "Tip the dough out onto a very lightly floured surface.",
        "Roll out the dough into a rectangle about 50x28cm/20x11in. Turn the dough so that the longer edge is closest to you and “tack” the dough to the work surface by pressing it down firmly with your finger.",
        "Spread cranberry sauce onto the surface of the dough with the back of a spoon. Sprinkle the shredded turkey and stuffing on top.",
        "Roll the long side of the dough towards you quite tightly, forming a spiral inside. When rolled up, release the tacked edge and place it onto a floured part of the surface. With a sharp knife cut the sausage shape into 5cm/2in rounds.",
        "Place all spiral rounds, swirly side up, into a large, deep roasting tin or baking tray greased thoroughly with butter, leaving a 1cm/½in space between each one. You want them to be close enough so that they will bake with their sides touching.",
        "Cover with a damp tea towel and set aside in a warm place to rise for an hour. They should have expanded and be touching each other.",
        "Preheat the oven to 200C/400F/Gas 6.",
        "When the buns are ready, put them in the oven and bake for 15-20 minutes.",
        "After removing the buns from the oven, let them cool slightly before removing them from the tin and placing on a cooling rack.",
        "When ready to eat, pull the buns apart to reveal the soft edges."
    ],
    "tips": [
        
    ],
    "title": "Turkey, stuffing and cranberry Chelsea buns",
    "videos": "[]"
}