{
    "title": "Turkish spiced chicken with flatbreads and green relish",
    "cookTime": "10 to 30 mins",
    "prepTime": "over 2 hours",
    "serves": "Serves 4-6",
    "recommendations": "10",
    "images": [
        
    ],
    "description": "Spice up your chicken with a zingy Turkish marinade. Make your own flatbreads and whip up a hot green relish for a real taste of the Middle East.",
    "author": {
        "diana_henry": "Diana Henry"
    },
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "For the chicken": [
            "6 tbsp olive oil",
            "½ tsp ground cinnamon",
            "¾ tsp cayenne pepper",
            "1 tsp ground cumin",
            "2 garlic cloves, grated",
            "6 boneless chicken thighs, skin removed",
            "salt and freshly ground black pepper"
        ],
        "For the relish": [
            "2 garlic cloves, chopped",
            "sea salt flakes",
            "1 green chilli, halved, seeds removed, roughly chopped",
            "1 red chilli, halved, seeds removed, roughly chopped",
            "15g/½oz fresh coriander, roughly chopped",
            "8 sprigs of mint, leaves only, roughly torn",
            "70g/2½oz pitted green olives, roughly chopped",
            "6 tbsp extra virgin olive oil",
            "2 tbsp white balsamic vinegar",
            "good squeeze of lemon juice"
        ],
        "For the flatbreads": [
            "200g/7oz plain flour",
            "½ tsp salt",
            "2 tbsp ghee, melted"
        ],
        "For the green salad": [
            "¼ cucumber, sliced",
            "handful of baby leaves",
            "3 tbsp olive oil",
            "1 tbsp white wine vinegar",
            "1 tsp Dijon mustard"
        ],
        "To serve": [
            "lemon wedges",
            "200ml/7fl oz Greek yoghurt"
        ]
    },
    "steps": [
        "For the chicken, make a marinade by mixing the olive oil, cinnamon, cayenne, cumin, garlic, salt and pepper together in a mixing bowl.",
        "Make little slits all over the undersides of the chicken with the point of a knife. Put the chicken in the marinade, turning to coat. Cover with cling film and put in the fridge. Leave in the fridge for a couple of hours, or overnight. Making sure to bring it to room temperature before cooking.",
        "To make the relish, put the garlic and sea salt in a pestle and mortar and bash it until it is crushed. Add the chillies, coriander, mint and olives and bash everything together. Gradually add the extra virgin olive oil and balsamic vinegar until you have a rough paste (it should be chunky, not puréed). Add lemon juice to taste and set aside.",
        "To make the flatbreads, put the flour in a medium bowl, add the salt and stir. Add enough water until the flour mix comes to a dough. Knead until smooth and divide into 4 pieces. Roll each piece into a circle and put on a hot griddle pan one at a time. Turn the bread over once charred marks have appeared and brush with the melted ghee.",
        "For the green salad, put the cucumber and leaves in a large bowl. Pour the olive oil and white wine vinegar in a small bowl and whisk in the mustard. Just before serving pour the dressing over the salad and mix.",
        "To cook the chicken, heat a griddle pan. Remove the chicken from the marinade, shaking off the excess. Cook the chicken over a medium heat, for about 2 minutes on each side. Reduce the heat to low and cook for another 4 minutes, or until cooked through.",
        "Put the chicken on a plate and serve with the flatbreads, chutney, green salad, lemon wedges and a bowl of Greek yoghurt."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}