{
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "cookTime": "10 to 30 mins",
    "cusine": "Italian",
    "description": "Cesare Casella, a chef from Lucca, whose family used to run the fabulous Vipore restaurant and who is now cooking in New York, is the man who invented Tuscan fries. Think French fries, but with garlic cloves and fresh herbs thrown into the hot oil towards the end of the cooking time.",
    "dishes": [
        "chips",
        "oven-baked_dishes",
        "stir-fries"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1kg/2lb 4oz waxy potatoes",
            "1.5L/2½pt corn oil or flavourless vegetable oil",
            "1 head garlic, cloves separated but not peeled",
            "8 sprigs thyme, rosemary or sage, or herbs of your choice",
            "sea salt flakes, to taste"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "17",
    "serves": "Serves 4-6",
    "show": {
        "b01n2y25": "Nigellissima"
    },
    "steps": [
        "Cut the short ends off each potato (but don’t peel it) so that it can sit up vertically, and then slice it downwards into generous 1cm/½in slices. Cut these slices into chips about 1cm thick, again, err on the generous side. Load up a clean tea towel with the chips as you cut them.",
        "Put the oil into a wide, heavy-based pan (mine is approximately 28cm/11in diameter and 11cm/4in deep), and add the freshly cut potatoes. Then put the pan over a high heat and bring to a boil, which should take about five minutes. Keep a careful watch on the pan at all times.",
        "Continue to cook the fries, without stirring them, for another 15 minutes. Once the oil temperature reaches 160C/325F, turn down the heat slightly and keep the fries cooking at between 150-160C. The pan will be bubbling vigorously. If the oil gets too hot or bubbles too hard, reduce the heat a little, and always keep a close eye on it.",
        "Now you can very carefully give the chips a gentle stir with a pair of tongs held in an oven glove, moving any that have stuck away from the bottom or sides of the pan. Add the unpeeled cloves of garlic to the pan, stir gently again, and cook for another 5-10 minutes (watching the temperature and making sure the garlic doesn’t look burnt or the fries too dark), before testing a chip for crispness on the outside and tenderness on the inside. Do not burn your mouth, though! You might need another five minutes or so beyond this, but stand by your pan, the chips can turn from a cooked gold to a burnt bronze quickly.",
        "At the point when the chips are pale gold, but crisp, toss in the herbs, then after a minute or so scoop everything out – using a couple of perforated scoops for ease, and wearing oven gloves to protect your hands – onto a tray or platter lined with a double thickness of kitchen roll. Once any excess oil has been absorbed, tip the chips off the kitchen paper clatteringly onto the plate and sprinkle with sea salt flakes to taste, serving immediately."
    ],
    "tips": [
        
    ],
    "title": "Tuscan fries",
    "videos": "[p00yw8fh:p00yw8j7]"
}