{
    "author": {
        "ching-he_huang": "Ching-He Huang"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "Chinese",
    "description": "These mini pies are an Asian take on the classic chicken and mushrooms pies. Perfect for impressing friends at a party. For this recipe you will need a muffin tray and two pastry cutters (5cm/2in and 10cm/4in).",
    "dishes": [
        "oven-baked_dishes",
        "pastry",
        "pie",
        "sauce",
        "stir-fries",
        "stock"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "300g/10½ oz chicken breasts",
            "1 tbsp rapeseed oil",
            "½ onion, diced",
            "50g/1¾oz frozen peas",
            "6 fresh shiitake mushrooms, diced",
            "1 tbsp Shaoxing rice wine",
            "½ tsp Chinese five-spice powder",
            "150ml/5fl oz chicken stock",
            "150ml/5fl oz double cream",
            "1 tbsp chopped fresh tarragon leaves",
            "1 tbsp light soy sauce",
            "sea salt and ground black pepper",
            "3 sheets puff pastry",
            "1 free-range egg"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Makes 12 mini pies",
    "show": {
        "b04wl5mz": "Series 3"
    },
    "steps": [
        "Preheat the oven to 180C/160C Fan/Gas 4.",
        "Poach the chicken in a large lidded pan with water. Cover with the lid and bring to the boil, reduce the heat and simmer for 20 minutes or until the chicken is cooked through. Remove the chicken from the pan and leave to cool. Once cool, shred the chicken.",
        "Heat a wok over a high heat. Add the rapeseed oil and stir fry the onions until slightly translucent, then add the peas, mushrooms and rice wine. Stir fry for a minute. Add the shredded chicken and Chinese five spice and cook for 30 seconds. Add the stock and stir well. Pour in the double cream and tarragon. Season with soy sauce, salt and black pepper. Set aside.",
        "Roll out the pastry to about 3mm/⅛in thick. Using pastry cutters, cut out enough pastry to line the bases of the muffin tray and create the pie tops.",
        "Line the tray with the pastry then spoon the filling on top. Beat an egg, top the pies with pastry and glaze with the egg.",
        "Bake for 25 minutes until the pastry is risen and golden-brown. Serve warm."
    ],
    "tips": [
        
    ],
    "title": "Umami chicken and shiitake mushroom pies",
    "videos": "[]"
}