{
    "author": {
        "simon_rimmer": "Simon Rimmer"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "American",
    "description": "Make these light-as-a-feather cupcakes with their pretty pink decoration for someone you love.",
    "dishes": [
        "cake",
        "cupcakes",
        "icing",
        "oven-baked_dishes"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/valentinecupcake_93564_16x9.jpg"
    ],
    "ingredients": {
        "For the cakes": [
            "125g/4oz unsalted butter, softened",
            "125g/4oz caster sugar",
            "2 free-range eggs",
            "125g/4oz self-raising flour",
            "150g/5oz raspberries",
            "6 passion fruit, sieved pulp only",
            "a little milk, to loosen the mixture as necessary"
        ],
        "For the icing": [
            "500g/1lb 1½oz icing sugar",
            "160g/5½oz butter",
            "1 vanilla pod, seeds only",
            "2-3 drops pink liquid food colouring",
            "50ml/1¾oz milk",
            "hundreds and thousands"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "30",
    "serves": "Makes 12",
    "show": {
        "b006v85g": "Something for the Weekend"
    },
    "steps": [
        "For the cakes, preheat the oven to 180C/350F/Gas 4. Sit 12 paper cases in a muffin tray.",
        "Beat the butter and sugar in a bowl until pale and creamy. Add the eggs, one at a time, and beat until well combined.",
        "Fold the flour, raspberries and passion fruit pulp into the mixture until almost smooth. If the mixture looks too stiff, add a little milk, as necessary.",
        "Divide the mixture among the paper cases then bake for 20 minutes. Remove from the oven and set aside to cool in the tin for 10 minutes. Turn the cakes out onto a wire rack and set aside until completely cooled.",
        "For the icing, using an electric whisk, cream the icing sugar and butter together until light and fluffy. Whisk in the vanilla pod seeds and food colouring. Gradually whisk in enough milk to form a smooth paste.",
        "Spoon the icing into a piping bag with a large star-shaped nozzle and pipe the icing over the cake. Sprinkle over the hundreds and thousands."
    ],
    "tips": [
        
    ],
    "title": "Valentine cupcakes",
    "videos": "[]"
}