{
    "title": "Vegetarian Lancashire hotpot",
    "cookTime": "1 to 2 hours",
    "prepTime": "less than 30 mins",
    "serves": "Serves 4",
    "recommendations": "6",
    "images": [
        
    ],
    "description": "Packed with goodness, tasty vegetables and layered slices of potato, this hotpot is easy on the wallet too. This is designed to be a low cost recipe.",
    "author": {
        "nigel_haworth": "Nigel Haworth"
    },
    "show": {
        "b036x3pv": "Great British Budget Menu"
    },
    "tips": [
        "Most box graters have a vegetable slicer option which will make thinly slicing the potatoes easier. However, if you can't get them thin enough simply cook the potato slices for a little longer in step 4. In May 2013 this recipe was costed at £2.85 at Asda, £2.86 at Tesco and £3.20 at Sainsbury’s. This recipe is designed to be made in conjunction with a low-cost store-cupboard."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "1 tbsp olive oil",
            "2 onions, finely chopped",
            "4 carrots, chopped",
            "½ swede, chopped",
            "200g/7oz parsnips, chopped",
            "50g/1¾oz plain flour",
            "750ml/1⅓ pint vegetable stock, made from stock cube",
            "4 tbsp pearl barley",
            "3 sprigs thyme, leaves only",
            "900g/2lb potatoes, sliced into 2mm slices",
            "25g/1oz butter",
            "salt and black pepper"
        ]
    },
    "steps": [
        "Preheat the oven to 200C/400F/Gas 6.",
        "Heat a large saucepan over a medium heat. Add the oil and, once hot, add the onion and a pinch of salt. Cook the onions for 4-5 minutes, or until softened. Add the carrots, swede and parsnip, plus another pinch of salt. Place a lid on and gently fry for 10 minutes, or until softened a little.",
        "Remove the lid, sprinkle in the flour and stir around to coat the vegetables and soak up any cooking juices. Add the stock, pearl barley and thyme and stir to mix well. Simmer for 15-20 minutes to thicken. Add salt and pepper to taste.",
        "Meanwhile, heat a large pan of water and cook the sliced potato in boiling water for 1-2 minutes to soften slightly. Drain and then put them into cold water to cool them and make them easier to handle.",
        "Pour the vegetable mix into a large ovenproof dish about 21x29cm/8x12in. Arrange the potato slices over the top of the vegetables, seasoning between layers with salt and pepper to taste and finishing with a neat layer of slices. Dot over the butter and finish with a pinch of salt and pepper. Place into the preheated oven and cook for 45-50 minutes, or until the filling is bubbling and the potatoes are golden-brown on top."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}