{
    "author": {
        "lets_get_cooking": "Let's Get Cooking"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "This is a classic recipe with a cheat’s method – popping it in the microwave speeds it up and gives you time to do other things. It’s also great for using up leftover vegetables in your fridge.",
    "dishes": [
        "crumble",
        "risotto",
        "stir-fries",
        "stock"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "1 medium onion, finely chopped",
            "1 tbsp olive oil",
            "1 garlic clove, finely chopped or crushed",
            "350g/12oz risotto rice",
            "1 vegetable stock cube",
            "1 x 400g/14oz can flageolet beans in water",
            "1 x 198g/7oz can sweetcorn",
            "125g/4½oz green beans",
            "100g/3½oz frozen peas",
            "40g/1½oz parmesan cheese or low-fat mature cheddar cheese, finely grated",
            "2 tbsp chopped parsley to garnish (optional)",
            "25g/1oz butter"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4",
    "show": {
        
    },
    "steps": [
        "Put the onion in a microwave-safe bowl. Add the oil and stir well.",
        "Heat for two minutes on full power.",
        "Add the garlic and rice to the onions. Stir well and heat for a further two minutes.",
        "Meanwhile, measure 1 litre/1¾ pints boiling water into a measuring jug, crumble in the stock cube and stir to dissolve. Add the stock to the rice, stir well, cover with a lid or cling film, leaving a small area open, and cook for 10 minutes on full power.",
        "While the rice is cooking, open the can of flageolet beans and drain and rinse them. Drain the canned sweetcorn and wash and chop the green beans into 2.5cm/1in sticks.",
        "Stir the rice well before mixing in the green and flageolet beans; then cover and cook for five minutes.",
        "Mix the sweetcorn and frozen peas into the rice, cover and cook for a final three minutes.",
        "Lastly, stir in the grated cheese and butter, sprinkle with chopped parsley and serve immediately."
    ],
    "tips": [
        "You can swap the vegetables and beans for whatever you have in your fridge and cupboards, such as broccoli, spinach, fresh or canned tomatoes, chickpeas and different kinds of beans."
    ],
    "title": "Vegetable risotto",
    "videos": "[]"
}