{
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "British",
    "description": "Tom's beautifully seasoned Scotch eggs are fit to grace any Boxing Day spread. Dish up with homemade apple sauce.",
    "dishes": [
        "bread",
        "jam",
        "oven-baked_dishes",
        "sauce"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Scotch eggs": [
            "150g/5½oz onion, finely chopped",
            "butter, for frying",
            "350g/12oz coarse venison mince",
            "150g/5½oz pork belly, coarsely minced",
            "1½ tsp chopped thyme",
            "1 garlic clove, grated",
            "½ tsp ground mace",
            "¼ ground juniper",
            "½ tsp table salt, plus extra to serve",
            "½ tsp coarsely ground black pepper",
            "6 quails’ eggs, soft boiled, shells removed",
            "5 free-range eggs, beaten",
            "100g/3½oz plain flour",
            "200g/7oz panko breadcrumbs",
            "vegetable oil, for deep frying"
        ],
        "For the apple purée": [
            "100g/3½oz sugar",
            "15g/½oz lemon juice",
            "4 Bramley apples, peeled, sliced and cored"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Makes 6 Scotch eggs",
    "show": {
        "b03lsr84": "Christmas Kitchen with James Martin"
    },
    "steps": [
        "For the apple sauce, in a saucepan, bring 300ml/10½fl oz water, the sugar and lemon juice to the boil. Add the sliced apple and cook until soft.",
        "Blend to a purée using a hand-held blender, then pass through a sieve and leave at room temperature.",
        "For the Scotch eggs, gently fry the onions in a little butter until soft but not coloured. Set aside to cool.",
        "In a bowl combine the venison mince, pork belly mince, thyme, cooled onions, garlic, mace, juniper, salt and pepper. Divide the mixture into 85g/3oz balls. Press your thumb into the middle of each ball to make a hole. Push a quails’ eggs into each hole, then push the mince over the top to encase the quails' egg. Place on a baking tray and transfer to the fridge to chill.",
        "Preheat a deep-fat fryer to 180C/350F and preheat the oven to 180C/350F/Gas 4 (CAUTION: hot oil can be dangerous. Do not leave unattended.)",
        "Put the beaten eggs, flour and breadcrumbs in separate bowls. Roll the Scotch eggs into the flour, patting off any excess. Coat the Scotch egg fully in beaten egg, letting any excess drip off. Finally roll the Scotch eggs in breadcrumbs until fully covered.",
        "Gently place the Scotch eggs into the basket of the deep-fat fryer and lower into the fat. Cook until golden-brown (approximately five minutes). Carefully remove with a slotted spoon and transfer to a plate lined with kitchen roll.",
        "Transfer to the oven for three minutes to ensure the meat is cooked and the egg is warm and still beautifully runny. Remove from the oven sprinkle with a little salt and serve with the apple sauce."
    ],
    "tips": [
        
    ],
    "title": "Venison Scotch eggs and apple purée",
    "videos": "[]"
}