{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "30 mins to 1 hour",
    "description": "A traditional Victoria sponge with a sweet caramelised strawberry topping.",
    "dishes": [
        "cake",
        "caramel",
        "compote",
        "icing",
        "jam",
        "oven-baked_dishes",
        "stir-fries",
        "victoria_sponge"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the Victoria sponge": [
            "250g/9oz butter, at room temperature, plus extra for greasing",
            "250g/9oz caster sugar",
            "pinch salt",
            "5 free-range eggs",
            "250g/9oz self-raising flour, plus extra for dusting"
        ],
        "For the fresh cream and caramel dipped strawberries": [
            "100g/3½oz sugar",
            "150g/5½oz strawberries, stems left on",
            "400ml/14fl oz double cream, whipped",
            "icing sugar, for dusting"
        ],
        "For the strawberry compôte": [
            "500g/1lb 2oz strawberries, hulled and cut in half if large",
            "500g/1lb 2oz jam sugar",
            "½ lemon, juice only"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "1",
    "serves": "Serves 6-8",
    "show": {
        
    },
    "steps": [
        "For the Victoria sponge, preheat the oven to 190C/375F/Gas 5. Lightly grease and flour two 20cm/8in loose-bottomed sponge tins, at least 4cm/1½in deep, and line the bases with baking parchment.",
        "Beat together the butter, sugar and a pinch of salt until pale and well creamed. Gently whisk the eggs in a small bowl and then add them, a little at a time, to the creamed butter mixture. Fold in the flour and divide the mixture between the two lined tins.",
        "Bake for 25-30 minutes or until well-risen and golden-brown on top. Remove from the oven and turn the cakes out onto a wire cooling rack. Peel off the baking parchment and leave to cool completely.",
        "For the strawberry compôte, tip the strawberries, sugar and lemon juice into a large pan and stir over a moderate heat for 2-3 minutes, or until the sugar has dissolved. Turn up the heat and boil for five minutes – this is an “instant jam” so you don’t have to check for setting point. Remove from the heat, pour into a tray and set aside to cool.",
        "For the caramel dipped strawberries, heat the sugar in a small pan over a moderate heat until it starts to turn a pale caramel colour. Remove from the heat and, holding the stems, carefully dip the strawberries into the caramel. (CAUTION: sugar gets very hot. Take care not to burn yourself.) Set aside on a non-stick mat or greaseproof paper to cool.",
        "To serve, put the whipped cream in a piping bag. Place one of the sponges on a plate or cake stand and spread with the jam and pipe the cream on top of the strawberry jam. Place the second sponge on top and dust with icing sugar. Finish by arranging the caramel-dipped strawberries on top of the cake."
    ],
    "tips": [
        
    ],
    "title": "Victoria sponge cake with strawberry compôte, fresh cream and caramel dipped strawberries",
    "videos": "[]"
}