{
    "author": {
        "james_martin": "James Martin"
    },
    "cookTime": "10 to 30 mins",
    "description": "An indulgent dessert that children will love. Swap the ice cream for yoghurt if you prefer your waffles as a breakfast dish. Equipment and preparation: for this recipe you will need a waffle maker.",
    "dishes": [
        "compote",
        "jam",
        "oven-baked_dishes",
        "sauce",
        "waffles"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the strawberry compôte": [
            "75g/3oz caster sugar",
            "25g/1oz butter",
            "250g/9oz strawberries, hulled",
            "1 lemon, zest only",
            "500ml/18fl oz vanilla ice cream, to serve",
            "4-8 tbsp maple syrup, to serve"
        ],
        "For the waffles": [
            "250g/9oz plain flour",
            "1½ tsp baking powder",
            "1 tsp salt",
            "1 tbsp caster sugar",
            "3 free-range eggs, lightly beaten",
            "425ml/¾ pint full-fat milk",
            "110g/4oz melted butter, plus extra for greasing"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "3",
    "serves": "Serves 4",
    "show": {
        "b04xycrx": "James Martin: Home Comforts"
    },
    "steps": [
        "For the waffles, preheat a waffle maker to a medium setting and preheat the oven to 140C/275F/Gas 1.",
        "Mix the flour, baking powder, salt and sugar in a large mixing bowl. Whisk in the eggs, milk and butter until well combined.",
        "Brush the waffle maker with a little melted butter and then ladle some of the batter into each well of the waffle maker. Close the lid and cook for five minutes, or until golden-brown and crisp. Remove and place on a tray in the oven to keep warm, while you use the rest of the batter.",
        "For the strawberry compôte, place the sugar and five tablespoons of water with the butter in a saucepan. Add the strawberries and lemon zest. Simmer for five minutes.",
        "To serve, stack the waffles onto each of four plates, top with some strawberry compôte and a dollop of vanilla ice cream. Finish with a drizzle of maple syrup."
    ],
    "tips": [
        
    ],
    "title": "Waffles with strawberry compôte and ice cream",
    "videos": "[p01sxnd5:p01sxndb]"
}