{
    "title": "Walnut-crusted pork chops with figs",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "less than 30 mins",
    "serves": "Serves 6",
    "recommendations": "6",
    "images": [
        "http://ichef.bbci.co.uk/food/ic/food_16x9_608/recipes/walnut-crusted_pork_79537_16x9.jpg"
    ],
    "description": "For a true taste of Croatia try this wonderful pork with a walnut crust. Making your own sauce with figs brings some extra flavour.",
    "author": {
        "rick_stein": "Rick Stein"
    },
    "show": {
        "b0667qf6": "Rick Stein: From Venice to Istanbul"
    },
    "tips": [
        
    ],
    "flags": [
        
    ],
    "ingredients": {
        "default": [
            "6 large thick-cut pork chops",
            "1 tsp ground cinnamon",
            "1 tsp freshly grated nutmeg",
            "100g/3½oz walnuts, finely chopped",
            "2 tbsp olive oil",
            "70g/2½oz butter, softened",
            "125ml/4fl oz white wine",
            "16 dried figs, finely chopped",
            "125ml/4fl oz chicken stock",
            "1 tbsp roughly chopped flatleaf parsley",
            "1 lemon, juice only",
            "salt and freshly ground black pepper"
        ]
    },
    "steps": [
        "Season the pork chops with salt and pepper and score the flesh with a sharp knife.",
        "In a shallow roasting tin, mix the cinnamon, nutmeg and walnuts. Add the olive oil to make a paste. Roll the chops in the nuts, pushing the crumb into the flesh.",
        "Melt 40g/1½oz of the butter in a large non-stick lidded frying pan and brown the chops two at a time, being careful not to burn the walnuts. This will take a few minutes each side.",
        "Return all the chops to the pan, cover with a lid and cook for 10 minutes over a medium heat, or until cooked through. Transfer the pork chops to a warmed plate and cover with foil to keep warm.",
        "Deglaze the pan with the white wine, continue to cook until the volume of the liquid has reduced by half. Add the chopped figs and chicken stock, season to taste. Whisk in the remaining butter, the parsley and lemon juice.",
        "Serve the pork chops with the sauce spooned over."
    ],
    "howTos": [
        "how_to_deglaze_a_pan"
    ],
    "videos": "[]"
}