{
    "author": {
        "michael_caines": "Michael Caines"
    },
    "cookTime": "30 mins to 1 hour",
    "cusine": "French",
    "description": "",
    "dishes": [
        "bread",
        "ciabatta",
        "oven-baked_dishes",
        "pie",
        "salad"
    ],
    "flags": [
        "Vegetarian"
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "For the marinade for the Provencal vegetables": [
            "290ml/½ pint extra virgin olive oil",
            "100ml/3½fl oz balsamic vinegar",
            "1 clove of garlic, sliced",
            "3 sprigs of thyme",
            "10 basil leaves"
        ],
        "default": [
            "ciabatta bread",
            "1 red pepper",
            "1 yellow pepper",
            "1 aubergine",
            "1 courgette",
            "goats cheese log",
            "extra virgin olive oil",
            "fresh basil"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "",
    "serves": "Serves 4 as a starter",
    "show": {
        "b006v5y2": "Saturday Kitchen"
    },
    "steps": [
        "Mix all the marinade ingredients together in a large bowl.",
        "preheat the oven to 160C/325F/Gas 3. Take a roasting tray and line it with a piece of aluminium foil large enough to cover and envelope the peppers.",
        "Place the peppers into the tray, season with salt and pepper and pour some olive oil over the peppers. Seal them in the foil and place into the oven for 20 minutes, turning from time to time.",
        "Once cooked, remove from the tray, place into a bowl and cover with cling film. Once cool, peel and wash off any seeds. Cut into large, but even triangles and place into the marinade.",
        "Slice the courgettes and aubergines into 5mm/¼in thick rounds, (if the aubergines are very thick then cut them in half first).",
        "Using a hot griddle frying pan, grill the courgettes and aubergines with some olive oil and season with salt and pepper. Cook both sides and then place into the marinade with the peppers.",
        "Slice the ciabatta bread into thick slices. Brush with olive oil and toast both sides until golden brown. Now top with the Provencal vegetables and slices of goats cheese.",
        "Place under a moderate grill and cook until the cheese has melted and coloured slightly. Remove the outer skin if you wish and serve with a salad."
    ],
    "tips": [
        
    ],
    "title": "Warm Provençal vegetables with melted goats cheese on a toasted ciabatta bread",
    "videos": "[]"
}