{
    "title": "Warm spiced cauliflower and chickpea salad with pomegranate seeds",
    "cookTime": "10 to 30 mins",
    "prepTime": "less than 30 mins",
    "serves": "Serves 2",
    "recommendations": "25",
    "images": [
        
    ],
    "description": "This is one of my favourite suppers, although there’s nothing that says you can’t serve this as a vegetable side. And you could also bolster it further by crumbling in some feta. But for me, it is perfect just as it is.",
    "author": {
        "nigella_lawson": "Nigella Lawson"
    },
    "show": {
        "b06nvzk6": "Simply Nigella"
    },
    "tips": [
        "Cool leftovers, then cover and refrigerate within 2 hours of making. They will keep in fridge for up to 2 days. This dish is very good cold, making it a fabulous packed lunch."
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "default": [
            "3 tbsp regular olive oil",
            "½ tsp ground cinnamon",
            "2 tsp cumin seeds",
            "1 small head cauliflower, trimmed and divided into small florets",
            "250g/9oz home-cooked chickpeas (drained weight) or a 400g tin chickpeas",
            "1–2 tbsp harissa, to taste",
            "4 small ripe vine tomatoes (approximately 150g/5½oz), quartered",
            "1 tsp sea salt flakes, or to taste",
            "3–4 tbsp pomegranate seeds",
            "large bunch (approximately 100g/3½oz) flatleaf parsley"
        ]
    },
    "steps": [
        "Preheat the oven to 220C/200C Fan/Gas 7.",
        "Pour the oil into a large bowl, add the cinnamon and cumin seeds, and stir. Tip in the cauliflower and toss to coat. Pour into a small oven tray (I mostly use a disposable foil baking tray measuring 30x20cm/12x8in) and place in the oven for 15 minutes. Don’t wash out the bowl you’ve been using.",
        "Add the chickpeas to the bowl, and add the harissa, tasting it first to see if you want both tablespoonfuls. Toss to coat. Add the tomatoes to the bowl, and stir to mix.",
        "Remove the cauliflower and quickly tip the chickpeas and tomatoes over the cauliflower. Toss to combine and return to the oven for 15 minutes, or until the cauliflower is tender.",
        "Remove from the oven and sprinkle the salt over the vegetables, add half of the pomegranate seeds and toss to combine. Divide between 2 bowls. Divide the parsley leaves – without chopping them – between the 2 bowls and toss to mix. Scatter with the remaining pomegranate seeds and serve."
    ],
    "howTos": [
        
    ],
    "videos": "[p036n1zt:p036n1zy]"
}