{
    "title": "Watercress soup with garlic croûtons and soft pickled quails’ eggs",
    "cookTime": "30 mins to 1 hour",
    "prepTime": "overnight",
    "serves": "Serves 6",
    "recommendations": "",
    "images": [
        
    ],
    "description": "Take your watercress soup to new heights by topping it with croûtons and watercress oil, revealing pickled quails’ eggs and chopped apple below. Equipment and preparation: you will need a clean muslin cloth and a thermometer.",
    "author": {
        "tom_kerridge": "Tom Kerridge"
    },
    "show": {
        "b0424667": "Spring Kitchen with Tom Kerridge"
    },
    "tips": [
        
    ],
    "flags": [
        "Vegetarian"
    ],
    "ingredients": {
        "For the pickled quails’ eggs": [
            "100g/3½oz caster sugar",
            "50g/1¾oz white wine vinegar",
            "5 white peppercorns",
            "½ tsp fennel seeds",
            "½ tsp coriander seeds",
            "6 quails’ eggs"
        ],
        "For the watercress soup": [
            "500g/1lb 2oz blanched watercress (about 300-400g/10½-14oz uncooked weight))",
            "salt, to taste",
            "200g/7oz onions, roughly chopped",
            "250g/9oz potato, peeled and chopped",
            "1 Granny Smith apple, finely diced"
        ],
        "For the ‘nage’": [
            "dash oil",
            "300g/10½oz onion, chopped",
            "200g/7oz celery, roughly chopped",
            "4 garlic cloves, sliced",
            "2 sprigs rosemary, leaves picked and chopped"
        ],
        "For the croûtons": [
            "½ loaf wholemeal bread",
            "50g/1¾oz butter",
            "1 garlic clove, grated"
        ],
        "For the watercress oil": [
            "80g/2¾oz picked watercress",
            "150ml/5fl oz non-scented oil, such as vegetable or sunflower oil"
        ]
    },
    "steps": [
        "For the pickled quails’ eggs, make the pickle liquor by bringing the sugar, vinegar, spices and 50ml/1¾fl oz of water to the boil in a non-reactive saucepan. Leave to cool. Pass this liquid through a sieve into a clean container with a lid.",
        "Cook the quails’ eggs in a pan of boiling water for two minutes and refresh in a bowl of iced water. Once cool, peel and place in the pickle liquor. Leave them at least overnight to pickle, but you can leave them for up to five days.",
        "For the watercress soup, separate the watercress leaves and stalks. Blanch the watercress leaves in a pan of salted boiling water until soft and transfer to a bowl of iced water. Squeeze out the water and set aside 500g/1lb 2oz.",
        "For the nage, in a separate pan, heat a dash of oil and fry the onions, celery, garlic and rosemary until softened, but not coloured. Once softened, add 500ml/18fl oz of water, bring to the boil and then add the watercress stalks. Remove from the heat and cover with cling film for 10 minutes to infuse the flavour. Pass the liquid through a fine sieve. Set aside.",
        "For the soup, heat another dash of oil in a pan and fry the onions in oil. Add the sliced potatoes. Add a little of the nage to cook the potatoes. Add more nage and bring to the boil and then take it off the heat.",
        "Add some of the blanched watercress to a blender or food processor with the potatoes and nage and blend together - it will go bright green. Strain through a fine sieve into a clean bowl and add salt. Set aside and keep warm until ready to serve.",
        "For the croûtons, remove the crusts from the bread and place them in the freezer on a baking tray while you make the watercress oil - this will help to keep the shapes nice and sharp.",
        "Preheat the oven to 200C/400F/Gas 6 for baking the croutons later.",
        "For the watercress oil, put the picked watercress in a blender. Heat the oil to 150C/300F in a pan (use a cook's thermometer to check the temperature) and pour the oil onto the watercress. Blend and pass through a clean muslin cloth into a bowl. Leave to chill in the fridge.",
        "For the croûtons, in an ovenproof frying pan, heat a little butter until nut brown. Add the diced bread and coat it in the butter. Add the grated garlic and mix together.",
        "Bake in the preheated oven for eight minutes or until golden-brown, remove and drain on a plate lined with kitchen paper.",
        "To serve the soup, put one quails’ egg in the bottom of each bowl and then add a little diced Granny Smith apple. Pour on the soup and top with the croûtons and watercress oil."
    ],
    "howTos": [
        
    ],
    "videos": "[]"
}