{
    "author": {
        "yasmin_khan": "Yasmin Khan"
    },
    "cookTime": "over 2 hours",
    "cusine": "Turkish_and_Middle_Eastern",
    "description": "This nutty chicken stew boasts deliciously subtle layers of flavour thanks to pomegranate molasses, tomatoes and spices.",
    "dishes": [
        "casserole",
        "chicken_stew",
        "sauce",
        "stew",
        "stir-fries"
    ],
    "flags": [
        
    ],
    "howTos": [
        
    ],
    "images": [
        
    ],
    "ingredients": {
        "default": [
            "250g/9oz walnut halves",
            "2 ice cubes",
            "125ml/4½fl oz pomegranate molasses, plus extra to taste",
            "1 tbsp concentrated tomato purée",
            "¼ tsp ground cinnamon",
            "2 tbsp caster sugar, plus extra to taste",
            "2 tsp salt",
            "1 tsp freshly ground black pepper",
            "800g/1¾lb bone-in chicken thighs, skin removed",
            "pomegranate seeds, to garnish (optional)",
            "steamed rice, to serve"
        ]
    },
    "prepTime": "less than 30 mins",
    "recommendations": "2",
    "serves": "Serves 4",
    "show": {
        "b05y38pk": "Nigel Slater: Eating Together"
    },
    "steps": [
        "Grind the walnuts as finely as possible in a food processor until they have the consistency of peanut butter and the walnut crumbs are starting to stick together like a dough.",
        "Transfer the ground walnuts to a large, lidded casserole and pour over 1 litre/1¾ pints of the cold water. Bring the mixture to the boil and boil for 4-5 minutes, then reduce the heat until the mixture is just simmering.",
        "Simmer the walnut mixture, half-covered with the casserole lid, for 2 hours, adding the remaining 200ml/7fl oz of cold water and 2 ice cubes halfway through cooking, and stirring occasionally throughout to make sure the walnuts don’t stick to the bottom of the casserole. After 2 hours, the walnut sauce should have thickened and darkened in colour.",
        "Stir in the pomegranate molasses, tomato purée, cinnamon, sugar, salt and pepper until well combined. Return the mixture to a simmer.",
        "Add the chicken thighs, return the mixture to a simmer, then replace the lid and continue to simmer gently over a low heat for a further 1 hour. Remove the lid for the last 10 minutes of cooking to allow the sauce to thicken. Season, to taste, with more sugar (for sweet) or pomegranate molasses (for sour).",
        "Garnish the dish with a handful of pomegranate seeds, if using, and serve with steamed rice."
    ],
    "tips": [
        
    ],
    "title": "Fesenjoon",
    "videos": "[]"
}