{
    "name": [
        "Glynn Purnell"
    ],
    "about": [
        "Birmingham native Glynn Purnell is one of the country’s culinary rising stars. He's also been a major influence in putting his home city firmly on the culinary map. Glynn is chef-proprietor of Purnell's, in Birmingham's financial district, which was awarded its first Michelin star in January 2009. He was previously head chef at Jessica's restaurant, where he helped earn a Michelin star in 2005.",
        "Glynn started his foray into the restaurant world when he began work experience in the kitchen of the Birmingham Metropole Hotel. Two years later, he left school and returned to pursue an apprenticeship. There, he spent six years working in all areas of the hotel, including the banqueting department and in The Terrace restaurant, which ignited his interest in fine dining.",
        "His talent really shone through when he joined Andreas Antona's Michelin-starred Simpson's restaurant in Kenilworth, as chef de partie. Trips to Europe on 'stages', or placements, were followed eventually with opportunities to work with a number of well known chefs including Gary Rhodes at The Greenhouse, Gordon Ramsay at Aubergine and with Alistair Little, all in London. He's also spent time working in kitchens abroad, with the Pourcel brothers in Montpellier at their Le Jardin des Sens and at Zaldiarán in the Basque country of northern Spain.",
        "In 2002 Glynn joined Claude Bosi at his Michelin-starred Hibiscus restaurant (then still located in Ludlow) as sous chef. It was only after nine months that he moved on to Jessica's; Purnell's opened several years later, in 2007.",
        "Glynn has won numerous awards and critical accolades for his inspired, adventurous cooking."
    ],
    "image": "http://ichef.bbci.co.uk/food/ic/food_1x1_304/chefs/glynn_purnell_1x1.jpg",
    "recipes": [
        "roast_pork_belly_with_04367",
        "red_mullet_with_ceps_and_93065",
        "mint_chocolate_cremosa_95030",
        "roastloinofvenisonwi_93125",
        "goatscheeseroyalandp_88196",
        "mince_pie_rolls_61196",
        "short_rib_of_beef_with_66188",
        "fennel_and_asparagus_27366",
        "salt_baked_potatoes_with_95825",
        "scallops_with_raw_46457",
        "scorched_confit_pork_51052",
        "peas_a_la_franais_with_03769",
        "posh_sausage_roll_64375",
        "brown_shrimp_and_potato_63070",
        "poachedeggyolkrocket_92364",
        "onepotpollockwithcho_92367",
        "spiced_cauliflower_with_77223",
        "chicken_thighs_with_pea_92612",
        "warmchocolatemoussew_92366",
        "roast_duck_breast_with_81601",
        "red_mullet_with_a_fennel_79122",
        "vanilla_baked_cheesecake_59336",
        "guinea_fowl_maryland_95208",
        "roastduckrolledinliq_93904",
        "roastedspicedlambwit_92365",
        "marinatedstrawberrie_88476",
        "roastporkwithcarrots_91061",
        "velout_of_butternut_73856",
        "spiced_potted_shrimp_77214",
        "turbot_cooked_in_coconut_39010",
        "roast_brill_with_55417",
        "braised_elbow_of_lamb_04295",
        "tail_fillet_of_beef_with_25038"
    ]
}