{
    "name": [
        "Matt Tebbutt"
    ],
    "about": [
        "Matt Tebbutt was born in High Wycombe but moved to Wales when he was six months old and classifies himself as 'an honorary Welshman', having grown up in Newport.",
        "A passion for good food and cooking developed early for Matt, partly thanks to family holidays to France and Italy, but the decision to be a chef didn’t come until later in life. He studied geography at Oxford Brookes University and an early ambition to be a pilot led him to join the university air squadron. He eventually decided against a 12-year signing with the RAF and turned his attentions to becoming a chef.",
        "Matt's culinary career began with a diploma from Leith's School of Food and Wine. He completed a traineeship with Marco Pierre White, then moved to the kitchens of Chez Bruce, followed by a stint at Clarke's, where he learned the art of bread-making.",
        "He returned to Wales in 2001 after an absence of eight years and, with his wife Lisa, has transformed the former Foxhunter pub at Nantyderry into an acclaimed restaurant, winning AA Restaurant of the Year for Wales in 2004. Matt had previously also worked with pioneering chef Alastair Little at his Lancaster Road and Soho restaurants, and the chef's influence is evident in Matt's menu at the Foxhunter."
    ],
    "image": "http://ichef.bbci.co.uk/food/ic/food_1x1_304/chefs/matt_tebbutt_1x1.jpg",
    "recipes": [
        "chocolate_and_peanut_73196",
        "slow-braised_octopus_40696",
        "miso_soup_with_oysters_18228",
        "pennewithhaloumiandc_92783",
        "chestnutandpearmille_92786",
        "porkcookedwithmilkci_90605",
        "mussel_and_pea_paella_42918",
        "lambs_liver_with_60023",
        "rhubarbandpolentacru_85873",
        "saltmarshlambsamphir_89242",
        "blue_cheese_cote_de_92417",
        "sausagepumpkinandsag_92737",
        "spicedmarinatedrabbi_87837",
        "lambrackwithspinacha_92736",
        "asianquailsalad_89471",
        "wild_duck_with_63250",
        "white_currant_and_whisky_86804",
        "spinachandgorgonzola_89474",
        "quicktiramisu_89473",
        "soy_glazed_mackerel_with_05297",
        "okracurrycouscousand_92782",
        "roastpollockpanzanel_89472",
        "the_great_british_faggot_22530",
        "johndorywithorangefe_92735",
        "steak_and_kidney_pudding_15428",
        "glazed_ham_with_56539"
    ]
}