{
    "name": [
        "Mitch Tonks"
    ],
    "about": [
        "Mitch Tonks is driven by a passion to enthuse, cook for and inspire others to enjoy seafood. His advice focuses on sourcing the freshest fish, key preparation techniques and simple no-fuss cooking. His method is one of practical, no frills techniques that actually work.",
        "Born in 1966, Mitch spent the first 24 years of his life by the sea. After working as an accountant, he decided to fulfil his passion for seafood by opening a specialist fishmonger in Bath.",
        "Mitch is a prolific and award winning restaurateur. His restaurants include, The RockFish Grill & Seafood Market, The Seahorse in Dartmouth and he was founder of The FishWorks, a chain of restaurants and fishmongers.",
        "His book Fish Easy was published in 2012 and concentrates on 30-minute seafood recipes. Other books include, FISH, The FishWorks Seafood Café Cookbook, The Fishmonger's Cookbook and The Aga Seafood Cook Book.",
        "Television appearances include Saturday Kitchen, Market Kitchen, Masterchef, Great Food Live, Fish Food and Mitch and Matt's Big Fish, accompanied by Matt Dawson. Mitch also demonstrates at various cookery schools and regional festivals throughout the year."
    ],
    "image": "http://ichef.bbci.co.uk/food/ic/food_1x1_304/chefs/mitch_tonks_1x1.jpg",
    "recipes": [
        "bakedseabreamwithgar_90179",
        "how_to_make_fish_fingers_64484",
        "dressedcrab_90206",
        "seabassbakedinasaltc_90284",
        "musselswithwineandpa_90229",
        "prawnsbakedinseasalt_68019",
        "how_to_make_trout_en_49680",
        "seabassroastedwithro_90285",
        "seabassfilletwithros_72151",
        "chargrilledsweetands_90198",
        "how_to_make_thai_green_67270",
        "grilledsquidwithlemo_70508",
        "searedtunasteakswith_90287",
        "how_to_make_fish_pie_56143",
        "panfriedtunawithsals_70509",
        "fishermanssoup_90211",
        "squidwithmintchillic_90292",
        "seabasswithtomatooli_72150",
        "crispfriedplaice_90189",
        "seabasswithwalnutmin_72149",
        "thaistylefishcakes_90298",
        "roastedcodfilletwith_71654",
        "fishstock_90209",
        "how_to_make_thai_green_83259",
        "steamedmusselswithwi_68022",
        "spaghettiwithlobster_90289",
        "sweetandsourmussells_73658"
    ]
}